Repository: d4n3436/Fergun
Catalog: src/Resources/Modules.OtherModule.*.resx
Languages: es

source: &quot;{0}&quot; is instrumental.
es: "{0}" es instrumental.

source: &quot;{0}&quot; is unreleased.
es: "{0}" aún no ha sido lanzado.

source: Bot Owner
es: Dueño del bot

source: Bot Version
es: Versión del bot

source: Click the button below to invite Fergun to your server.
es: Haga click en el botón de abajo para invitar a Fergun a tu servidor.

source: Command Stats
es: Estadísticas de Comandos

source: command-stats.description
es: Muestra las estadísticas de uso de los comandos.

source: command-stats.name
es: estadísticas-de-comandos

source: CPU Usage
es: Uso de CPU

source: Fergun Stats
es: Estadísticas de Fergun

source: inspirobot.description
es: Envía una cita inspiradora.

source: inspirobot.name
es: inspirobot

source: Invite Fergun
es: Invita a Fergun

source: invite.description
es: Invita Fergun a tu servidor.

source: invite.name
es: invitar

source: Library
es: Librería

source: Lyrics by Genius | Page {0} of {1}
es: Letra por Genius | Página {0} de {1}

source: lyrics.description
es: Obtiene la letra de una canción.

source: lyrics.name
es: letra

source: lyrics.name.description
es: El nombre de la canción.

source: lyrics.name.name
es: nombre

source: No stats to display.
es: Sin estadísticas que mostrar.

source: Operating System
es: Sistema Operativo

source: RAM Usage
es: Uso de RAM

source: Shard ID
es: ID de shard

source: stats.description
es: Envía las estadísticas del bot.

source: stats.name
es: estadísticas

source: Total Servers
es: Servidores Totales

source: Total Users
es: Usuarios Totales

source: Unable to find a song with ID {0}. Use the autocomplete results.
es: No se pudo encontrar una canción con ID {0}. Usa los resultados de autocompletado.

source: Unable to get the lyrics of &quot;{0}&quot;.
es: No es posible obtener la letra de "{0}".

source: Uptime
es: Tiempo activo

source: View Artist
es: Ver Artista

source: View on Genius
es: Ver en Genius
