Repository: d4n3436/Fergun
Catalog: src/Resources/SharedResource.*.resx
Languages: es

source: An error occurred.
es: Ocurrió un error.

# BingImageByteSizeExceedsLimit
source: Image size exceeds the limit (Max. 20MB).
es: El tamaño de imagen supera el límite (Máx. 20MB).

# BingImageDimensionsExceedLimit
source: Image dimensions exceeds the limit (Max. 4000px).
es: Las dimensiones de imagen supera el límite (Máx. 4000px).

# BingImageDownloadFailed
source: Bing Visual search failed to download the image.
es: La Búsqueda Visual de Bing no pudo descargar la imagen.

# BingServiceUnavailable
source: Bing Visual search is currently unavailable. Try again later.
es: La Búsqueda Visual de Bing no está disponible actualmente. Vuelva a intentarlo más tarde.

# BingUnknownFormat
source: Unknown format. Try using JPEG, PNG, or BMP files.
es: Formato desconocido. Intenta usar archivos JPEG, PNG o BMP.

# Blacklisted
source: You're blacklisted.
es: Estás en la lista negra.

# BlacklistedWithReason
source: You're blacklisted with reason: {0}
es: Estás en la lista negra con el motivo: {0}

# CouldNotConvertValueToColor
source: Could not convert \"{0}\" to a color.
es: No se pudo convertir "{0}" a un color.

# ErrorMessage
source: Error message: {0}
es: Mensaje de error: {0}

# ExpiredJumpInput
source: Expired modal interaction. You must respond within {0} second(s).
es: Interacción de modal expirada. Debes responder en {0} segundo(s).

source: Input
es: Entrada

# InvalidJumpInput
source: Invalid input. The number must be in the range of {0} to {1}, excluding the current page.
es: Entrada inválida. El número debe estar en rango de {0} a {1}, excluyendo la página actual.

# InvalidSourceLanguage
source: Invalid source language \"{0}\".
es: Idioma de origen "{0}" inválido.

# InvalidTargetLanguage
source: Invalid target language \"{0}\".
es: Idioma de destino "{0}" inválido.

# JumpInputInUse
source: Another user is currently using this action. Try again later.
es: Otro usuario está usando esta acción actualmente. Vuelva a intentarlo más tarde.

# JumpInputPrompt
source: Enter a page number
es: Ingresa un número de página

# LanguageNotSupported
source: Language \"{0}\" not supported.
es: Idioma "{0}" no soportado.

# NoImageUrlInMessage
source: Unable to get an image URL from the message.
es: No se puede obtener una URL de imagen del mensaje.

source: None
es: Nada

source: No results.
es: Sin resultados.

# NumberExcess
source: and {0} more...
es: y {0} más...

source: Output
es: Salida

# PaginatorFooter
source: Page {0} of {1}
es: Página {0} de {1}

# Ratelimited
source: This command is on cooldown! Try again in {0} second(s).
es: Espera {0} segundo(s) antes de volver a usar este comando!

source: Result
es: Resultado

source: Source language
es: Idioma de origen

source: Source language (Detected)
es: Idioma de origen (Detectado)

source: Target language
es: Idioma de destino

# TextMustNotBeEmpty
source: The text must not be empty.
es: El texto no debe estar vacío.

source: Translation result
es: Resultado de traducción

# UnableToGetVoice
source: Unable to get the specified voice. Use the autocomplete results.
es: No se puede obtener la voz especificada. Utilice los resultados de autocompletado.

source: Unknown paginator builder type
es: Tipo de constructor de paginador desconocido

# UrlNotWellFormed
source: The URL is not well-formed.
es: La URL no está bien formada.

# UrlOrAttachmentRequired
source: A URL or attachment is required.
es: Se requiere una URL o un archivo adjunto.
