Repository: d4n3436/Fergun
Catalog: src/strings.*.resx
Languages: ar, es, tr

source: Command List
ar: قائمة الأوامر
es: Lista de comandos
tr: Komut listesi

source: Entertainment commands
ar: أوامر الترفيه
es: Comandos de entretenimiento
tr: Eğlence komutları

# HelpFooter
source: Fergun {0} - Total command count: {1}
ar: Fergun {0} - إجمالي عدد الأوامر: {1}
es: Fergun {0} - Cantidad total de comandos: {1}
tr: Fergun {0} - Toplam komut sayısı: {1}

source: Moderation commands
ar: أوامر الإشراف
es: Comandos de moderación
tr: Denetleme komutları

source: Music commands
ar: أوامر الموسيقى
es: Comandos de música
tr: Müzik komutları

source: Notes
ar: ملاحظات
es: Notas
tr: Notlar

# NotesInfo
source: Use `{0}help [command]` to get more info about a command.
ar: استخدم `help [command]{0}` لمعرفة المزيد من المعلومات حول الأمر.
es: Usa `{0}help [comando]` para obtener mas información sobre un comando.
tr: Bir komut hakkında daha fazla bilgi almak için `{0}help [komut] 'kullanın.

source: Other commands
ar: أوامر أخرى
es: Otros comandos
tr: Diğer komutlar

source: Text commands
ar: أوامر نصية
es: Comandos de texto
tr: Metin komutları

source: Utility commands
ar: أوامر المنفعة
es: Comandos de utilidad
tr: Yardımcı program komutları

source: Upcoming commands
ar: الأوامر القادمة
es: Próximos comandos
tr: Yaklaşan komutlar

# CommandNotFound
source: Command not found. Use `{0}help` to view the command list.
ar: القيادة لم يتم العثور. استخدم `{0} help` لعرض قائمة الأوامر.
es: Comando no encontrado. Usa `{0}help` para ver la lista de comandos.
tr: Komut bulunamadı. Kullanım `{0}help` komut listesini görmek için.

# NoDescription
source: (No description available)
ar: (لا يوجد وصف متاح)
es: (Descripción no disponible)
tr: (Açıklama yok)

source: (Optional)
ar: (اختياري)
es: (Opcional)
tr: (İsteğe bağlı)

source: Usage
ar: إستعمال
es: Uso
tr: Kullanımı

# Alias
source: Alias(es)
ar: اسماء مستعارة)
es: Alias
tr: Takma ad(lar)

source: Parameters
ar: المعلمات
es: Parámetros
tr: Parametreler

# mojibakeSummary
source: Shows random unicode characters.
ar: يظهر أحرف يونيكود عشوائية.
es: Muestra caráctereres unicode aleatorios.
tr: Rasgele unicode karakterleri gösterir.

# mojibakeParam1
source: The result length.
ar: طول النتيجة.
es: El tamaño del resultado.
tr: Sonuç uzunluğu.

# 3orMoreChars
source: The text must have 3 or more characters.
ar: يجب أن يحتوي النص على 3 أحرف أو أكثر.
es: El texto debe tener 3 o mas carácteres.
tr: Metin 3 veya daha fazla karakter içermelidir.

# TooLongToDisplay
source: The resulting text is too long to display ({0}).
ar: النص الناتج أطول من أن يمكن عرضه ({0})
es: El texto resultante es demasiado largo para ser mostrado ({0}).
tr: Ortaya çıkan metin görüntülenemeyecek kadar uzun ({0})

# normalizeSummary
source: Normalizes a text.
ar: تطبيع النص.
es: Normaliza un texto.
tr: Bir metni normalleştirir.

# normalizeParam1
source: The text to normalize.
ar: النص المطلوب تطبيعه.
es: El texto a normalizar.
tr: Normalleştirilecek metin.

# randomizeSummary
source: Randomizes a text.
ar: عشوائية النص.
es: Aleatoriza un texto.
tr: Metni rastgele seçer.

# randomizeParam1
source: The text to randomize.
ar: النص العشوائي.
es: El texto a aleatorizar.
tr: Rastgele yazılacak metin.

# repeatSummary
source: Repeats a text a number of times.
ar: يكرر نصًا عدة مرات.
es: Repite un texto un número de veces.
tr: Bir metni birkaç kez tekrarlar.

# repeatParam1
source: The times to repeat.
ar: مرات التكرار.
es: Las veces a repetir.
tr: Tekrarlama zamanı.

# repeatParam2
source: The text to repeat.
ar: النص المكرر.
es: El texto a repetir.
tr: Tekrarlanacak metin.

# reverseSummary
source: Reverses a text.
ar: عكس النص.
es: Invierte un texto.
tr: Metni ters çevirir.

# reverseParam1
source: The text to reverse.
ar: النص المراد عكسه.
es: El texto a invertir.
tr: Tersine çevrilecek metin.

# reverselinesSummary
source: Reverses the line order of a text.
ar: لعكس ترتيب سطر النص.
es: Invierte el orden de las líneas de un texto.
tr: Metnin satır sırasını tersine çevirir.

# reverselinesParam1
source: The text to reverse its lines.
ar: النص لعكس خطوطه.
es: El texto a invertir sus líneas.
tr: Çizgilerini ters çevirecek metin.

# reversewordsSummary
source: Reverses the words order of a text.
ar: لعكس ترتيب الكلمات في النص.
es: Invierte el orden de las palabras de un texto.
tr: Bir metnin sözcük sırasını tersine çevirir.

# reversewordsParam1
source: The text to reverse its words.
ar: النص لعكس كلماته.
es: El texto a invertir sus palabras.
tr: Kelimelerini tersine çevirmek için metin.

# sarcasmParam1
source: The text to convert.
ar: النص المطلوب تحويله.
es: El texto a convertir.
tr: Dönüştürülecek metin.

# vaporwaveSummary
source: Converts a text to vaporwave.
ar: يحول النص إلى vaporwave.
es: Convierte un texto a vaporwave.
tr: Bir metni vaporwave'e dönüştürür.

# vaporwaveParam1
source: The text to convert.
ar: النص المطلوب تحويله.
es: El texto a convertir.
tr: Dönüştürülecek metin.

# avatarSummary
source: Returns the avatar of the current user, or a specific user, if passed.
ar: إرجاع الصورة الرمزية للمتصل بالأمر ، أو مستخدم معين ، إذا تم تمريره.
es: Retorna el avatar del usuario actual, o de un usuario en específico, si se pasa alguno.
tr: Geçerli kullanıcının veya belirli bir kullanıcının avatarını iletilirse döndürür.

# avatarParam1
source: The user to get its avatar.
ar: المستخدم للحصول على الصورة الرمزية الخاصة به.
es: El usuario a obtener su avatar.
tr: Avatarını almak için kullanıcı.

# base64encodeSummary
source: Encodes a text to Base64.
ar: يشفر النص إلى Base64.
es: Codifica un texto a Base64.
tr: Metni Base64'e kodlar.

# base64encodeParam1
source: The text to encode.
ar: النص المطلوب ترميزه.
es: El texto a codificar.
tr: Kodlanacak metin.

# base64decodeSummary
source: Decodes a text from Base64.
ar: يفك تشفير نص من Base64.
es: Decodifica un texto en Base64.
tr: Base64'ten bir metni çözer.

# base64decodeParam1
source: The text to decode.
ar: النص لفك.
es: El texto a decodificar.
tr: Kod çözülecek metin.

# base64decodeInvalid
source: Invalid encoded text.
ar: نص غير صالح.
es: Texto codificado inválido.
tr: Geçersiz kodlanmış metin.

# choiceSummary
source: Chooses an option from a list.
ar: يختار خيار من القائمة.
es: Escoje una opción de una lista.
tr: Listeden bir seçenek seçer.

# choiceParam1
source: A space separated list of choices.
ar: قائمة خيارات مفصولة بمسافات.
es: Una lista separada por espacios de opciones.
tr: Boşluktan ayrılmış seçenekler listesi.

source: I choose...
ar: انا اخترت...
es: Yo escojo...
tr: Seçerim...

# OneChoice
source: ...because you only gave me one choice
ar: ... لأنك منحتني خيارًا واحدًا فقط
es: ...porque solo me distes una opción
tr: ... çünkü bana sadece bir seçim yaptın

# colorSummary
source: Shows a random or specific color.
ar: يظهر لونًا عشوائيًا أو محددًا.

# colorParam1
source: The specific color to use. Must be a hex value, raw value or a known color name.
ar: اللون المحدد للاستخدام. يجب أن تكون قيمة سداسية عشرية أو قيمة خام أو اسم لون معروف.

# helpSummary
source: Shows the help menu or the info of a command, if passed.
ar: إظهار قائمة التعليمات أو معلومات الأمر ، إذا تم تمريرها.
es: Muestra el menú de ayuda o la información de un comando, si se pasa alguno.
tr: Aktarılırsa yardım menüsünü veya komutun bilgilerini gösterir.

# helpParam1
source: The command to get info from.
ar: الأمر للحصول على معلومات.
es: El comando a obtener su información.
tr: Bilgi alma komutu.

# identifySummary
source: Identifies an image with Microsoft CaptionBot.
ar: يحدد صورة باستخدام Microsoft CaptionBot.
es: Identifica una imagen con Microsoft CaptionBot.
tr: Microsoft CaptionBot ile bir görüntü tanımlar.

# identifyParam1
source: The url of an image to use.
ar: عنوان URL للصورة المراد استخدامها.
es: La url de una imagen a usar.
tr: Kullanılacak bir resmin URL'si.

# NoUrlPassed
source: Not specifying a url will make the command to search for the last x messages in cache for a link or an attachment.
ar: لا تحديد عنوان URL سيجعل الأمر للبحث عن رسائل س مشاركة في ذاكرة التخزين المؤقت لرابط أو مرفق.
es: El no especifiar una url hará que el comando busque en los últimos x mensajes en la caché por un link o un archivo adjunto.
tr: komutu bir bağlantı veya bir eki için önbellekte Son x ileti aramak için yapacak bir url belirterek Değil.

# AttachmentNotImage
source: The attachment is not an image.
ar: المرفق ليس صورة.
es: El archivo adjunto no es una imagen.
tr: Ek bir resim değil.

# UrlNotFound
source: Could not find any url or attachment in the last {0} messages.
ar: تعذر العثور على أي عنوان url أو مرفق في آخر {0} رسائل.
es: No se pudo encontrar alguna url o archivo adjunto en los últimos {0} mensajes.
tr: Son {0} iletide herhangi bir url veya ek bulunamadı.

# UrlNotImage
source: The url is not a valid image.
ar: عنوان url ليس صورة صالحة.
es: La url no es una imagen válida.
tr: URL geçerli bir resim değil.

# imgSummary
source: Searches for images with Google Images.
ar: يبحث عن الصور باستخدام صور Google.
es: Busca imágenes con Google Images.
tr: Google Görseller ile görselleri arar.

# imgParam1
source: The keyword(s) to search.
ar: الكلمة (الكلمات) الرئيسية للبحث.
es: Las palabras clave a buscar.
tr: Aranacak anahtar kelimeler.

# NoResultsFound
source: Could not find any results.
ar: تعذر العثور على أي نتائج.
es: No se encontraron resultados.
tr: Herhangi bir sonuç bulunamadı.

# IfNSFW
source: If the search is NSFW, use the command in a NSFW channel.
ar: إذا كان البحث NSFW ، استخدم الأمر في قناة NSFW.
es: Si la búsqueda es NSFW, usa el comando en un canal NSFW.
tr: Arama NSFW ise, komutu bir NSFW kanalında kullanın.

source: Image search
ar: بحث في الصور
es: Búsqueda de imagen
tr: Görsel arama

# UrbanFooter
source: Urban Dictionary - Page {0} of {1}
ar: Urban Dictionary - صفحة {0} من {1}
es: Urban Dictionary - Página {0} de {1}
tr: Kentsel Sözlük - Sayfa {0} / {1}

# ImageSearchCap
source: Image search cap reached :(
ar: تم الوصول إلى الحد الأقصى لبحث الصور :(
es: Límite de búsqueda de imágenes alcanzada :(
tr: Görsel arama sınırına ulaşıldı :(

# ocrSummary
source: Performs OCR to an image with OCR.SPACE.
ar: ينفذ OCR على صورة مع OCR.SPACE
es: Realiza OCR a una imagen con OCR.SPACE.
tr: OCR ile bir görüntüye OCR işlemi gerçekleştirir.

# ocrParam1
source: The url of an image to use.
ar: عنوان URL للصورة المراد استخدامها.
es: La url de una imagen a usar.
tr: Kullanılacak bir resmin URL'si.

# UrlFileTooLarge
source: The file is too large.
ar: الملف كبير جدًا.
es: El archivo es demasiado grande.
tr: Dosya çok büyük.

# OcrEmpty
source: The OCR did not give results.
ar: لم يعط OCR نتائج.
es: El OCR no dió resultados.
tr: OCR sonuç vermedi.

# ocr2Summary
source: Performs OCR to an image with Tesseract.
ar: ينفذ OCR إلى صورة.
es: Realiza OCR a una imagen con Tesseract.
tr: Tesseract ile bir görüntüye OCR işlemi yapar.

# ocr2Param1
source: The url of an image to use.
ar: عنوان URL للصورة المراد استخدامها.
es: La url de una imagen a usar.
tr: Kullanılacak bir resmin URL'si.

source: Status code:
ar: رمز الحالة:
es: Código de estado:
tr: Durum kodu:

# pingSummary
source: Gets the latency in sending a message and the latency of the Database.
ar: يحصل الكمون في إرسال رسالة والكمون من قاعدة البيانات.
es: Obtiene la latencia al enviar un mensaje y la latencia de la base de datos.
tr: Bir mesaj ve Veritabanı gecikme gönderme gecikmeyi alır.

# resizeSummary
source: Resizes an image with waifu2x.
ar: يغير حجم الصورة مع waifu2x.
es: Redimensiona una imagen con waifu2x.
tr: Bir görüntüyü waifu2x ile yeniden boyutlandırır.

# resizeParam1
source: The url of an image to use.
ar: عنوان URL للصورة المراد استخدامها.
es: La url de una imagen a usar.
tr: Kullanılacak bir resmin URL'si.

source: An error occurred.
ar: حدث خطأ.
es: Ocurrió un error.
tr: Bir hata oluştu.

source: Resize results
ar: تغيير حجم النتائج
es: Resultados de redimensión
tr: Sonuçları yeniden boyutlandır

# screenshotSummary
source: Takes a screenshot to a website.
ar: يأخذ لقطة شاشة لموقع ويب.
es: Toma una captura de pantalla a un sitio web.
tr: Bir web sitesine ekran görüntüsü alır.

# screenshotParam1
source: The website to take a screenshot.
ar: الموقع لأخذ لقطة شاشة.
es: El sitio web a tomar una captura de pantalla.
tr: Ekran görüntüsü alacak web sitesi.

# serverinfoSummary
source: Returns info about the current server.
ar: يعود من المعلومات حول الملقم الحالي.
es: Retorna información del servidor.
tr: Geçerli sunucu hakkında bilgi döndürür.

source: Server info
ar: معلومات الخادم
es: Información de servidor
tr: Sunucu bilgisi

source: Name
ar: اسم
es: Nombre
tr: ad

source: Owner
ar: صاحب
es: Dueño
tr: Sahip

source: Role count
ar: عدد الأدوار
es: Número de roles
tr: Rol sayısı

source: User count
ar: عدد المستخدمين
es: Número de usuarios
tr: Kullanıcı sayısı

source: Verification level
ar: مستوى التحقق
es: Nivel de verificación
tr: Doğrulama seviyesi

source: (None)
ar: (بلا)
es: (Nada)
tr: (Yok)

source: Created at
ar: أنشئت في
es: Creado en
tr: Oluşturma tarihi

# snipeSummary
source: Shows the last deleted message in the current channel or the specified.
ar: يعرض آخر رسالة محذوفة في القناة الحالية.
es: Muestra el último mensaje eliminado en el canal actual.
tr: Geçerli kanaldaki son silinen mesajı gösterir.

# NothingToSnipe
source: Nothing to snipe in {0}
ar: لا يوجد شيء للقنص في {0}
es: Nada que mostrar en {0}
tr: {0} içinde kaçacak bir şey yok

# translateSummary
source: Translates a text.
ar: يترجم النص.
es: Traduce un texto.
tr: Bir metni çevirir.

# translateParam1
source: The target language in ISO code (`en`, `es`, `br`, etc.)
ar: اللغة الهدف في رمز ISO (`en` ،` es` ، `br` ، إلخ) ، تتراجع إلى اللغة الإنجليزية إذا كان الهدف غير صالح.
es: اللغة الهدف في رمز ISO (`en`, `es`, `br`, إلخ.)
tr: ISO kodundaki (`en`, `es`, `br`, vb.) Hedef dil, hedef geçersizse İngilizce'ye döner.

# translateParam2
source: The text to translate.
ar: النص المراد ترجمته.
es: El texto a traducir.
tr: Çevrilecek metin.

# InvalidLanguage
source: Invalid target language. Use `{0}translate language codes` to see the language list.
ar: لغة الهدف غير صالحة. رموز اللغات الصالحة هي:
es: Idioma de destino inválido. Usa `{0}translate language codes` para ver la lista de idiomas.
tr: Geçersiz hedef dil. Geçerli dil kodları:

# GoogleIPBanned
source: I got IP banned by Google :( lol
ar: لقد تم حظر IP من قبل Google :( لول
es: Google me dió IP ban :( lol
tr: Google tarafından IP yasaklandı :( lol

# ttsSummary
source: Text to speech.
ar: النص إلى الكلام.
es: Texto a voz.
tr: Konuşma metni.

# ttsParam1
source: The target language in ISO code (`en`, `es`, `br`, etc.), fallback to English if the target is invalid.
ar: اللغة الهدف في رمز ISO (`en` ،` es` ، `br` ، إلخ) ، تتراجع إلى اللغة الإنجليزية إذا كان الهدف غير صالح.
es: El idioma de destino en el código ISO (en, es, br, etc.), Inglés por defecto en caso de idioma inválido.
tr: ISO kodundaki (`en`, `es`, `br`, vb.) Hedef dil, hedef geçersizse İngilizce'ye döner.

# ttsParam2
source: The text to convert.
ar: النص المطلوب تحويله إلى كلام.
es: El texto a convertir a voz.
tr: Dönüştürülecek metin.

# urbanSummary
source: Urban Dictionary search.
ar: البحث في القاموس الحضري.
es: Búsqueda en Urban Dictionary.
tr: Kentsel Sözlük arama.

# urbanParam1
source: The keyword(s) to search.
ar: الكلمة (الكلمات) الرئيسية للبحث.
es: Las palabras clave a buscar.
tr: Aranacak anahtar kelimeler.

source: No results.
ar: لا نتائج.
es: Sin resultados.
tr: Sonuç yok.

source: By
ar: بواسطة
es: Por
tr: Tarafından

source: Example
ar: مثال
es: Ejemplo
tr: Misal

# NoExample
source: (No example provided)
ar: (لم يتم تقديم مثال)
es: (Sin ejemplo proporcionado)
tr: (Örnek verilmemiştir)

# userinfoSummary
source: Returns info about the current user, or a specific user, if passed.
ar: إرجاع معلومات حول المستخدم الحالي ، أو مستخدم معين ، في حالة مرور المستخدم.
es: Retorna información del usuario actual, o de un usuario en específico, si se pasa alguno.
tr: Geçerli kullanıcı veya geçildiyse belirli bir kullanıcı hakkında bilgi döndürür.

# userinfoParam1
source: The user to get info from.
ar: المستخدم للحصول على معلومات من.
es: El usuario a obtener su información.
tr: Bilgi almak için kullanıcı.

source: User info
ar: معلومات المستخدم
es: Información del usuario
tr: Kullanıcı bilgisi

source: Activity
ar: نشاط
es: Actividad
tr: Aktivite

source: Is bot
ar: بوت
es: Es bot
tr: Bot mu

source: Guild join date
ar: تاريخ انضمام النقابة
es: Dia de ingreso al servidor
tr: Lonca katılma tarihi

# UserNotFound
source: User not found. Try using a mention or an ID.
ar: المستخدم غير موجود حاول استخدام إشارة أو معرّف.
es: El usuario no fue encontrado. Intenta usar una mención o una ID.
tr: Kullanıcı bulunamadı Bir söz veya kimlik kullanmayı deneyin.

# wikipediaSummary
source: Searches for an article on Wikipedia.
ar: يبحث عن مقال في ويكيبيديا.
es: Busca un artículo en Wikipedia.
tr: Wikipedia'da bir makale arar.

# wikipediaParam1
source: The keyword(s) to search.
ar: الكلمة (الكلمات) الرئيسية للبحث.
es: Las palabras clave a buscar.
tr: Aranacak anahtar kelimeler.

source: Wikipedia Search
ar: بحث ويكيبيديا
es: Búsqueda en Wikipedia
tr: Wikipedia Arama

# xkcdSummary
source: Returns a random xkcd comic or a specific comic, if a number is passed.
ar: إرجاع كوميدي عشوائي xkcd أو كوميدي محدد إذا تم تمرير رقم.
es: Retorna un comic de xkcd aleatorio o uno en específico, si un número es pasado.
tr: Bir sayı iletilirse rastgele bir xkcd komik veya belirli bir komik döndürür.

# xkcdParam1
source: The comic number.
ar: الرقم الهزلي.
es: El número de cómic.
tr: Komik numara.

# InvalidxkcdNumber
source: Number must be between 1 and {0}.
ar: يجب أن يكون الرقم بين 1 و {0}.
es: El número debe estar entre 1 y {0}.
tr: Sayı 1 ile {0} arasında olmalıdır.

# youtubeSummary
source: Searches a video on YouTube.
ar: يبحث عن فيديو على موقع يوتيوب.
es: Busca un video en YouTube.
tr: YouTube'da bir video arar.

# youtubeParam1
source: The keyword(s) to search.
ar: الكلمة (الكلمات) الرئيسية للبحث.
es: Las palabras clave a buscar.
tr: Aranacak anahtar kelimeler.

# YouTubeNoResults
source: Could not find any results.
ar: تعذر العثور على أي نتائج.
es: No se encontró resultados.
tr: Herhangi bir sonuç bulunamadı.

# ytrandomSummary
source: Returns a "random" YouTube video.
ar: إرجاع فيديو YouTube "عشوائي".
es: Envía un video "aleatorio" de YouTube.
tr: "Rastgele" bir YouTube videosu döndürür.

# EmptyCache
source: Out of cached videos Creating cache...
ar: من مقاطع الفيديو المخزنة مؤقتًا جارٍ إنشاء ذاكرة التخزين المؤقت ...
es: Sin videos en el caché Creando caché...
tr: Önbelleğe alınmış videoların dışında Önbellek oluşturuluyor ...

# banSummary
source: Bans a user.
ar: يحظر مستخدم.
es: Banea un usuario.
tr: Bir kullanıcıyı yasaklar.

# banParam1
source: The user to ban.
ar: المستخدم لحظر.
es: El usuario a banear.
tr: Yasaklanacak kullanıcı.

# banParam2
source: The reason of the ban.
ar: سبب الحظر.
es: La razón del baneo.
tr: Yasağın nedeni.

# BanSameUser
source: What? You want to ban yourself?
ar: ماذا؟ تريد حظر نفسك؟
es: Que? Te quieres banear a ti mismo?
tr: Ne? Kendinizi yasaklamak mı istiyorsunuz?

# BanMyself
source: I won't ban myself lol
ar: لن أحظر نفسي ههههههههه
es: No me banearé lol
tr: Kendimi yasaklamayacağım lol

# AlreadyBanned
source: The user is already banned.
ar: المستخدم محظور بالفعل.
es: El usuario ya está baneado.
tr: Kullanıcı zaten yasaklanmış.

# Banned
source: User {0} was banned.
ar: تم حظر المستخدم {0}.
es: El usuario {0} fue baneado.
tr: Kullanıcı {0} yasaklandı.

# clearSummary
source: Clears the last x messages in the current channel.
ar: يمسح آخر x رسائل للقناة الحالية.
es: Elimina los últimos x mensajes en el canal actual.
tr: Geçerli kanaldaki son x iletiyi siler.

# clearParam1
source: The number of messages to clear.
ar: عدد الرسائل المراد مسحها.
es: El número de mensajes a eliminar.
tr: Silinecek mesaj sayısı.

# clearParam2
source: A user to delete its messages.
ar: مستخدم لحذف رسائله.
es: Información del usuario
tr: Bir kullanıcı mesajlarını silebilir.

# NumberOutOfIndex
source: The number must be between {0} and {1}.
ar: يجب أن يكون الرقم بين {0} و {1}.
es: El número debe estar entre {0} y {1}.
tr: Sayı {0} ve {1} arasında olmalıdır.

# ClearNotFound
source: Could not find any messages by {0} in the last {1} messages.
ar: تعذر العثور على أي رسائل بواسطة {0} في رسائل {1} الأخيرة.
es: No se pudo encontrar algún mensaje de {0} en los últimos {1} mensajes.
tr: Son {1} mesajda {0} tarafından herhangi bir mesaj bulunamadı.

# By2
source: by
ar: بواسطة
es: por
tr: tarafından

# hackbanSummary
source: Hackbans a user.
ar: Hackbans مستخدم.
es: Hackbanea un usuario.
tr: Bir kullanıcıyı hack eder.

# hackbanParam1
source: The ID of the user to hackban.
ar: معرف المستخدم لقرصنة.
es: La ID del usuario a hackbanear.
tr: Hackban için kullanıcının kimliği.

# hackbanParam2
source: The reason of the hackban.
ar: سبب الإختراق.
es: La razón del hackbaneo.
tr: Hackban'ın nedeni.

# Hackbanned
source: User {0} was hackbanned.
ar: تم اختراق المستخدم {0}.
es: El usuario {0} fue hackbaneado.
tr: {0} kullanıcısı hackbanned.

# kickSummary
source: Kicks a user.
ar: يركل مستخدمًا.
es: Expulsa un usuario.
tr: Bir kullanıcıyı vurur.

# kickParam1
source: The user to kick.
ar: المستخدم لركل.
es: El usuario a expulsar.
tr: Kullanılacak kullanıcı.

# kickParam2
source: The reason of the kick.
ar: سبب الركلة.
es: La razón de la expulsión.
tr: Vuruş sebebi.

# Kicked
source: User {0} was kicked.
ar: تم طرد المستخدم {0}.
es: El usuario {0} fue expulsado.
tr: {0} kullanıcısı tekmelendi.

# nickSummary
source: Changes the nickname of a user.
ar: يغير لقب المستخدم.
es: Cambia el nickname de un usuario.
tr: Kullanıcının takma adını değiştirir.

# nickParam1
source: The user to change its nickname.
ar: المستخدم لتغيير لقبه.
es: El usuario a cambiar su nickname.
tr: Kullanıcı takma adını değiştirir.

# nickParam2
source: The new nickname. Leave this empty to remove the nickname.
ar: اللقب الجديد. اترك هذا فارغًا لإزالة اللقب.
es: El nuevo nickname. Deja esto vacío para eliminar el nickname.
tr: Yeni takma ad. Takma adı kaldırmak için bunu boş bırakın.

# unbanSummary
source: Unbans a user.
ar: إلغاء حظر مستخدم.
es: Desbanea un usuario.
tr: Bir kullanıcının engellemesini kaldırır.

# unbanParam1
source: The user ID to unban.
ar: معرف المستخدم لإلغاء الحظر.
es: La ID del usuario a desbanear.
tr: Yasağının kaldırılacağı kullanıcı kimliği.

# Unbanned
source: User {0} was unbanned.
ar: تم حظر المستخدم {0}.
es: El usuario {0} fue desbaneado.
tr: {0} kullanıcısının yasağı kaldırıldı.

# triviaSummary
source: Trivia time!
ar: الوقت التوافه!
es: Hora de trivia!
tr: Diğer bilgiler zamanı!

# triviaParam1
source: The category to select. Specify "categories" to see the list of categories or "leaderboard"/"ranks" to see the leaderboard.
ar: الفئة المطلوب تحديدها. حدد "الفئات" لرؤية قائمة الفئات أو "ليدربورد" / "الرتب" لرؤية ليدربورد.
es: La categoría a seleccionar. Especifica "categories" para ver la lista de categorias o "leaderboard"/"ranks" para ver la tabla de clasificación.
tr: Seçilecek kategori. Kategori listesini görmek için "kategoriler" veya skor tablosunu görmek için "büyük şerit" / "sıralar" belirtin.

source: Category list
ar: قائمة الفئات
es: Lista de categorías
tr: Kategori Listesi

source: Trivia leaderboard
ar: المتصدرين التوافه
es: Tabla de clasificación de Trivia
tr: Diğer bilgiler afiş

# AllQuestionsAnswered
source: Seems that you answered all the questions in the specified category, select another category..
ar: يبدو أنك أجبت على جميع الأسئلة في الفئة المحددة ، حدد فئة أخرى ..
es: Parece que respondistes todas las preguntas en la categoría especificada, selecciona otra categoría.
tr: Belirtilen kategorideki tüm soruları yanıtladığınız anlaşılıyor, başka bir kategori seçin.

# TriviaError
source: An error occurred. Error code
ar: حدث خطأ. خطا بالكود
es: Ocurrió un error. Código de error
tr: Bir hata oluştu. Hata kodu

source: Category
ar: الفئة
es: Categoría
tr: Kategori
