Repository: d4n3436/Fergun
Catalog: src/strings.*.resx
Languages: ar, es, tr

# AboutAIDText
source: AI Dungeon is a first of its kind AI generated text adventure. Using a 1.5B parameter machine learning model called GPT-2, AI Dungeon generates the story and results of your actions as you play in this virtual world. Unlike virtually every other game in existence, you are not limited by the imagination of the developer in what you can do. Any thing you can express in language can be your action and the AI dungeon master will decide how the world responds to your actions.
ar: AI Dungeon هي أول مغامرة نصية من نوع الذكاء الاصطناعي. باستخدام نموذج تعلُّم الآلة ذي المعلمة 1.5B يسمى GPT-2 ، تُنشئ AI Dungeon قصة ونتائج أفعالك أثناء اللعب في هذا العالم الافتراضي. على عكس كل لعبة أخرى موجودة فعليًا ، فأنت لا تقتصر على خيال المطور في ما يمكنك القيام به. يمكن أن يكون أي شيء يمكنك التعبير عنه باللغة هو عملك وسوف يقرر سيد البرج المحصن AI كيف يستجيب العالم لأفعالك.
es: AI Dungeon es la primera aventura de texto generada por IA. Usando un modelo de aprendizaje automático de parámetros 1.5B llamado GPT-2, AI Dungeon genera la historia y los resultados de tus acciones mientras juegas en este mundo virtual. A diferencia de prácticamente todos los demás juegos existentes, no estás limitado por la imaginación del desarrollador en lo que puedes hacer. Cualquier cosa que puedas expresar en lenguaje puede ser tu acción y el maestro de mazmorras de IA decidirá cómo responderá el mundo a tus acciones.
tr: AI Dungeon, AI tarafından üretilen türünün ilk örneğidir. GPT-2 adı verilen 1.5B parametre makine öğrenme modeli kullanan AI Dungeon, bu sanal dünyada oynarken eylemlerinizin hikayesini ve sonuçlarını üretir. Var olan hemen hemen her oyunun aksine, geliştiricinin yapabileceğiniz şeyde hayal gücüyle sınırlı değilsiniz. Dilde ifade edebileceğiniz herhangi bir şey sizin eyleminiz olabilir ve AI zindan ustası dünyanın eylemlerinize nasıl tepki vereceğine karar verecektir.

# AIDHowToPlayText
source: The rules of AI Dungeon are simple: 1. The game puts "You " to the front of each action so every action should start with a verb. Ex. "attack the dragon", "summon a sandwich" etc... 2. As an exception to the above: If you put your action in quotes Ex. "Will you join me on my quest ? " then the game will add "You say " to the front of it.
ar: قواعد AI Dungeon بسيطة: 1. تضع اللعبة "أنت" في مقدمة كل عمل ، لذا يجب أن يبدأ كل فعل بفعل. على سبيل المثال "مهاجمة التنين" ، "استدعي شطيرة" إلخ ... 2. كاستثناء لما سبق: إذا وضعت الإجراء الخاص بك بين علامتي اقتباس. "هل ستنضم إلي في سعيي؟" ثم ستضيف اللعبة "أنت تقول" إلى المقدمة.
es: Las reglas de AI Dungeon son simples: 1. El juego pone "Tú" al frente de cada acción, por lo que cada acción debe comenzar con un verbo. Ex. "atacar al dragón", "convocar un sándwich", etc. 2. Como excepción a lo anterior: si pone su acción entre comillas Ej. "¿Te unirás a mí en mi búsqueda?", Entonces el juego agregará "Tú dices" al frente.
tr: AI Dungeon'ın kuralları basittir: 1. Oyun her eylemin önüne "You" koyar, böylece her eylem bir fiil ile başlamalıdır. Ör. "ejderhaya saldır", "bir sandviç çağır" vb ... 2. Yukarıdakilere bir istisna olarak: Eyleminizi tırnak içine alırsanız Örn. "Bana görevimde katılacak mısın?" Oyunun önüne "Sen de" diyeceksin.

# AboutAIDTitle
source: About AI Dungeon
ar: حول AI Dungeon
es: Sobre AI Dungeon
tr: AI Dungeon Hakkında

# AIDHelp
source: AI Dungeon Help
ar: مساعدة AI Dungeon
es: Ayuda de AI Dungeon
tr: AI Dungeon Yardımı

# AIDHowToPlayTitle
source: How to play
ar: كيف ألعب
es: Cómo jugar
tr: Nasıl oynanır

source: Commands
ar: أوامر
es: Comandos
tr: Komutları

# AIDTips
source: Try using new words often, the AI gets more creative with variety. Remember to start a "do" input with a verb, ex: Attack the orc. Use the undo button to delete your last input along with the AI's response. Long sentences for actions are no problem! Get creative! Want more story to generate? Use the continue command without any text. Try using new words often, the AI gets more creative with variety. Use the remember command to edit the story context that the AI always remembers. You can use Say before the text to talk.
ar: حاول استخدام كلمات جديدة كثيرًا ، فالذكاء الاصطناعي يصبح أكثر إبداعًا مع التنوع. هل تريد المزيد من القصة لتوليدها؟ استخدم الأمر متابعة بدون أي نص. ابدأ العمل مع! لإيقاف اللعبة من وضع "أنت" في المقدمة. على سبيل المثال "! فجأة ظهر غول" حاول استخدام كلمات جديدة كثيرًا ، فالذكاء الاصطناعي يصبح أكثر إبداعًا مع التنوع. يمكنك استخدام الاقتباسات للتحدث ، على سبيل المثال. "دعهم و شأنهم!" تذكر أن تبدأ العمل الخاص بك بفعل ، على سبيل المثال: Attack the orc استخدم الأمر الارتداد لإرجاع الإدخال الأخير وحاول إجراء شيء آخر. الجمل الطويلة للأعمال ليست مشكلة! الحصول على الإبداع! استخدم الأمر تذكر لتحرير سياق القصة الذي يتذكره الذكاء الاصطناعي دائمًا.
es: Intenta usar palabras nuevas con frecuencia, la IA se vuelve más creativa con variedad. Recuerda comenzar con "do" junto a un verbo, ex: Atacar el orco. Usa el comando undo para eliminar tu última entrada junta a la respuesta de la IA. ¡Las oraciones largas para acciones no son un problema! ¡Se creativo! ¿Quieres más historia para generar? Usa el comando continue sin ningún texto. Usa el comando remember para editar el contexto de la historia que la IA siempre recuerda. Intenta usar palabras nuevas con frecuencia, la IA se vuelve más creativa con variedad. Puedes usar Say luego de el texto para hablar.
tr: Sık sık yeni kelimeler kullanmayı deneyin, AI çeşitlilik ile daha yaratıcı hale gelir. Bir fiil ile bir "do" girdisi başlatmayı unutmayın, örn: Ork'a saldırın. AI'nın yanıtıyla birlikte son girişinizi silmek için geri al düğmesini kullanın. Eylemler için uzun cümleler problem değil! Yaratıcı ol! Oluşturmak için daha fazla hikaye ister misiniz? Continue komutunu herhangi bir metin olmadan kullanın. Sık sık yeni kelimeler kullanmayı deneyin, AI çeşitlilik ile daha yaratıcı hale gelir. AI'nın her zaman hatırladığı hikaye içeriğini düzenlemek için remember komutunu kullanın. Konuşmak için metinden önce Say'ı kullanabilirsiniz.

source: In
ar: في
es: En
tr: İçinde

# configSummary
source: Shows an embed with the bot configuration options at guild level.
ar: يعرض التضمين مع خيارات تكوين البوت على مستوى النقابة.
es: Muestra un embed con las opciones configuración del bot a nivel de servidor.
tr: Lonca seviyesinde bot yapılandırma seçenekleriyle bir gömme gösterir.

# AdminRequired
source: You need to be an administrator to use this command.
ar: يجب أن تكون مسؤولاً لاستخدام هذا الأمر.
es: Debes ser un administrador para usar este comando!
tr: Bu komutu kullanabilmek için yönetici olmanız gerekir.

source: Loading...
ar: جار التحميل...
es: Cargando...
tr: Yükleniyor...

source: Fergun configuration
ar: تكوين Fergun
es: Configración de Fergun
tr: Fergun yapılandırması

source: Config canceled.
ar: تم إلغاء التكوين.
es: Configuración cancelada.
tr: Yapılandırma iptal edildi.

# CantDoThat
source: I can't do that.
ar: لا يمكنني فعل ذلك.
es: No puedo hacer eso.
tr: Bunu yapamam.

# softbanSummary
source: Softbans a user (kick + delete user messages).
ar: Softbans مستخدم (ركلة + حذف رسائل المستخدم).
es: Softbanea un usuario (kick + eliminar los mensajes del usuario).
tr: Bir kullanıcıyı devre dışı bırakır (kullanıcı mesajlarını tekme + silme).

# softbanParam1
source: The user to softban.
ar: المستخدم ل softban.
es: El usuario a softbanear.
tr: Softban kullanıcısı.

# softbanParam2
source: The number of days to delete it's last messages. 7 by default.
ar: عدد أيام حذف رسائله الأخيرة. 7 بشكل افتراضي.
es: El número de días a eliminar sus últimos mensajes. 7 por defecto.
tr: Silinecek son gün sayısı. 7 varsayılan olarak.

# softbanParam3
source: The reason of the softban.
ar: سبب softban.
es: La razón del softbaneo.
tr: Softbanın nedeni.

# SoftbanSameUser
source: What? You want to softban yourself?
ar: ماذا؟ تريد softban نفسك؟
es: Que? Te quieres softbanear a ti mismo?
tr: Ne? Kendinizi yasaklamak ister misiniz?

# SoftbanMyself
source: I won't softban myself lol
ar: أنا لن softban نفسي ههههههههه
es: No me voy a softbanear lol
tr: Kendimi softban yapmayacağım lol

# Softbanned
source: User {0} was softbanned.
ar: تم حظر المستخدم {0}.
es: El usuario {0} fue softbaneado.
tr: {0} kullanıcısı yazılımla yasaklandı.

# AIDungeonCommands
source: AI Dungeon (use {0}aid <command>)
ar: زنزانة AI (استخدم {0}aid <command>)
es: AI Dungeon (usa {0}aid <comando>)
tr: AI Dungeon (kullanım {0}aid <komut>)

source: Reverting last action...
ar: جارٍ الرجوع إلى الإجراء الأخير ...
es: Revirtiendo la última acción...
tr: Son işlem geri döndürülüyor ...

# 140CharsMax
source: 140 characters max.
ar: 140 حرفًا كحد أقصى.
es: Máximo 140 carácteres.
tr: 140 karakter maks.

source: Invite link
ar: رابط الدعوة
es: Link de invitación
tr: Davet bağlantısı

# NoManageMessages
source: Some commands work better with the `Manage Messages` permission (`img`, `urban`, `config`)
ar: ستعمل بعض الأوامر بشكل أفضل مع إذن `إدارة الرسائل` (` img`، `urban`،` config`)
es: Algunos comandos funcionan mejor con el permiso `Gestionar mensajes` (`img`, `urban`, `config`)
tr: Bazı komutlar `` Mesajları Yönet '' izniyle daha iyi çalışır (`img`,` kentsel`, `config`)

source: Invalid text.
ar: نص غير صالح.
es: Texto inválido.
tr: Geçersiz metin.

# clearRemarks
source: If a user is passed, the command will try to delete all the messages from the user in the last `count` messages. The limit of days that the bot can search messages is 14.
ar: إذا تم تمرير مستخدم ، فسيحاول الأمر حذف جميع رسائل المستخدمين في رسائل `العدد 'الأخيرة.
es: Si se pasa un usuario, el comando intentará eliminar todos los mensajes del usuario en los últimos `count` mensajes.
tr: Bir kullanıcı iletilirse, komut son "sayım" iletisindeki kullanıcıdan tüm iletileri silmeye çalışır. Bot'un mesajları arayabileceği gün sınırı 14'tür.

source: Ban Members
ar: حظر الأعضاء
es: Banear miembros
tr: Üyeleri Yasakla

source: Kick Members
ar: ركلة الأعضاء
es: Expulsar miembros
tr: Kick Üyeler

# UserNotBanned
source: The user isn't banned.
ar: المستخدم غير محظور.
es: El usuario no está baneado.
tr: Kullanıcı yasaklanmadı.

# BotMention
source: My prefix here is `{0}`. Use `{0}help` to see my command list and `{0}prefix` to change the prefix.
ar: البادئة هنا هي "{0}`. استخدم `{0} help` لرؤية قائمة الأوامر الخاصة بي و` {0} البادئة` لتغيير البادئة.
es: Mi prefijo aquí es `{0}`. Usa `{0}help` para ver mi lista de comandos y `{0}prefix` para cambiar el prefijo.
tr: Buradaki önekim `{0}`. Komut listemi görmek için `{0}help` ve öneki değiştirmek için `{0}prefix ` kullanın.

# NotSupportedInDM
source: I don't think you can use that here.
ar: لا أعتقد أنه يمكنك استخدام ذلك هنا.
es: No creo que puedas usar eso aquí.
tr: Bunu burada kullanabileceğini sanmıyorum.

# tcdneSummary
source: This cat does not exist
ar: هذا القط غير موجود
es: Este gato no existe
tr: Bu kedi mevcut değil

# tpdneSummary
source: This person does not exist
ar: هذا الشخص غير موجود
es: Esta persona no existe
tr: Bu kişi mevcut değil

# YTSearchCap
source: YouTube search cap reached :(
ar: بلغ الحد الأقصى للبحث يوتيوب :(
es: Límite de búsqueda de YouTube alcanzada :(
tr: YouTube arama sınırına ulaşıldı :(

# CreatingVideoCache
source: Someone is already creating a video cache, please wait..
ar: شخص ما يقوم بإنشاء ذاكرة التخزين المؤقت للفيديو ، يرجى الانتظار ..
es: Alguien ya está creando un caché de video, espera..
tr: Birisi zaten bir video önbelleği oluşturuyor, lütfen bekleyin ..

source: User
ar: المستعمل
es: Usuario
tr: kullanıcı

# editsnipeSummary
source: Shows the last edited message in the current channel.
ar: يعرض آخر رسالة تم تحريرها في القناة الحالية.
es: Muestra el último mensaje editado en el canal actual.
tr: Geçerli kanalda en son düzenlenen mesajı gösterir.

# reactionSummary
source: Adds a reaction to a message.
ar: يضيف رد فعل على رسالة.
es: Agrega una reacción a un mensaje.
tr: Mesaja bir tepki ekler.

# reactionParam1
source: The reaction to add (only one).
ar: رد الفعل لإضافة (واحد فقط)
es: La reacción a agregar (solo una).
tr: Ekleme reaksiyonu (sadece bir tane)

# reactionParam2
source: The message ID to add a reaction (must be from same channel the command is executed).
ar: معرف الرسالة لإضافة رد فعل (يجب أن يكون من نفس القناة التي يتم تنفيذ الأمر).
es: La ID del mensaje a agregar la reacción (debe ser del mismo canal donde el comando es ejecutado).
tr: Reaksiyon eklemek için ileti kimliği (komutun yürütüldüğü kanaldan aynı olmalıdır).

# InvalidMessageID
source: Invalid message ID. Make sure the message is from this channel.
ar: معرف الرسالة غير صالح. تأكد من أن الرسالة من هذه القناة.
es: ID de mensaje inválido. El mensaje debe ser de este canal.
tr: Geçersiz mesaj kimliği. Emin olun mesajı bu kanaldan olduğunu.

# InvalidReaction
source: Invalid emote/emoji.
ar: رمز تعبيري / رمز تعبيري غير صالح.
es: Emoji/Emote inválido.
tr: Geçersiz emote / emoji.

# BadArgumentCount
source: The command is missing required arguments. Use `{0}help {1}` to get more info about the command.
ar: عدد الوسيطة غير صالح. استخدم `{0} help{1}` للحصول على مزيد من المعلومات حول الأمر.
es: Cantidad de parámetros invalida. Usa `{0}help {1}` para obtener mas información del comando.
tr: Komutta gerekli bağımsız değişkenler eksik. Komut hakkında daha fazla bilgi almak için {{0} yardım {1} `kullanın.

# CommandParseFailed
source: Error parsing the command arguments. An argument is invalid or the order of the arguments is incorrect. Use `{0}help {1}` to get more info about the command.
ar: خطأ تحليل الحجج الأوامر. حجة غير صالحة أو ترتيب الحجج غير صحيح. استخدام {0} {1} مساعدة للحصول على مزيد من المعلومات حول الأمر.
es: Error al analizar los parámetros del comando. Algún parametro es inválido o el orden de los argumentos es incorrecto. Usa `{0}help {1}` para obtener mas información del comando.
tr: Komut bağımsız değişkenleri ayrıştırılırken hata oluştu. Bağımsız değişken geçersiz veya bağımsız değişkenlerin sırası yanlış. Komut hakkında daha fazla bilgi almak için {{0} yardım {1} `kullanın.

source: Translation results
ar: نتائج الترجمة
es: Resultados de traducción
tr: Çeviri sonuçları

# SourceLanguage
source: Source language (Detected)
ar: لغة المصدر (تم الكشف عنها)
es: Lenguaje de origen (Detectado)
tr: Kaynak dil (Tespit edildi)

source: Target language
ar: اللغة الهدف
es: Lenguaje de destino
tr: Hedef dil

source: Result
ar: نتيجة
es: Resultado
tr: Sonuç

source: Error type
ar: نوع الخطأ
es: Tipo de error
tr: Hata türü

source: Error message
ar: رسالة خطأ
es: Mensaje del error
tr: Hata mesajı

# seekSummary
source: Seeks the current track to the specified position.
ar: يبحث عن المسار الحالي إلى الموضع المحدد.
es: Cambia la posición de reproducción de la pista a la especificada.
tr: Geçerli parçayı belirtilen konuma arar.

# seekParam1
source: The nth second to seek or a valid time with the format `m:ss`, `mm:ss`, `h:mm:ss` or `hh:mm:ss`.
ar: الثانية الثانية للبحث أو وقت صالح بالتنسيق `m: ss` أو` mm: ss` أو `h: mm: ss` أو` hh: mm: ss`.
es: La posición del reproductor en el segundo número n o un tiempo válido con el formato `m:ss`, `mm:ss`, `h:mm:ss` o `hh:mm:ss`.
tr: Aranacak n. Saniye veya `m: ss`,` mm: ss`, `h: mm: ss` veya` ss: dd: ss` biçiminde geçerli bir saat.

# CannotSeek
source: Cannot seek this track.
ar: لا يمكن البحث عن هذا المسار.
es: No puedo cambiar la posición de esta pista.
tr: Bu parça aranamıyor.

# SeekHigherOrEqual
source: The second to go ({0}) cannot be higher or equal than the track's length ({1}).
ar: الثانية التي يجب الذهاب إليها ({0}) لا يمكن أن تكون أعلى أو مساوية لطول المسار ({1})
es: El segundo a ir ({0}) no puede ser mayor o igual que la longitud de la pista ({1}).
tr: İkinci saniye ({0}) parçanın uzunluğundan ({1}) daha yüksek veya eşit olamaz

# SeekComplete
source: Skipped to second {0} ({1} of {2}).
ar: تم التخطي إلى الثانية {0} ({1} من {2})
es: Saltado al segundo {0} ({1} de {2}).
tr: İkinci {0} 'a atlandı ({2} / {1})

# ErrorInTranslation
source: An error occurred in the translation API. Please try again later.
ar: حدث خطأ في واجهة برمجة تطبيقات الترجمة.
es: Ocurrió un error en la API de traducción.
tr: Çeviri API'sında bir hata oluştu.

# statsSummary
source: Shows the bot stats.
ar: يظهر احصائيات البوت.
es: Muestra las estadísticas del bot.
tr: Bot istatistiklerini gösterir.

# AdventureDeleted
source: The adventure was deleted.
ar: تم حذف المغامرة.
es: La aventura fue eliminada.
tr: Macera silindi.

source: CPU Usage
ar: استخدام المعالج
es: Uso de CPU
tr: CPU kullanımı

source: RAM Usage
ar: استخدام ذاكرة الوصول العشوائي
es: Uso de RAM
tr: RAM Kullanımı

source: Library
ar: مكتبة
es: Librería
tr: Kütüphane

source: Bot version
ar: نسخة بوت
es: Versión del bot
tr: Bot versiyonu

source: Operating System
ar: نظام التشغيل
es: Sistema Operativo
tr: İşletim sistemi

source: Bot owner
ar: مالك بوت
es: Dueño del bot
tr: Bot sahibi

# CurrentNewNickEqual
source: The current nickname and the new nick are the same.
ar: اللقب الحالي والنك الجديد متطابقان.
es: El nickname actual y el nuevo nickname son iguales.
tr: Mevcut takma ad ve yeni takma ad aynı.

source: Yes
ar: نعم
es: Si
tr: Evet

source: No
ar: لا
tr: Hayır

source: True
ar: صحيح
es: Verdadero
tr: Doğru

source: False
ar: خاطئة
es: Falso
tr: Yanlış

# ConfigList
source: Auto translate Captionbot (`identify`) results Auto translate AI Dungeon input & output Track selection for `play`
ar: ترجمة السيارات Captionbot (`identify`) النتائج السيارات ترجمة AI الأبراج المدخلات والمخرجات تتبع اختيار `play`
es: Auto traducir resultados de Captionbot (`identify`) Auto traducir resultados de entrada y salida de AI Dungeon Selección de pista para `play`
tr: Captionbot (`tanımla ') sonuçlarını otomatik çevir AI Dungeon giriş ve çıkışını otomatik çevir "Oynat" için parça seçimi

# ConfigPrompt
source: Use the reactions to enable or disable an option.
ar: استخدام ردود الفعل لتمكين أو تعطيل خيار.
es: Usa las reacciones para habilitar o deshabilitar una opción.
tr: Bir seçeneği etkinleştirmek veya devre dışı bırakmak için tepkiler kullanın.

# FergunConfig
source: Fergun configuration
ar: تكوين Fergun
es: Configuración de Fergun
tr: Fergun yapılandırması

source: Option
ar: اختيار
es: Opción
tr: seçenek

source: Value
ar: القيمة
es: Valor
tr: değer

# UserBlacklisted
source: The user {0} was blacklisted.
ar: تم إدراج المستخدم {0} في القائمة السوداء.
es: El usuario {0} fue agregado a la lista negra.
tr: {0} kullanıcısı kara listeye alındı.

# UserBlacklistedWithReason
source: The user {0} was blacklisted with the reason: {1}
ar: تم إدراج المستخدم {0} في القائمة السوداء للسبب: {1}
es: El usuario {0} fue agregado a la lista negra con la razón: {1}
tr: {0} kullanıcısı şu nedenden dolayı kara listeye alındı: {1}

# UserBlacklistRemoved
source: The user {0} was removed from the blacklist.
ar: تمت إزالة المستخدم {0} من القائمة السوداء.
es: El usuario {0} fue eliminado de la lista negra.
tr: {0} kullanıcısı kara listeden çıkarıldı.

# blacklistSummary
source: Adds a user to the blacklist, or removes it.
ar: يضيف مستخدمًا إلى القائمة السوداء ، أو يزيله.
es: Agrega un usuario a la lista negra, o lo elimina de ella.
tr: Kara listeye bir kullanıcı ekler veya listeyi kaldırır.

# blacklistParam1
source: The ID of the user to blacklist.
ar: معرف المستخدم إلى القائمة السوداء.
es: La ID del usuario a agregar a la lista negra.
tr: Kara listeye alınacak kullanıcının kimliği.

# blacklistParam2
source: The reason for being blacklisted.
ar: سبب يجري على القائمة السوداء.
es: La razón de ser incluido en la lista negra.
tr: Kara listeye alınma nedeni.

# Blacklisted
source: You are in the blacklist.
ar: انت في القائمة السوداء
es: Estás en la lista negra.
tr: Kara listede bulunuyorsunuz.

# BlacklistedWithReason
source: You are in the blacklist with the reason: {0}
ar: أنت في القائمة السوداء للسبب: {0}
es: Estás en la lista negra con la razón: {0}

# MissingPermissions
source: You don't have the permissions to run this command.
ar: ليس لديك أذونات لتشغيل هذا الأمر.
es: No tienes los permisos necesarios para ejecutar este comando.
tr: Bu komutu çalıştırma izniniz yok.

# Changelog0.9
source: - Added support to new languages. - New language (Spanish) - New commands (`language`, `xkcd`, `nowplaying`, `snipe`, `changelog`) - `ytrandom` now works much better. - The command list and the help command are now dynamic. - Fixed some bugs.
ar: - إضافة دعم للغات جديدة. - لغة جديدة (الإسبانية) - أوامر جديدة (`language` ،` xkcd` ، `nowplaying` ،` snipe` ، `changelog`) - `ytrandom` يعمل الآن بشكل أفضل. - أصبحت قائمة الأوامر والأوامر المساعدة ديناميكية الآن. - إصلاح بعض الخلل.
es: - Agregado soporte a nuevos idiomas. - Nuevo idioma (español) - Nuevos comandos (`language`, `xkcd`, `nowplaying`, `snipe`, `changelog`) - `ytrandom` ahora funciona mucho mejor. - Ahora la lista de comandos y el comando de ayuda son dinámicos. - Se corrigieron algunos errores.
tr: - Yeni diller için destek eklendi. - Yeni dil (İspanyolca) - Yeni komutlar (`dil`,` xkcd`, `şimdi oynatılıyor`,` snipe`, `changelog`) - `` ytrandom` artık çok daha iyi çalışıyor. - Komut listesi ve yardım kodu artık dinamik. - Bazı hatalar düzeltildi.

# Changelog1.0
source: - AI Dungeon system and commands, including a story ID system and auto translation. - Configuration system for some commands at guild level. - New commands: AI Dungeon: `info`, `new`, `continue`, `revert`, `remember`, `alter`, `makepublic`, `makeprivate`, `idlist`, `idinfo`, `delete` Other: `eval`, `config`, `softban`, `tcdne`, `tpdne`, `editsnipe`, `reaction`, `seek`, `stats`, `blacklist`, `ocrtranslate`, `roleinfo` - Support to DM channels. - Now the bot uses a proper database. - More bug fixes.
ar: - نظام وأوامر AI Dungeon ، بما في ذلك نظام معرف القصة والترجمة التلقائية. - نظام تكوين لبعض الأوامر على مستوى النقابة. - أوامر جديدة: AI Dungeon: `info`،` new`، `Continue`،` revert`، `تذكر`،` alter`، `makepublic`،` makeprivate`، `idlist`،` idinfo`، `delete` غير ذلك: `eval` ،` config` ،`softban`, `tcdne` ،` tpdne` ، `editsnipe` ،` رد فعل` ، `تسعى` ،` إحصائيات` ، `قائمة سوداء`, `o`ocrtranslate`, `roleinfo - دعم قنوات DM. - يستخدم البوت الآن قاعدة بيانات مناسبة. - المزيد من الاصلاحات.
es: - Sistema y comandos de AI Dungeon, incluyendo un sistema de ID de historias y traducción automática. - Sistema de configuración para algunos comandos a nivel de servidor. - Nuevos comandos: AI Dungeon: `info`, `new`, `continue`, `revert`, `remember`, `alter`, `makepublic`, `makeprivate`, `idlist`, `idinfo`, `delete` Otros: `eval`, `config`, `softban`, `tcdne`, `tpdne`, `editsnipe`, `reaction`, `seek`, `stats`, `blacklist`, `ocrtranslate`, `roleinfo` - Soporte a canales de MD. - Ahora el bot usa una base de datos adecuada. - Más correcciones de errores.
tr: - AI Dungeon sistemi ve hikaye kimliği sistemi ve otomatik çeviri dahil komutlar. - Lonca seviyesindeki bazı komutlar için konfigürasyon sistemi. - Yeni komutlar: AI Dungeon: "bilgi", "yeni", "devam", "geri dön", "hatırla", "değiştir", "makepublic", "makeprivate`," idlist`, "idinfo`," sil` Diğer: "eval`," config`, "softban`," tcdne`, "tpdne`," editsnipe`, "tepki`," seek`, "istatistik`," kara liste`, "oktranslate`," roleinfo` - DM kanallarına destek. - Şimdi bot uygun bir veritabanı kullanıyor. - Daha fazla hata düzeltmesi.

# UserRequireBanMembers
source: You need the `Ban Members` permission to use this command.
ar: تحتاج إلى إذن `حظر الأعضاء` لاستخدام هذا الأمر.
es: Necesitas el permiso `Banear miembros` para usar este comando.
tr: Bu komutu kullanmak için `Üyeleri Yasakla 'iznine ihtiyacınız var.

# BotRequireBanMembers
source: I need the `Ban Members` permission to execute this command.
ar: أحتاج إلى إذن "حظر الأعضاء" لتنفيذ هذا الأمر.
es: Necesito el permiso `Banear miembros` para ejecutar este comando.
tr: Bu komutu yürütmek için `` Üyeleri Yasakla '' iznine ihtiyacım var.
