Repository: d4n3436/Fergun
Catalog: src/strings.*.resx
Languages: ar, es, tr

# Changelog1.2
source: - New commands: `calc` and `loop` (the 100th command!). - Remade `lyrics` from scratch, I've made my own parser that works a lot better than the integrated one from Victoria. The new parser also allows you to pass a specific song name instead of having to play a song before. - `help` now shows the current command parameters types. - `stats` now shows the bot memory usage next to all the process memory usage. - `urban` now shows the links to the words. - Added more interactivity to `language`, `config`, `trivia` and `aid delete`, now handling the responses with reactions. - Better pagination system for `img`, `urban` and `lyrics`. - Now Lavalink is updated automatically to the dev builds. - Cleanup on the localization functionality, now all the modules uses a custom command base that includes the methods needed for localization. This prevents duplicating the localization methods for each module, and the response times *should* be faster. - Small bug fixes and optimizations.
ar: - أوامر جديدة: calc وloop (الأمر 100th!). - الصنع ثانية lyrics من الصفر، لقد جعلت محلل بلدي التي تعمل بشكل افضل كثيرا من واحدة متكاملة من فيكتوريا. كما يسمح محلل جديد لك لتمرير اسم أغنية محددة بدلا من الاضطرار إلى تشغيل أغنية قبل. - ocr (الأصلي) عاد (مرة أخرى). - help يظهر الآن أنواع معلمات الأوامر الحالية. - stats يظهر الآن استخدام الذاكرة بوت بجانب كل عملية استخدام الذاكرة. - urban يظهر الآن الروابط إلى كلمات. - إضافة المزيد من التفاعل إلى language، config، trivia وdelete المساعدات والمناولة الآن الردود مع ردود الفعل. - أفضل نظام ترقيم الصفحات لimg، urban وlyrics. - يتم تحديثها الآن Lavalink تلقائيا إلى يبني ديف. - تنظيف على وظيفة الترجمة، والآن كل وحدات تستخدم قاعدة قيادة مخصص يتضمن الأساليب اللازمة لتوطين. - إصلاحات الشوائب الصغيرة وأمثل.
es: - Nuevos comandos: `calc` y `loop` (en comando número 100!). - Rehecho `lyrics` desde el comienzo. Hize mi propio parser que funciona mucho mejor que la integrada en Victoria. El nuevo parser también permite pasar el nombre una canción específica en vez de tener que reproducir una pista primero. - `help` ahora muestra los tipos de los parámetros del comando actual. - `stats` ahora muestra el uso de la memoria bot junto a todo el proceso de uso de la memoria. - `urban` ahora muestra los enlaces a las palabras. - Añadido mejor interactividad a `language`, `config`, `trivia` y `aid delete`, ahora manejando las respuestas con reacciones. - Mejor sistema de paginación para `img`, `urban` y `lyrics`. - Ahora Lavalink se actualiza automáticamente a las builds de desarrollo. - Limpieza en la funcionalidad de localización, ahora todos los módulos utilizan una base de comandos personalizado que incluye los métodos necesarios para la localización. - Arreglos de errores pequeños y optimizaciones.
tr: - Yeni komutlar: `calc` ve `loop` (100. komut!). - Sıfırdan `lyrics` yeniden, Victoria ayrıştırılmış olandan çok daha iyi çalışan kendi ayrıştırıcı yaptı. Yeni ayrıştırıcı, daha önce bir şarkıyı çalmak yerine belirli bir şarkı adını geçirmenize de izin verir. - `help` şimdi geçerli komut parametresi türlerini göstermektedir. - `stats` artık artık işlem belleği kullanımının yanında bot bellek kullanımını gösteriyor. - `urban` artık kelimelerin bağlantılarını gösteriyor. - `language`, `config`, `trivia` ve `aid delete` bölümlerine daha fazla etkileşim eklendi ve şimdi yanıtlarla tepkiler ele alındı. - `img`, `urban` ve `lyrics` için daha iyi sayfalama sistemi. - Şimdi Lavalink otomatik olarak geliştiricilere güncellenir. - Yerelleştirme işlevselliğini temizleme, şimdi tüm modüller yerelleştirme için gerekli yöntemleri içeren özel bir komut tabanı kullanıyor. - Küçük hata düzeltmeleri ve optimizasyonlar.

# HelpFooter2
source: <> = Required | [] = Optional | Do not type these symbols when writing the command.
ar: <> = إلزامية | [] = اختياري | لم تكتب هذه الرموز عند كتابة الأمر.
es: <> = Requerido | [] = Opcional | No escribas estos símbolos con el comando.
tr: <> = gereklidir | [] = İsteğe bağlı | Komutu yazarken bu sembolleri yazmayın.

# invertSummary
source: Inverts (negates) an image.
ar: يحول (يلغي) صورة.
es: Invierte (convierte a negativo) una imagen.
tr: Görüntüyü tersine çevirir (reddeder).

# invertParam1
source: The url of an image to use.
ar: عنوان URL للصورة المراد استخدامها.
es: La url de una imagen a usar.
tr: Kullanılacak bir resmin URL'si.

# Changelog1.2.3
source: This update contains fixes for bugs that left 1.2 and some changes / new things that were delayed from 1.2 to improve them. - New command: `invert` - Added Russian and Turkish languages (I've used Google Translate so the translations may have lots of errors). - Added some info about the obligatory and optional arguments in `help`. - Added a simple cache system to `img`, `tts` and `urban`. - Now `urban` and `badtranslator` can search / translate random words for you (use the commands without passing anything). - Now the bot will only enter the typing state for long-running commands. - Fixed a bug in `img` that occurred when the embed tried to use an "invalid" url image. - Fixed a bug in `ocr` that occurred when the image was too large. - Fixed a bug in `badtranslator` that made the command fail randomly for no reason. - Fixed a bug with the paginator that flickered in certain circumstances. - Fixed some bugs with the `lyrics` parser.
ar: ويتضمن هذا التحديث إصلاحات الأخطاء التي تركت 1.2 و بعض التغييرات / الأشياء الجديدة التي تأجلت من 1.2 إلى تحسينها. - الأمر جديد: `invert` - أضيفت الروسية والتركية (لقد استعملت جوجل ترجمة ذلك الترجمات قد يكون الكثير من الأخطاء). - إضافة بعض المعلومات حول الوسائط الإلزامية والاختيارية في help. - أضيفت نظام مخبأ بسيط ل`img`،`tts` و`urban`. - الآن `urban` و`badtranslator ` يمكن البحث / ترجمة الكلمات العشوائية بالنسبة لك (استخدم الأمر دون المرور بأي شيء). - والآن سوف بوت تدخل الدولة وحدها الكتابة للأوامر التي طال أمدها. - إصلاح الخلل في` img` التي حدثت عندما حاول تضمين لاستخدام" غير صالحة "صورة رابط. - إصلاح الخلل في` ocr` التي حدثت عندما كانت صورة كبيرة جدا. - إصلاح الخلل في` badtranslator` التي جعلت الأمر تفشل عشوائيا من دون سبب. - إصلاح الخلل مع` paginator` تضمين هذا مومض عند الرد على الزر الأول / الماضي عندما كانت الصفحة بالفعل أول / آخر واحد. - إصلاح بعض الخلل مع محلل` lyrics`.
es: Esta actualización contiene arreglos de errores que dejaron la 1.2 y algunos cambios que fueron retrasados de la 1.2 para ser mejorados. - Nuevo comando: `invert` - Agregado los idiomas Ruso y Turco (he usado Google Translate por lo que puede haber muchos errores). - Agregado información sobre los parámetros obligatorios y opcionales en `help`. - Agregado un sistema simple de caché para `img`, `tts` y `urban`. - Ahora `urban` y `badtranslator` pueden buscar / traducir palabras aleatorias por ti (usa los comandos sin pasar nada). - Ahora el bot sólo entrara al estado de escribiendo para los comandos largos. - Arreglado un bug en `img` que ocurria cuando el embed intentaba usar una imágen "inválida". - Arreglado un bug en `ocr` que ocurria cuando la imagen era muy grande. - Arreglado un bug en `badtranslator` que hacía que el comando fallaso sin razón alguna. - Arreglado un bug con el paginador que parpadeaba en ciertas circunstancias. - Arreglado algunos errores con el parser de `lyrics`.
tr: - Yeni komut: `invert` - Rusça ve Türkçe diller eklendi (Google Çeviri'yi kullandım, böylece çevirilerde çok fazla hata olabilir). - `help` da zorunlu ve isteğe bağlı argümanlar hakkında bilgi eklendi. - `img`, `tts` ve `urban` e basit bir önbellek sistemi eklendi. - Şimdi `urban` ve `badtranslator` sizin için rastgele kelimeleri arayabilir / çevirebilir (hiçbir şey iletmeden komutu kullanın). - Şimdi bot sadece uzun süren komutlar için yazma durumuna girecektir. - Gömme `geçersiz` bir url resmi kullanmaya çalıştığında oluşan `img` deki bir hata düzeltildi. - Görüntü çok büyük olduğunda oluşan `ocr` hatası düzeltildi. - `Badtranslator` da komutun hiçbir nedenle rastgele başarısız olmasını sağlayan bir hata düzeltildi. - Sayfa zaten ilk / sonuncuyken ilk / son düğmeye tepki verirken yanıp sönen gömme sayfalayıcıdaki bir hata düzeltildi. - Bazı sözler ayrıştırıcı ile bazı hatalar düzeltildi.

# MessagesOlderThan2Weeks
source: Messages must be younger than two weeks.
ar: يجب أن تكون رسائل الأصغر من أسبوعين.
es: Los mensajes deben tener menos de dos semanas de antigüedad.
tr: Mesajlar iki hafta yaşından küçük olması gerekmektedir.

# SomeMessagesNotDeleted
source: {0} messages could not be deleted because they are older than two weeks.
ar: لا يمكن حذف {0} رسائل لأنهم هم من كبار السن من أسبوعين.
es: No se pudieron eliminar {0} mensajes porque tienen mas de dos semanas de antigüedad.
tr: iki hafta daha eski olduğu için {0} mesajlar silinemedi.

# Changelog1.2.4
source: - Added a reliability service to prevent deadlocks and an auto-restart script that executes if the bot crashes. - Limited the max. text length in `lyrics`. - Fixed a bug in `invert` that failed in some images. - Fixed a bug in `clear` that showed a warning about messages could not be deleted even if the all the deleted messages are younger than two weeks. - Fixed a bug in `trivia` that would timeout regardless of the input.
ar: - تمت إضافة خدمة موثوقية لمنع الجمود والبرنامج النصي لإعادة التشغيل التلقائي الذي يتم تنفيذه إذا تعطل البوت. - حد أقصى. طول النص في "كلمات". - إصلاح الخلل في "عكس" الذي فشل في بعض الصور. - تم إصلاح خطأ "واضح" أظهر تحذيرًا بشأن الرسائل لا يمكن حذفه حتى لو كانت جميع الرسائل المحذوفة أقل من أسبوعين. - تم إصلاح الخلل في "معلومات تافهة" بحيث تنتهي مهلتها بغض النظر عن الإدخال.
es: - Agregado un servicio de reliabilidad para prevenir puntos muertos (deadlocks) y un script de auto-reinicio que se ejecuta cuando el bot tiene un error el cual no se puede recuperar (crash). - Limitado la longitud máxima del texto en `lyrics`. - Arreglado un bug en `invert` que fallaba con algunas imágenes. - Arreglado un bug en `clear` que mostraba una advertencia sobre mensajes que no se pudieron eliminar aún si los mensajes eliminados tienen una antigüedad menor a dos semanas. - Arreglado un bug en `trivia` que mostraba un mensaje que se acabó el tiempo sin importar de la entrada.
tr: - Kilitlenmeleri önlemek için bir güvenilirlik hizmeti ve bot çöktüğünde çalışan otomatik yeniden başlatma komut dosyası eklendi. - Maks. `lyrics` içindeki metin uzunluğu. - `invert` içindeki bazı resimlerde başarısız olan bir hata düzeltildi. - `clear` içindeki, silinen iletilerin tümü iki haftadan küçük olsa bile iletilerin silinemediğini gösteren bir hata düzeltildi. - `trivia` içindeki girişten bağımsız olarak zaman aşımına uğrayan bir hata düzeltildi.

# GuildNotFound
source: Server not found.
ar: لم يتم العثور على الخادم.
es: Servidor no encontrado.
tr: Sunucu bulunamadı.

# ErrorParsingLyrics
source: An error occurred while parsing the lyrics for {0}. Maybe it's an instrumental?
ar: حدث خطأ أثناء تحليل كلمات ل{0}. ربما انها مفيدة؟
es: Ocurrió un error mientras se extraía la letra de {0}. Tal vez es un instrumental?
tr: {0} sözlerini ayrıştırılırken bir hata meydana geldi. Belki bu bir vesile değil mi?

# MustBeLowerThan
source: Parameter `{0}` must be lower than {1}.
ar: المعلمة `{0}` يجب أن يكون أقل من {1}.
es: El parámetro `{0}` debe ser menor que {1}.
tr: Parametre {0} '{1} daha düşük olması gerekir.

source: Invalid ID.
ar: بطاقة التعريف غير صالحة.
es: ID inválida.
tr: Geçersiz kimlik.

source: Hastebin link
ar: رابط Hastebin
es: Link de Hastebin
tr: Hastebin bağlantı

source: Not available.
ar: غير متوفر.
es: No disponible.
tr: Müsait değil.

# WaitingQueue
source: Waiting for the queue to empty...
ar: في انتظار تفريغ قائمة الانتظار ...
es: Esperando que la cola se vacíe...
tr: Sıranın boşalması bekleniyor ...

# NewOutputPrompt
source: The old output is: {0} Please enter the new output (**not** the command).
ar: إخراج القديم هو: {0} الرجاء إدخال الانتاج الجديد (**لا** الأمر).
es: La salida antigua es: {0} Ingresa la nueva salida (**no** el comando).
tr: Eski çıktı şöyledir: {0} yeni çıktının (**değil** komutu) girin.

# GeneratingNewResponse
source: Generating a new response...
ar: جارٍ إنشاء رد جديد ...
es: Generando una nueva respuesta...
tr: Yeni bir yanıt oluşturuluyor ...

# InputTypes
source: Input options
ar: خيارات الإدخال
es: Opciones de entrada
tr: Giriş seçenekleri

# InputTypesList
source: Do: An action you want to take in the story. Always start with an action, ex. "Search for the hidden treasure". This is the default option if no one is detected. Say: You can use this to speak, ex. "Leave them alone!" Story: This input stops the AI from putting "You" in front of your input.
ar: افعل: الإجراء الذي تريد القيام به في القصة. ابدأ دائمًا بإجراء ، على سبيل المثال. "البحث عن الكنز المخفي". هذا هو الخيار الافتراضي إذا لم يتم الكشف عن أي شخص. قل: يمكنك استخدام هذا للتحدث ، على سبيل المثال. "دعهم و شأنهم!" القصة: يمنع هذا الإدخال AI من وضع "أنت" أمام إدخالك.
es: Do: Una acción que quieres tomar en la historia. Siempre comienza por una acción, ej. "Buscar el tesoro perdido". Este es el tipo de entrada por defecto si ningúno es detectado. Say: Puedes usar esto para hablar, ej. "Déjalos solos!". Story: Previene que la IA pongo "Tú" en frente de tu entrada.
tr: Yapın: Hikayede yapmak istediğiniz bir eylem. Her zaman bir eylemle başlayın, örn. Msgstr "Gizli hazineyi ara". Hiç kimse algılanmazsa bu varsayılan seçenektir. De ki: Bunu konuşmak için kullanabilirsiniz, ör. "Onları yalnız bırak!" Hikaye: Bu giriş yapay zekanın girişinizin önüne "Siz" koymasını engeller.

# Changelog1.2.7
source: - New commands: `color` and `retry`. - Added a command cache service, now you can edit a message to a new command and Fergun will update it's response or send a new one. - Updated the AI Dungeon module and API wrapper, fixed some bugs with the responses and updated the `idinfo` and `alter` commands. Now all the commands are supported. - Now `userinfo` and `avatar` will show the info/avatar of a user that isn't in the server by passing its ID. - Now `userinfo` and `avatar` will show the default avatar if the user doesn't have an avatar. - Now `lyrics` will show the lyrics of the current track playing in your Spotify activity, if there's one. - Now `lyrics` shows correctly the track name when an error happens. - Now it's possible to use `softban` with a user ID. - Now some commands will upload its results to Hastebin when the content is too long. - Fixed some bugs in `tpdne`, `tcdne`, `repeat`, the command service and the paginator system.
ar: - الأوامر الجديدة: `color` و` retry`. - تمت إضافة خدمة ذاكرة التخزين المؤقت للأوامر ، يمكنك الآن تحرير رسالة إلى أمر جديد وسيقوم Fergun بتحديث رده أو إرسال أمر جديد. - تم تحديث وحدة AI Dungeon ووحدة واجهة برمجة التطبيقات (API) ، وإصلاح بعض الأخطاء باستخدام الاستجابات وتحديث أوامر `idinfo` و` alter`. الآن يتم دعم جميع الأوامر. - الآن سيعرض `userinfo` و` avatar` المعلومات / الصورة الرمزية للمستخدم غير الموجود في الخادم من خلال تمرير معرفه. - الآن سيعرض `userinfo` و` avatar` الصورة الرمزية الافتراضية إذا لم يكن لدى المستخدم صورة رمزية. - الآن ستعرض `كلمات` كلمات المسار الحالي الذي يتم تشغيله في نشاط Spotify ، إذا كان هناك واحد. - الآن تظهر `كلمات` بشكل صحيح اسم المسار عند حدوث خطأ. - من الممكن الآن استخدام `softban` بمعرف مستخدم. - الآن ستقوم بعض الأوامر بتحميل نتائجها إلى Hastebin عندما يكون المحتوى طويلًا جدًا. - تم إصلاح بعض الأخطاء في `tpdne` و` tcdne` و `تكرار` وخدمة الأوامر ونظام الترقيم.
es: - Nuevos comandos: `color` y `retry`. - Agregado un servicio de caché de comandos, ahora puedes editar un mensaje a un nuevo comando y Fergun actualizará su respuesta o enviará una nueva. - Actualizado el módulo y wrapper de API de AI Dungeon, arreglado algunos bugs con las respuestas y actualizado los comandos `idinfo` y `alter`. - Ahora `userinfo` y `avatar` mostrarán la info/avatar del usuario que no esta en el servidor pasando su ID. - Ahora `userinfo` y `avatar` mostrarán el avatar por defecto si el usuario no tiene un avatar. - Ahora `lyrics` mostrará la letra de la canción que está reproduciendo en tu actividad de Spotify. - Ahora `lyrics` muestra correctamente el nombre de la canción cuando ocurre un error. - Ahora es posible usar `softban` con una ID de usuario. - Ahora algunos comandos subirán sus resultados a Hastebin cuando el contenido es demasiado largo. - Arreglado algunos bugs en `tpdne`, `tcdne`, `repeat`, el servicio de comandos y el sistema de paginación.
tr: - Yeni komutlar: "renk" ve "yeniden dene". - Bir komut önbellek servisi eklendi, şimdi yeni bir komuta mesaj düzenleyebilirsiniz ve Fergun yanıtını güncelleyecek veya yeni bir komut gönderecektir. - AI Dungeon modülü ve API sarıcı güncellendi, bazı hataları yanıtlarla düzeltti ve `idinfo` ve` alter 'komutlarını güncelledi. Artık tüm komutlar destekleniyor. - Şimdi `userinfo` ve` avatar`, sunucuda olmayan bir kullanıcının kimliğini ileterek bilgilerini / avatarını gösterecektir. - Artık kullanıcının bir avatarı yoksa `userinfo` ve` avatar` varsayılan avatarı gösterecektir. - Şimdi `şarkı sözleri`, varsa Spotify etkinliğinizde çalmakta olan parçanın sözlerini gösterecektir. - Şimdi `şarkı sözleri` bir hata oluştuğunda parça adını doğru gösteriyor. - Artık bir kullanıcı kimliğiyle “softban” kullanmak mümkün. - Artık bazı komutlar, içerik çok uzun olduğunda sonuçlarını Hastebin'e yükleyecek. - "tpdne", "tcdne", "tekrar", komut hizmeti ve sayfa sistemindeki bazı hatalar düzeltildi.

source: Channel count
ar: عدد قناة
es: Número de canales
tr: Kanal sayısı

source: Region
ar: منطقة
es: Región
tr: bölge

source: Default channel
ar: القناة الإفتراضية
es: Canal por defecto
tr: Standart kanal

source: Language not found.
ar: لم يتم العثور على اللغة.
es: Idioma no encontrado.
tr: Dil bulunamadı.

source: Category count
ar: الفئة العد
es: Número de categorías
tr: Kategori sayımı

# Changelog1.2.9
source: - Added a backup translator that will be automatically used when the first one fails. - Increased the command cache cleaning interval. - Fixed a bug in `new` that prevented showing the initial prompt. - Fixed a bug in the paginator embed that prevented showing the author avatar if the user didn't have one set. - Fixed other small bugs. - Now Fergun will respond to the command messages if before the message didn't contain any command. - Now `ping` shows the database latency. - Reduced the memory usage.
ar: - تمت إضافة مترجم احتياطي سيتم استخدامه تلقائيًا عند فشل المترجم الأول. - زيادة الفاصل الزمني لتنظيف ذاكرة التخزين المؤقت الأوامر. - تم إصلاح الخلل في "جديد" الذي حال دون عرض المطالبة الأولية. - تم إصلاح الخلل في تضمين الصفحة الذي منع عرض الصورة الرمزية للمؤلف إذا لم يكن لدى المستخدم مجموعة واحدة. - إصلاح الخلل الصغيرة الأخرى. - الآن سيرد Fergun على رسائل الأوامر إذا لم تحتوي الرسالة على أي أمر قبل ذلك. - يُظهر الآن "ping" وقت استجابة قاعدة البيانات. - خفض استخدام الذاكرة.
es: - Agregado un traductor de reserva que será usado automáticamente cuando el principal falle. - Aumentado el intervalo de limpieza del caché de comandos. - Arreglado un bug en `new` que prevenía que se muestre el texto inicial. - Arreglado un bug en el embed del paginador que prevenía que se muestre el avatar del usuario si el usuaio no tenía uno puesto. - Arreglado otros bugs menores. - Ahora Fergun responderá a los mensajes de comandos si antes el mensaje no contenia comandos. - Ahora `ping` muestra la latencia de la base de datos. - Reducido el uso de memoria.
tr: - Birincisi başarısız olduğunda otomatik olarak kullanılacak bir yedek çevirmen eklendi. - Komut önbellek temizleme aralığını arttırdı. - İlk istemin gösterilmesini engelleyen "yeni" bir hata düzeltildi. - Sayfa yerleştirme işleminde, kullanıcının bir grubu yoksa yazar avatarının gösterilmesini engelleyen bir hata düzeltildi. - Diğer küçük hatalar düzeltildi. - Mesaj daha önce herhangi bir komut içermiyorsa artık Fergun komut mesajlarına cevap verecektir. - Şimdi "ping" veritabanı gecikmesini gösteriyor. - Bellek kullanımını azalttı.

# DumpingAdventure
source: Dumping the adventure...
ar: إلقاء المغامرة...
es: Volcando la aventura...
tr: macera Damping...

source: Edit canceled.
ar: تحرير إلغاؤها.
es: Edición cancelada.
tr: Düzenleme iptal edildi.
