Repository: d4n3436/Fergun
Catalog: src/strings.*.resx
Languages: ar, es, tr

# Changelog1.6
source: - Fergun is now open source! - New commands: `wolframalpha`, `spotify`, `define`, `archive`, `shorten`, and `blacklistserver`. - Added back `youtube`. - Lots of internal changes to make the bot easy to self-host. - Added a prefix cache system. Now the response times should be faster. - [help] Added a command list cache. - [stats] Improved the methods to get the bot memory usage. - [repeat] Improved the performance, limiting the maximum possible length of text to avoid allocating memory unnecessarily. - Improved the performance of the logging and interactive service. - [cmdstats] Reduced the number of commands displayed per page. - [calc] Now using a different math library. - [urban] Now can be used in non-NSFW channels. - [code] Rewrote to get a link pointing to the specified command method line from the repository. - [userinfo] Fixed a bug that caused the activity field to be empty if the user had an emote in their status. - [lyrics] Fixed a bug in the parser that caused bold text to be overlapped. - [give] Fixed a bug that allowed to give IDs to bots. - Fixed some bugs in the Bing Translator wrapper. - [new] Removed the character limit in the custom mode creation. - [alter] Removed the character limit. - Removed the paginator/video cache. - Removed the word list that `badtranslator` used. - Removed `nothing` and `botcolor`. - Now Fergun will send a warning message when a command fails due to a 5xx error. - Now Fergun will send a warning message when a music command is used when there's no connection to a Lavalink server. - Now when editing a command message with a paginator, the response message will be deleted if the reactions cannot be removed. - Now when editing a command message to a command that attaches files, the "Loading" message will be correctly deleted. - Lots of minor bug fixes.
ar: - Fergun الآن مفتوح المصدر! - أوامر جديدة: `wolframalpha` و `spotify` و `define` و `archive` و `shorten` و `blacklistserver`. - تمت الإضافة مرة أخرى `youtube`. - الكثير من التغييرات الداخلية لجعل الروبوت سهل الاستضافة الذاتية. - تمت إضافة نظام ذاكرة التخزين المؤقت البادئة. الآن يجب أن تكون أوقات الاستجابة أسرع. - [help] تمت إضافة ذاكرة التخزين المؤقت لقائمة الأوامر. - [stats] تم تحسين طرق الحصول على استخدام ذاكرة الروبوت. - [repeat] تم تحسين الأداء ، وتحديد أقصى طول ممكن للنص لتجنب تخصيص الذاكرة دون داع. - تحسين أداء التسجيل والخدمة التفاعلية. - [cmdstats] تم تقليل عدد الأوامر المعروضة لكل صفحة. - [calc] تستخدم الآن مكتبة رياضيات مختلفة. - [urban] يمكن استخدامها الآن في قنوات غير تابعة لـ NSFW. - [code] أعد كتابته للحصول على ارتباط يشير إلى سطر أسلوب الأمر المحدد من المستودع. - [userinfo] تم إصلاح الخلل الذي كان يتسبب في أن يكون حقل النشاط فارغًا إذا كان لدى المستخدم رمز تعبيري في حالته. - [lyrics] إصلاح الخلل في المحلل اللغوي الذي تسبب في تداخل النص الغامق. - [give] تم إصلاح الخلل الذي سمح بإعطاء معرفات لبرامج الروبوت. - تم إصلاح بعض الأخطاء في غلاف Bing Translator. - [new] تمت إزالة عدد الأحرف المسموح به في إنشاء الوضع المخصص. - [alter] تمت إزالة عدد الأحرف المسموح به. - إزالة ترقيم الصفحات / مخبأ الفيديو. - تمت إزالة قائمة الكلمات التي استخدمها `badtranslator`. - تمت إزالة `nothing` و `botcolor`. - الآن سيرسل Fergun رسالة تحذير عند فشل الأمر بسبب خطأ 5xx. - الآن سيرسل Fergun رسالة تحذير عند استخدام أمر موسيقى عندما لا يكون هناك اتصال بخادم Lavalink. - الآن عند تحرير رسالة أمر باستخدام ترقيم صفحات ، سيتم حذف رسالة الرد إذا تعذر إزالة ردود الفعل. - الآن عند تحرير رسالة أمر لأمر مرفق بملفات ، سيتم حذف رسالة "جارٍ التحميل" بشكل صحيح. - الكثير من إصلاحات الأخطاء الطفيفة.
es: - ¡Fergun ahora es de código abierto! - Nuevos comandos: `wolframalpha`, `spotify`, `define`, `archive`, `shorten` y `blacklistserver`. - Añadido de nuevo `youtube`. - Muchos cambios internos para facilitar el self-hosting del bot. - Se agregó un sistema de caché de prefijo. Ahora los tiempos de respuesta deberían ser más rápidos. - [help] Se agregó la caché de lista de comandos. - [cmdstats] Se mejoraron los métodos para obtener el uso de la memoria del bot. - [repeat] Se mejoró el rendimiento, limitando la máxima longitud posible de texto para evitar asignar memoria innecesariamente. - Se mejoró el rendimiento del servicio de registro e interactivo. - [cmdstats] Se redujo el número de comandos mostrados por página. - [calc] Ahora usa una biblioteca matemática diferente. - [urban] Ahora se puede utilizar en canales que no son NSFW. - [code] Reescrito para obtener un enlace que apunta a la línea del método de comando especificado desde el repositorio. - [userinfo] Se corrigió un error que causaba que el campo de actividad estuviera vacío si el usuario tenía un emote en su estado. - [lyrics] Se corrigió un error en el analizador que causaba que el texto en negrita se superpusiera. - [give] Se corrigió un error que permitía dar ID a bots. - Se corrigieron algunos errores en el contenedor de Bing Translator. - [new] Se eliminó el límite de caracteres en la creación del modo personalizado. - [alter] Eliminado el límite de caracteres. - Se eliminó el paginador / caché de video. - Se eliminó la lista de palabras que usaba `badtranslator`. - Eliminado `nothing` y `botcolor`. - Ahora Fergun enviará un mensaje de advertencia cuando un comando falle debido a un error 5xx. - Ahora Fergun enviará un mensaje de advertencia cuando se use un comando de música cuando no haya conexión a un servidor de Lavalink. - Ahora al editar un mensaje de comando con un paginador, el mensaje de respuesta se eliminará si las reacciones no se pueden eliminar. - Ahora al editar un mensaje de comando a un comando que adjunta archivos, el mensaje "Cargando" se eliminará correctamente. - Muchas correcciones de errores menores.
tr: - Fergun artık açık kaynak! - Yeni komutlar: `wolframalpha`, `spotify`, `define`, `archive`, `shorten` ve `blacklistserver`. - `youtube` geri eklendi. - Botun kendi kendine barındırılmasını kolaylaştırmak için birçok dahili değişiklik. - Bir önek önbellek sistemi eklendi. Şimdi yanıt süreleri daha hızlı olmalı. - [help] Bir komut listesi önbelleği eklendi. - [stats] Bot bellek kullanımını alma yöntemleri iyileştirildi. - [repeat] Gereksiz bellek ayırmayı önlemek için mümkün olan maksimum metin uzunluğunu sınırlayarak performansı iyileştirdi. - Günlük kaydı ve etkileşimli hizmetin performansı iyileştirildi. - [cmdstats] Sayfa başına görüntülenen komut sayısı azaltıldı. - [calc] Şimdi farklı bir matematik kitaplığı kullanılıyor. - [urban] Artık NSFW olmayan kanallarda kullanılabilir. - [code] Depodan belirtilen komut yöntemi satırına işaret eden bir bağlantı almak için yeniden yaz. - [userinfo] Kullanıcının durumunda bir ifade varsa etkinlik alanının boş olmasına neden olan bir hata düzeltildi. - [lyrics] Ayrıştırıcıda kalın metnin üst üste binmesine neden olan bir hata düzeltildi. - [give] Botlara kimlik verilmesine izin veren bir hata düzeltildi. - Bing Translator sarmalayıcısındaki bazı hatalar düzeltildi. - [new] Özel mod oluşturmada karakter sınırı kaldırıldı. - [alter] Karakter sınırı kaldırıldı. - Sayfalayıcı / video önbelleği kaldırıldı. - `badtranslator` tarafından kullanılan kelime listesi kaldırıldı. - `nothing` ve `botcolor` kaldırıldı. - Şimdi Fergun, bir 5xx hatası nedeniyle bir komut başarısız olduğunda bir uyarı mesajı gönderecek. - Şimdi Fergun, bir Lavalink sunucusuna bağlantı olmadığında bir müzik komutu kullanıldığında bir uyarı mesajı gönderecek. - Şimdi bir sayfalayıcı ile bir komut mesajını düzenlerken, reaksiyonlar kaldırılamazsa, yanıt mesajı silinecektir. - Artık dosyaları ekleyen bir komuta yönelik bir komut mesajını düzenlerken, "Yükleniyor" mesajı doğru şekilde silinecek. - Çok sayıda küçük hata düzeltmesi.

source: Badges
ar: شارات
es: Insignias
tr: Rozet

# img2Summary
source: Searches for images with DuckDuckGo.
ar: يبحث عن الصور باستخدام DuckDuckGo.
es: Busca imágenes con DuckDuckGo,
tr: DuckDuckGo ile görüntüleri arar.

# img2Param1
source: The keyword(s) to search.
ar: الكلمة (الكلمات) الرئيسية للبحث.
es: Las palabras clave a buscar.
tr: Aranacak anahtar kelimeler.

# privacySummary
source: Displays the privacy policy and the privacy configuration.
ar: يعرض سياسة الخصوصية وتكوين الخصوصية.
es: Muestra la política de privacidad y la configuración de privacidad.
tr: Gizlilik politikasını ve gizlilik yapılandırmasını görüntüler.

source: Privacy Policy
ar: سياسة خاصة
es: Política de Privacidad
tr: Gizlilik Politikası

source: What data we collect
ar: ما البيانات التي نجمعها
es: Que datos recopilamos
tr: Hangi verileri topluyoruz

# WhatDataWeCollectList
source: a. Server configuration (server ID, custom prefix, bot language, disabled commands, etc) b. User configuration/stats (user ID, Trivia game points, privacy configuration and blacklist status) c. AI Dungeon adventures (adventure ID, owner ID and availability of use) d. Temporary collection of deleted/edited messages, used in the "snipe" commands (`snipe`, `editsnipe`, `bigsnipe` and `bigeditsnipe`)
ar: أ. تكوين الخادم (معرف الخادم ، البادئة المخصصة ، لغة الروبوت ، الأوامر المعطلة ، إلخ) ب. تكوين / إحصائيات المستخدم (معرّف المستخدم ونقاط لعبة Trivia وتكوين الخصوصية وحالة القائمة السوداء) ج. مغامرات AI Dungeon (معرف المغامرة ومعرف المالك وتوافر الاستخدام) د. مجموعة مؤقتة من الرسائل المحذوفة / المعدلة ، والمستخدمة في أمري "snipe" (`snipe`, `editsnipe`, `bigsnipe` و `bigeditsnipe`)
es: a. Configuración de servidores (ID de servidor, prefijo personalizado, idioma del bot, comandos deshabilitados, etc) b. Configuración/Estadísticas de usuario (ID de usuario, Puntos de juego de trivia, configuración de privacidad y estado en la lista negra) c. Aventuras de AI Dungeon (ID de aventura, ID del dueño y disponibilidad de uso) d. Recopilado temporal de mensajes eliminados/editados, usado en los comandos de "snipe" (`snipe`, `editsnipe`, `bigsnipe` and `bigeditsnipe`)
tr: a. Sunucu yapılandırması (sunucu kimliği, özel önek, bot dili, devre dışı bırakılan komutlar vb.) b. Kullanıcı yapılandırması / istatistikleri (kullanıcı kimliği, Trivia oyun puanları, gizlilik yapılandırması ve kara liste durumu) c. AI Dungeon maceraları (macera kimliği, sahip kimliği ve kullanım durumu) d. "snipe" komutlarında kullanılan silinmiş / düzenlenmiş mesajların geçici koleksiyonu (`snipe`, `editsnipe`, `bigsnipe` ve `bigeditsnipe`)

# WhenWeCollectData
source: When we collect it
ar: متى نجمعها
es: Cuándo lo recopilamos
tr: Ne zaman toplayacağız

# WhenWeCollectDataList
source: a. When you set a custom prefix, language, or other configuration. This data is removed when the bot leaves that server. b. When you play a Trivia game, you use the privacy configuration or you're blacklisted. c. When you create an AI Dungeon adventure with the bot. This data is removed when you use the `aid delete` command. d. When a message is deleted/edited. These messages can only be seen using the "snipe" commands in the channel where the message was deleted/edited. These messages are only stored for 6 hours, and you can decide to opt out using the reactions below.
ar: أ. عندما تقوم بتعيين بادئة مخصصة أو لغة أو تكوين آخر. تتم إزالة هذه البيانات عندما يغادر الروبوت ذلك الخادم. ب. عندما تلعب لعبة Trivia ، فإنك تستخدم تكوين الخصوصية أو يتم إدراجك في القائمة السوداء. ج. عندما تنشئ مغامرة AI Dungeon مع الروبوت. تتم إزالة هذه البيانات عند استخدام الأمر `aid delete`. د. عندما يتم حذف / تحرير رسالة. يمكن رؤية هذه الرسائل فقط باستخدام أوامر "snipe" في القناة حيث تم حذف / تحرير الرسالة. يتم تخزين هذه الرسائل لمدة 6 ساعات فقط ، ويمكنك أن تقرر إلغاء الاشتراك باستخدام ردود الفعل أدناه.
es: a. Cuando estableces un prefijo personalizado, idioma u otra configuración. Estos datos son eliminados cuando el bot sale de ese servidor. b. Cuando juegas Trivia, usas la configuración de privacidad o estás en la lista negra. c. Cuando creas una aventura de AI Dungeon con el bot. Estos datos son eliminados cuando usas el comando `aid delete`. d. Cuando un mensaje es eliminado/editado. Estos mensajes solo pueden ser vistos usando los comandos de "snipe" en el canal donde el mensaje fue eliminado/editado. Estos mensajes solo se almacenan por 6 horas, y puede optar por no participar utilizando las siguientes reacciones.
tr: a. Özel bir önek, dil veya başka bir yapılandırma ayarladığınızda. Bot bu sunucudan çıktığında bu veriler kaldırılır. b. Bir Trivia oyunu oynadığınızda, gizlilik yapılandırmasını kullanırsınız veya kara listeye alınırsınız. c. Botla bir AI Dungeon macerası oluşturduğunuzda. `aid delete` komutunu kullandığınızda bu veriler kaldırılır. d. Bir mesaj silindiğinde / düzenlendiğinde. Bu mesajlar, sadece mesajın silindiği / düzenlendiği kanalda "snipe" komutları kullanılarak görülebilir. Bu mesajlar yalnızca 6 saat süreyle saklanır ve aşağıdaki reaksiyonları kullanarak vazgeçmeye karar verebilirsiniz.

# PrivacyConfig
source: Privacy configuration
ar: تكوين الخصوصية
es: Configuración de privacidad
tr: Gizlilik yapılandırması

# PrivacyConfigInfo
source: Here you'll find some settings that you can change to improve your privacy.
ar: ستجد هنا بعض الإعدادات التي يمكنك تغييرها لتحسين خصوصيتك.
es: Aquí encontrarás algunos ajustes que puedes cambiar para mejorar tu privacidad.
tr: Burada, gizliliğinizi iyileştirmek için değiştirebileceğiniz bazı ayarlar bulacaksınız.

# PrivacyConfigList
source: Opt out of the temporary collection of deleted/edited messages in the "snipe" commands
ar: إلغاء الاشتراك من المجموعة المؤقتة للرسائل المحذوفة / المعدلة في أوامر "snipe"
es: Optar por no participar en la colección temporal de mensajes eliminados/editados en los comandos de "snipe"
tr: "snipe" komutlarında silinen / düzenlenen mesajların geçici olarak toplanmasını devre dışı bırakın

source: Privacy
ar: خصوصية
es: Privacidad
tr: Gizlilik

# SnipePrivacy
source: Don't want your message to be displayed here? See `privacy`.
ar: ألا تريد عرض رسالتك هنا؟ راجع `privacy`.
es: ¿No quieres que tu mensaje se muestre aquí? Vea `privacy`.
tr: Mesajınızın burada görüntülenmesini istemiyor musunuz? Bkz. `privacy`.

source: Donate
ar: يتبرع
es: Donar
tr: bağış yap

# sarcasmSummary
source: sARcAstIC teXt.
es: tEXto sARcaStIco.
tr: SARCASTİK TEXT.

# ReplyTimeout
source: You did not reply before the timeout!
es: No has respondido antes del límite de tiempo!
tr: Zaman aşımından önce cevap vermediniz!

# CannotUseThisInteraction
source: You can't use this interaction.
es: No puedes usar esta interacción.
tr: Bu etkileşimi kullanamazsınız.

# DeletingAdventure
source: Deleting the adventure...
es: Eliminando la aventura...
tr: Macera siliniyor...

source: Language List
es: Lista de Idiomas
