Repository: d4n3436/Fergun
Catalog: src/strings.*.resx
Languages: ar, es, tr

# globaldisableParam2
source: The reason to use.
ar: السبب للاستخدام.
es: The razón a usar.
tr: sebebi kullanmak.

# AlreadyDisabledGlobally
source: {0} is already disabled globally!
ar: {0} تم تعطيل بالفعل على مستوى العالم!
es: {0} ya está deshabilitado globalmente!
tr: {0} zaten küresel devre dışı bırakılmış!

# CommandDisabledGlobally
source: The command {0} has been disabled in all servers.
ar: تم تعطيل الأمر {0} في كافة الملقمات.
es: El comando {0} ha sido deshabilitado en todos los servidores.
tr: Komut {0} Tüm sunucularda devre dışı bırakılmıştır.

# globalenableSummary
source: Enables a command globally (in all servers).
ar: تمكن عالميا الأمر (في كافة ملقمات).
es: Habilita un comando globalmente (en todos los servidores).
tr: (Bütün sunucularda) bir komut tüm dünyada sağlar.

# globalenableParam1
source: The name of the command to enable globally.
ar: اسم الأمر لتمكين عالميا.
es: El nombre del comando a habilitar globalmente.
tr: komutunun adı global olarak etkinleştirmek için.

# AlreadyEnabledGlobally
source: {0} is already enabled globally!
ar: {0} تمكين بالفعل على مستوى العالم!
es: {0} ya está habilitado globalmente!
tr: {0} zaten küresel etkindir!

# CommandEnabledGlobally
source: The command {0} has been enabled in all servers.
ar: تم تمكين الأمر {0} في كافة الملقمات.
es: El comando {0} ha sido habilitado en todos los servidores.
tr: Komut {0} Tüm sunucularda etkinleştirildi.

source: Reason
ar: السبب
es: Razón
tr: neden

# LeftVCInactivity
source: I have left the voice channel due to inactivity.
ar: لقد تركت قناة صوت بسبب عدم النشاط.
es: He salido del canal de voz por inactividad.
tr: Ben etkin olmaması nedeniyle ses kanalını bıraktık.

# MusicPlayerShutdownWarning
source: Fergun will be restarted/turned off in some seconds and your music player will be shut down. Sorry for the inconvenience.
ar: سيتم إعادة تشغيل Fergun / إيقاف في بعض ثوان، ومشغل الموسيقى الخاص بك سيتم إيقاف. آسف للإزعاج.
es: Fergun será reiniciado/apagado en unos segundos y tu reproductor de música sera cerrado. Lo siento por los inconvenientes ocasionados.
tr: Fergun bazı saniyede kapalı / yeniden başlatılacak ve müzik çalar kapatılacak. Rahatsızlıktan dolayı özür dileriz.

source: Warning
ar: تحذير
es: Advertencia
tr: Uyarı

# PublicIdNull
source: The public ID of this adventure is null. Please create a new adventure.
ar: معرف العام من هذه المغامرة هو باطل. يرجى إنشاء مغامرة جديدة.
es: La ID pública de esta aventura es nula. Por favor crea una nueva aventura.
tr: Bu maceranın kamu kimliği boş. Yeni bir macera oluşturun.

# Changelog1.4
source: - New commands: `bigsnipe`, `bigeditsnipe`, `lmgtfy`, `paste`, `enable`, `disable`, `globalenable` and `globaldisable`. - Now when Fergun joins a server and that server has a preferred locale, that locale will be saved to the Fergun configuration for that server. - Now when Fergun leaves a server, that server config will be deleted from the database. - Now Fergun will leave a voice channel when all the users leave that channel. - Now Fergun will send a warning to all servers that has a music player before restarting/shutting down. - Now the commands that uses Hastebin and the upload fails its content will be showed in the message, but cut down. - Added support to disable commands at guild level. - Added support to voice channels, category channels and DM channels in `channelinfo`. - Added support to deleted attachments in `snipe` (`bigsnipe` comes with this feature on release). - Updated the `lyrics` scraper and fixed the cut text bug. - Updated the AI Dungeon module and API wrapper. - Fixed a bug that caused some moderation commands to fail because the user hierarchy was calculated incorrectly.
ar: - أوامر جديدة: `bigsnipe`, `bigeditsnipe`, `lmgtfy`, `paste`, `enable`, `disable`, `globalenable`, `globaldisable`. - الآن عندما ينضم Fergun إلى خادم ويكون لهذا الخادم لغة مفضلة ، سيتم حفظ هذه الإعدادات المحلية في تكوين Fergun لذلك الخادم. - الآن عندما يغادر Fergun الخادم ، سيتم حذف تكوين الخادم هذا من قاعدة البيانات. - الآن سيترك Fergun قناة صوتية عندما يغادر جميع المستخدمين هذه القناة. - الآن سيرسل Fergun تحذيرًا إلى جميع الخوادم التي تحتوي على مشغل موسيقى قبل إعادة التشغيل / الإغلاق. - الآن الأوامر التي تستخدم Hastebin وفشل التحميل ، سيتم عرض محتواها في الرسالة ، ولكن سيتم تقليصها. - تمت إضافة دعم لتعطيل الأوامر على مستوى الجماعة. - تمت إضافة دعم للقنوات الصوتية وقنوات الفئات وقنوات DM في `channelinfo`. - دعم إضافي للمرفقات المحذوفة في `snipe` (`bigsnipe` تأتي مع هذه الميزة عند الإصدار). - تم تحديث `lyrics` الكاشطة وإصلاح خطأ النص المقطوع. - تم تحديث وحدة AI Dungeon ومضمّن API. - إصلاح الخلل الذي تسبب في فشل بعض أوامر الإشراف بسبب حساب التسلسل الهرمي للمستخدم بشكل غير صحيح.
es: - Nuevos comandos: `bigsnipe`, `bigeditsnipe`, `lmgtfy`, `paste`, `enable`, `disable`, `globalenable` y `globaldisable`. - Ahora cuando Fergun ingresa a un servidor y éste servidor tiene un lenguaje preferido, éste lenguaje será guardado en la configuración de Fergun en ese servidor. - Ahora cuando Fergun deja un servidor, la configuración de ese servidor será eliminada de la base de datos. - Ahora Fergun saldrá de un canal de voz si todos los usuarios dejan ese canal. - Ahora Fergun enviará una advertencia a todos los servidores que tengan un reproductor de música antes de reiniciarse/apagarse. - Ahora los comandos que usen Hastebin y la subida de texto falle, su contenido se mostrará en el mensaje, pero cortado. - Añadido soporte a deshabilitación de comandos a nivel de servidor. - Añadido soporte a canales de voz, canales de categorías y canales de MD en `channelinfo`. - Añadido soporte a archivos eliminados en `snipe` (`bigsnipe` ya viene con esta caracerística). - Actualizado el scraper de `lyrics` y arreglado el bug del texto cortado. - Actualizado el módulo de AI Dungeon y el wrapper de API. - Arreglado un bug que causaba que algunos comandos de moderación fallaran porque la jerarquía de calculaba incorrectamente.
tr: - Yeni komutlar: `bigsnipe`, `bigeditsnipe`, `lmgtfy`, `paste`, `enable`, `disable`, `globalenable` ve `globaldisable`. - Şimdi, Fergun bir sunucuya katıldığında ve bu sunucunun tercih edilen bir yerel ayarı olduğunda, bu yerel ayar, o sunucu için Fergun yapılandırmasına kaydedilecektir. - Artık Fergun bir sunucudan ayrıldığında, bu sunucu yapılandırması veritabanından silinecek. - Şimdi Fergun, tüm kullanıcılar o kanaldan ayrıldığında bir ses kanalından ayrılacak. - Şimdi Fergun, yeniden başlatmadan / kapatmadan önce müzik çalar bulunan tüm sunuculara bir uyarı gönderecek. - Artık Hastebin'i kullanan ve yükleme başarısız olan komutlar mesajda gösterilecek, ancak kesilecektir. - Klan seviyesinde komutları devre dışı bırakmak için destek eklendi. - `channelinfo` için ses kanalları, kategori kanalları ve DM kanallarına destek eklendi. - `snipe` 'de silinen ekler için destek eklendi (`bigsnipe`, yayınlandığında bu özellikle birlikte gelir). - `lyrics` kazıyıcı güncellendi ve metin kesme hatası düzeltildi. - AI Dungeon modülü ve API sarmalayıcı güncellendi. - Kullanıcı hiyerarşisi yanlış hesaplandığı için bazı moderasyon komutlarının başarısız olmasına neden olan bir hata düzeltildi.

# giveSummary
source: Gives (transfers) the specified ID to a user.
ar: يعطي (ينقل) المعرف المحدد للمستخدم.
es: Regala (transfiere) la ID especificada a un usuario.
tr: Belirtilen kimliği bir kullanıcıya verir (aktarır).

# giveParam1
source: The adventure ID.
ar: معرف المغامرة.
es: La ID de aventura.
tr: Macera kimliği.

# giveParam2
source: The user to give the ID.
ar: يعطي المستخدم المعرف.
es: El usuario a regalar la ID.
tr: Kullanıcı kimliği verecek.

# CannotGiveYourself
source: You cannot give the ID yourself!
ar: لا يمكنك إعطاء الهوية بنفسك!
es: No puedes regalar la ID a ti mismo!
tr: Kimliği kendiniz veremezsiniz!

# GaveId
source: The ID was successfully transferred to {0}.
ar: تم نقل المعرف بنجاح إلى {0}.
es: Se transfirió correctamente la ID a {0}.
tr: Kimlik başarıyla {0} 'a aktarıldı.

# Changelog1.4.8
source: - New command: `give`. - Updated the AI Dungeon module and API wrapper (again), fixed the custom adventure bug, and fixed `alter`. - Updated the Google TTS library, now using preprocessors and tokenizers ported from gTTS Python library. This provides correct intonation and pronunciation, and also allows making TTS with larger texts. - Improved the lyrics scraper. - Now Fergun will leave a voice channel if there are only bots in that channel. - Now `roleinfo` will show '?' and '~x' total users when the guild cache isn't complete. - Fixed activities and active clients not showing in `userinfo`. - Fixed a bug in `lyrics` that caused the "-headers" option from being ignored when only that was passed. - Fixed a bug in `wikipedia` that occurred with some articles. - Fixed a bug in `img` that occurred when a !Bang was triggered. - Fixed a bug in `img` that occurred when a large text was passed. - Fixed a rare bug in the paginator that occurred when the user that added a reaction wasn't cached. - Fixed a bug in `trivia` that occurred when the command was used simultaneously. - Fixed a rare bug in `ocr` and `ocrtranslate` that occurred when a corrupted image was used. - Lots of other bug fixes.
ar: - أمر جديد: `give`. - تم تحديث وحدة AI Dungeon وملف API (مرة أخرى) ، وإصلاح خطأ المغامرة المخصص ، وإصلاح `alter`. - تم تحديث مكتبة Google TTS ، باستخدام المعالجات الأولية والمميزات المنقولة من مكتبة gTTS Python. يوفر هذا تنغيمًا ونطقًا صحيحًا ، كما يسمح بإنشاء تحويل النص إلى كلام بنصوص أكبر. - تحسين مكشطة الكلمات. - الآن سيترك Fergun قناة صوتية إذا كان هناك روبوتات فقط في تلك القناة. - الآن "سوف تظهر `roleinfo` '?', '~x' إجمالي المستخدمين عندما لا تكتمل ذاكرة التخزين المؤقت للجماعة. - عدم ظهور الأنشطة الثابتة والعملاء النشطين في `userinfo`. - إصلاح الخلل في `lyrics` الذي تسبب في تجاهل خيار "headers" عند تجاوز ذلك فقط. - إصلاح الخلل في `wikipedia` الذي حدث في بعض المقالات. - تم إصلاح الخلل في `img` الذي حدث عندما تم تشغيل !Bang. - تم إصلاح الخلل في `img` الذي حدث عند تمرير نص كبير. - تم إصلاح خطأ نادر في الفاصل الزمني حدث عندما لم يتم تخزين المستخدم الذي أضاف رد فعل في ذاكرة التخزين المؤقت. - تم إصلاح الخلل في `trivia` الذي حدث عند استخدام الأمر في نفس الوقت. - تم إصلاح خطأ نادر في `ocr` و `ocrtranslate` الذي حدث عند استخدام صورة تالفة. - الكثير من إصلاحات الأخطاء الأخرى.
es: - Nuevo comando: `give`. - Actualizado el módulo de AI Dungeon y el wrapper de API (otra vez), arreglado el bug de la aventura personalizada y arreglado `alter`. - Actualizado la librería de Google TTS, ahora usando preprocesadores y tokenizadores porteados de la librería de Python gTTS. Esto provee entonaciones y pronunciaciones correctas, y permite hacer TTS con textos más largos. - Mejorado el scraper de letras. - Ahora Fergun dejará un canal de voz cuando solo haya bots en ese canal. - Ahora `roleinfo` mostrará '?' y '~x' en los usuarios totales cuando la caché de servidor no está completa. - Arreglado Fixed activities and active clients not showing in `userinfo`. - Arreglado un bug `lyrics` que causaba que la opción "-headers" sea ignorado cuando sólo eso era pasado. - Arreglado un bug en `wikipedia` que ocurría con algunos artículos. - Arreglado un bug en `img` que ocurría cuando un !Bang era activado. - Arreglado un bug en `img` que ocurría cuando un texto largo era pasado. - Arreglado un bug raro en el paginador que ocurría cuando el usuario que añadía una reacción no estaba en la caché. - Arreglado un bug in `trivia` que ocurría cuando el comando era usado simultáneamente. - Arreglado un bug raro in `ocr` y `ocrtranslate` que ocurría cuando una imagen corrupta era usada. - Muchos bugs fixes menores.
tr: - Yeni komut: `give`. - AI Dungeon modülü ve API sarmalayıcı (tekrar) güncellendi, özel macera hatası düzeltildi ve `alter` düzeltildi. - Google TTS kitaplığı, artık gTTS Python kitaplığından taşınan ön işlemciler ve belirteçler kullanılarak güncellendi. Bu, doğru tonlama ve telaffuz sağlar ve ayrıca TTS'nin daha büyük metinlerle yapılmasına izin verir. - Şarkı sözü sıyırıcı geliştirildi. - Şimdi Fergun, o kanalda yalnızca botlar varsa bir ses kanalından ayrılacak. - Artık "roleinfo", guild önbelleği tamamlanmadığında '?' ve '~x' toplam kullanıcıyı gösterecek. - Sabit etkinlikler ve aktif istemciler `userinfo` içinde gösterilmiyor. - Yalnızca bu geçildiğinde "-headers" seçeneğinin yok sayılmasına neden olan `lyrics` hata düzeltildi. - Bazı makalelerde meydana gelen `wikipedia` hata düzeltildi. - `img` tetiklendiğinde meydana gelen !Bang hatası düzeltildi. - Büyük bir metin iletildiğinde meydana gelen `img` hatası düzeltildi. - Bir reaksiyon ekleyen kullanıcı önbelleğe alınmadığında ortaya çıkan sayfalayıcıda nadir görülen bir hata düzeltildi. - `trivia` içinde komut aynı anda kullanıldığında oluşan bir hata düzeltildi. - Bozuk bir görüntü kullanıldığında meydana gelen nadir bir `ocr` ve `ocrtranslate` hata düzeltildi. - Diğer birçok hata düzeltmesi.

source: Invite
ar: يدعو
es: Invitación
tr: Davet et

source: DBL Bot Page
ar: صفحة DBL Bot
es: Página de DBL
tr: DBL Bot Sayfası

source: Vote Link
ar: رابط التصويت
es: Link de Votación
tr: Oylama Bağlantısı

source: Support Server
ar: خادم الدعم
es: Servidor de Soporte
tr: Destek Sunucusu

# ContactInfoNoServer
source: If you have any bug report, question or suggestion, you can contact me via direct message ({0}).
ar: إذا كان لديك أي تقرير خطأ أو سؤال أو اقتراح ، يمكنك الاتصال بي عبر رسالة مباشرة ({0}).
es: Si tienes algún reporte de bug, pregunta o sugerencia, puedes contactarme vía mensaje directo ({0}).
tr: Herhangi bir hata raporunuz, sorunuz veya öneriniz varsa, doğrudan mesaj ({0}) aracılığıyla benimle iletişime geçebilirsiniz.

# ValueNotSetInConfig
source: The value of `{0}` has not been established in the config. If this problem persists, contact the developers.
ar: لم يتم تحديد قيمة `{0}` في التهيئة. إذا استمرت هذه المشكلة ، فاتصل بالمطورين.
es: El valor de `{0}` no ha sido establecido en la configuración. Si este problema persiste, contacta a los desarrolladores.
tr: Yapılandırmada `{0}` değeri belirlenmedi. Bu sorun devam ederse, geliştiricilerle iletişime geçin.

# CannotGiveToBot
source: You cannot give the ID to a bot!
ar: لا يمكنك إعطاء المعرف لروبوت!
es: No puedes dar la ID a un bot!
tr: Kimliği bir bota veremezsiniz!

# NoAvailableLanguages
source: It seems there are no available languages.
ar: يبدو أنه لا توجد لغات متاحة.
es: Parece que no hay idiomas disponibles.
tr: Görünüşe göre mevcut dil yok.

source: Request timed out.
ar: الطلب منتهي المدة.
es: Tiempo de espera agotado para la solicitud.
tr: İstek zaman aşımına uğradı.

# DiscordServerError
source: Error in Discord Servers
ar: خطأ في خوادم الخلاف
es: Error en los servidores de Discord
tr: Discord Sunucularında Hata

# DiscordServerErrorInfo
source: The command failed due to an issue on Discord's side. Please try again later.
ar: فشل الأمر نظرا لوجود مشكلة على جانب الخلاف في. الرجاء معاودة المحاولة في وقت لاحق.
es: El comando ha fallado debido a un problema en los servidores de Discord. Por favor inténtelo de nuevo más tarde.
tr: Discord tarafındaki bir sorun nedeniyle komut başarısız oldu. Lütfen daha sonra tekrar deneyiniz.

source: Error Details
ar: تفاصيل الخطأ
es: Detalles del error
tr: Hata detayları

# NowhereToVote
source: There's nowhere to vote.
ar: لا يوجد مكان للتصويت.
es: No hay ningún lugar para votar.
tr: Oy verecek yer yok.

# LavalinkNotConnected
source: Could not connect to the Lavalink server. Please try again later.
ar: تعذر الاتصال بخادم Lavalink. الرجاء المحاولة مرة أخرى لاحقاً.
es: No se pudo conectar al servidor de Lavalink. Por favor inténtelo de nuevo más tarde.
tr: Lavalink sunucusuna bağlanılamadı. Lütfen daha sonra tekrar deneyiniz.

# ServerBlacklisted
source: The server {0} was blacklisted.
ar: تم وضع الخادم {0} في القائمة السوداء.
es: El servidor {0} fue agregado a la lista negra.
tr: {0} sunucusu kara listeye alındı.

# ServerBlacklistedWithReason
source: The server {0} was blacklisted with the reason: {1}
ar: تم وضع الخادم {0} في القائمة السوداء للسبب: {1}
es: El servidor {0} fue agregado a la lista negra con la razón: {1}
tr: {0} sunucusu şu nedenle kara listeye alındı: {1}

# ServerBlacklistRemoved
source: The server {0} was removed from the blacklist.
ar: تمت إزالة الخادم {0} من القائمة السوداء.
es: El servidor {0} fue eliminado de la lista negra.
tr: {0} sunucusu kara listeden kaldırıldı.

# blacklistserverSummary
source: Adds a server to the blacklist, or removes it.
ar: يضيف خادمًا إلى القائمة السوداء أو يزيله.
es: Agrega un servidor a la lista negra, o lo elimina de ella.
tr: Kara listeye bir sunucu ekler veya onu kaldırır.

# blacklistserverParam1
source: The ID of the server to blacklist.
ar: معرف الخادم إلى القائمة السوداء.
es: La ID del servidor a agregar a la lista negra.
tr: Kara listeye alınacak sunucunun kimliği.

# blacklistserverParam2
source: The reason for being blacklisted.
ar: سبب إدراجها في القائمة السوداء.
es: La razón de ser incluido en la lista negra.
tr: Kara listeye alınma nedeni.

# NoPresenceIntent
source: Cannot get Spotify status because I don't have the Guild Presences intent.
ar: لا يمكن الحصول على حالة Spotify لأنني لا أمتلك: Guild Presences Intent.
es: No puedo obtener el estado de Spotify porque no tengo: Guild Presences Intent.
tr: Guild Presences Intent sahip olmadığım için Spotify durumu alınamıyor

# NoSpotifyStatus
source: No Spotify status found for user {0}.
ar: لم يتم العثور على حالة Spotify للمستخدم {0}.
es: No se encontró ningún estado de Spotify para el usuario {0}.
tr: {0} kullanıcısı için Spotify durumu bulunamadı.

source: Click here
ar: انقر هنا
es: Click aquí
tr: Buraya Tıkla

source: Title
ar: عنوان
es: Título
tr: Başlık

source: Artist(s)
ar: الفنانين
es: Artista(s)
tr: Sanatçı(lar)

source: Album
ar: البوم
es: Álbum
tr: Albüm

source: Duration
ar: المدة الزمنية
es: Duración
tr: Süresi

source: Lyrics
ar: كلمات الاغنية
es: Letra
tr: Şarkı sözleri

source: Track Url
ar: تتبع عنوان Url
es: Url de la pista musical
tr: Takip URL'si

# spotifySummary
source: Gets the Spotify status info of a user.
ar: يحصل على معلومات حالة Spotify لمستخدم.
es: Obtiene la información del estado de Spotify de un usuario.
tr: Bir kullanıcının Spotify durum bilgisini alır.

# spotifyParam1
source: The user to get its Spotify status info.
ar: يحصل المستخدم على معلومات حالة Spotify الخاصة به.
es: El usuario a obtener la información de estado de Spotify.
tr: Kullanıcı, Spotify durum bilgisini alacak.

# wolframalphaSummary
source: Gets a response from Wolfram|Alpha based on the query.
ar: يحصل على استجابة من Wolfram | Alpha بناءً على الاستعلام ،
es: Obtiene una respuesta de Wolfram|Alpha basado en la consulta.
tr: Wolfram | Alpha'dan sorguya göre bir yanıt alır,

# wolframalphaParam1
source: The query to send.
ar: الاستعلام المراد إرساله.
es: La consulta a enviar.
tr: Gönderilecek sorgu.

# defineSummary
source: Gets definitions of a word.
ar: يحصل على تعريفات للكلمة.
es: Obtiene definiciones de una palabra.
tr: Bir kelimenin tanımlarını alır.

# defineParam1
source: The word to search.
ar: كلمة البحث.
es: La palabra a buscar.
tr: Слово для поиска.

source: Word
ar: كلمة
es: Palabra
tr: Kelime

source: Definition
ar: تعريف
es: Definición
tr: Tanım

source: Synonyms
ar: المرادفات
es: Sinónimos
tr: Eş anlamlı

source: Antonyms
ar: التضاد
es: Antónimos
tr: Zıt anlamlılar

# archiveParam1
source: The Url of the website to take a screenshot.
ar: عنوان Url الخاص بالموقع لأخذ لقطة شاشة.
es: La Url del sitio web a tomar una captura de pantalla.
tr: Ekran görüntüsü almak için web sitesinin URL'si.

# archiveParam2
source: A timestamp with the specified format.
ar: طابع زمني بالتنسيق المحدد.
es: La marca de tiempo con el formato especificado.
tr: Belirtilen biçime sahip bir zaman damgası.

# TimestampFormat
source: The timestamp must have format `YYYYMMDDhhmmss`, where `YYYY` is required and the other values are optional.
ar: يجب أن يكون الطابع الزمني بتنسيق `YYYYMMDDhhmmss` ، حيث يكون `YYYY `مطلوبًا وتكون القيم الأخرى اختيارية.
es: La marca de tiempo debe tener el formato `YYYYMMDDhhmmss`, donde `YYYY` es requerido y los otros valores son opcionales.
tr: Zaman damgası, `YYYYMMDDhhmmss` biçiminde olmalıdır; burada `YYYY` gereklidir ve diğer değerler isteğe bağlıdır.

source: Invalid timestamp.
ar: الطابع الزمني غير صالح.
es: Marca de tiempo inválida.
tr: Geçersiz zaman damgası.

# NoSnapshots
source: No snapshots found for specified url and timestamp.
ar: لم يتم العثور على لقطات لعنوان url والطابع الزمني المحددين.
es: No se encontraron instantáneas para la url y marca de tiempo especificados.
tr: Belirtilen url ve zaman damgası için anlık görüntü bulunamadı.

# archiveSummary
source: Gets a screenshot of a website in the specified year/month/day using a timestamp.
ar: الحصول على لقطة شاشة لموقع ويب في السنة / الشهر / اليوم المحدد باستخدام طابع زمني.
es: Obtiene una captura de pantalla de un sitio web en el año/mes/día especifado usando una marca de tiempo.
tr: Zaman damgası kullanarak belirtilen yıl / ay / gün içindeki bir web sitesinin ekran görüntüsünü alır.

source: Timestamp
ar: الطابع الزمني
es: Marca de tiempo
tr: Zaman damgası

# CouldNotFindLine
source: Could not find the command method line.
ar: تعذر العثور على سطر أسلوب الأوامر.
es: No se pudo encontrar el número de línea del método del comando.
tr: Komut yöntemi satırı bulunamadı.

# shortenSummary
source: Shortens a Url.
ar: تقصير عنوان Url.
es: Acorta una Url.
tr: Bir URL'yi kısaltır.

# shortenParam1
source: The Url to shorten.
ar: عنوان Url المطلوب اختصاره.
es: La Url a acortar.
tr: Kısaltılacak URL.
