Repository: d4n3436/Fergun
Catalog: src/strings.*.resx
Languages: ar, es, tr

# Changelog1.3
source: - New command: `dump`. - Updated the AI Dungeon API to use WebSockets. Now the response times are a lot faster. - Updated the `new` command to use reactions instead of having to send numbers or names. - Added proper ID queue support for the AI Dungeon module. - Removed `ocr2`. - Fixed a bug in the command cache that made the bot reply 2 times in some commands because the command message was "updated" to include an embed or a image/video preview. - Fixed a bug in the initialization of the cache for the commands `img`, `urban` and `ytrandom` that prevented the cached results being saved. - Fixed a bug in `new` that caused the selected option to not be correct. - Fixed a bug in `avatar` and `user` that caused the commands to fail because the avatar was not found (Discord returned the cached avatar). - Fixed a bug in `img` that occurred when the embed tried to use an "invalid" url image (this time the "invalid" images will simply be discarded). - Fixed a bug in `ban` and `hackban` that caused the commands to fail when passed a guild user Id that can't be banned, returning error 403. - Fixed a bug in `badtranslator` that caused the command to fail because the target language was not found. - Fixed a bug in `badtranslator` that caused the command to enter in a infinite loop in rare cases. - Fixed a bug in `ytrandom` that caused the command to lock itself if an error occurs when creating the video cache. - Fixed a bug in `snipe` and `editsnipe` that occurred when the text was larger that 1024 characters. - Fixed a bug in `wikipedia` that occurred when trying to use the article image. - Fixed a bug in `changelog` that prevented viewing the changelog because of the way the version numbers were saved. - Fixed a bug in `skip` and `seek` that occurred when the player state was invalid. - Fixed a bug in `trivia` that caused the text to be encoded instead of decoded. - Now `badtranslator` won't have duplicated languages. - Reduced *more* the memory usage.
ar: - الأمر الجديد: `تفريغ`. - تم تحديث واجهة برمجة تطبيقات AI Dungeon API لاستخدام WebSockets. الآن أوقات الاستجابة أسرع بكثير. - تحديث الأمر `new` لاستخدام ردود الفعل بدلاً من إرسال أرقام أو أسماء. - تمت إضافة دعم قائمة انتظار معرف مناسب لوحدة AI Dungeon. - تمت إزالة "ocr2". - تم إصلاح الخلل في ذاكرة التخزين المؤقت للأوامر التي جعلت الرد الآلي مرتين في بعض الأوامر لأنه تم "تحديث" رسالة الأمر لتضمين معاينة أو معاينة صورة / فيديو. - تم إصلاح الخلل في تهيئة ذاكرة التخزين المؤقت للأوامر "img" و "المناطق الحضرية" و "ytrandom" التي حالت دون حفظ النتائج المخبأة. - تم إصلاح الخلل في `new` الذي تسبب في تحديد خيار الحرف عشوائيًا بدون سبب. - تم إصلاح الخلل في "الصورة الرمزية" و "المستخدم" الذي تسبب في فشل الأوامر بسبب عدم العثور على الصورة الرمزية (أعاد Discord الصورة الرمزية المخزنة مؤقتًا). - تم إصلاح الخلل في `img` الذي حدث عندما حاول التضمين استخدام صورة عنوان URL" غير صالحة "(هذه المرة سيتم تجاهل عناوين URL" غير الصالحة "). - تم إصلاح الخلل في "hackban" و "hackban" الذي تسبب في فشل الأوامر عند تمرير معرف مستخدم نقابة لا يمكن حظره ، وإرجاع الخطأ 403. - تم إصلاح الخلل في "badtranslator" الذي تسبب في فشل الأمر نظرًا لعدم العثور على اللغة الهدف. - تم إصلاح الخلل في "badtranslator" الذي تسبب في إدخال الأمر في حلقة لا نهائية في حالات نادرة. - تم إصلاح الخلل في `ytrandom` الذي تسبب في قفل الأمر نفسه في حالة حدوث خطأ عند إنشاء ذاكرة التخزين المؤقت للفيديو. - تم إصلاح الخلل في "snipe" و "editsnipe" الذي حدث عندما كان النص أكبر من 1024 حرفًا. - تم إصلاح الخلل في "ويكيبيديا" الذي حدث عند محاولة استخدام صورة المقالة. - تم إصلاح الخلل في "سجل التغيير" الذي منع عرض التغيير بسبب طريقة حفظ أرقام الإصدارات. - إصلاح الخلل في "تخطي" و "البحث" الذي حدث عندما كانت حالة اللاعب غير صالحة. - تم إصلاح خطأ في `التوافه` أدى إلى تشفير النص بدلاً من فك تشفيره. - الآن لن يكون لـ "badtranslator" لغات مكررة. - خفض * استخدام * الذاكرة بشكل أكبر.
es: - Nuevo comando: `dump`. - Actualizado la API de AI Dungeon para usar WebSocketss. Ahora los tiempos de respuestas son mucho más rápidos. - Actualizado el comando `new` para usar reacciones en vez de tener que enviar números o nombres. - Agregado soporte adecuado de colas para el módulo de AI Dungeon. - Eliminado `ocr2`. - Arreglado un bug en la caché de comandos que hacía que el bot respondiera 2 veces en algunos comandos porque el mensaje del comando se "actualizaba" para incluir una imagen o un embed. - Arreglado un bug en la inicialización de la caché de los comandos `img`, `urban` and `ytrandom` que prevenía que los resultados sean guardados. - Arreglado un bug en `new` que causaba que la opción seleccionada no fuera la correcta. - Arreglado un bug en `avatar` y `user` que causaba que los comandos fallasen porque el avatar no era encontrado (Discord retornaba el avatar de la caché). - Arreglado un bug en `img` que ocurría cuando el embed intentaba usar una imágen "inválida" (esta vez las imágenes "inválidas" serán simplemente descartadas). - Arreglado un bug en `ban` y `hackban` que causaba que los comandos fallasen cuando se pasaba una ID de un usuario que está en el servidor y que no puede ser baneado, retornando error 403. - Arreglado un bug en `badtranslator` que causaba que el comando fallase porque el idioma objetivo no era encontrado. - Arreglado un bug en `badtranslator` que causaba que el comando entrara en un bucle infinito en raras ocasiones. - Arreglado un bug en `ytrandom` que causaba que el comando se bloqueara a si mismo si ocurría un error mientras se creaba la caché de videos. - Arreglado un bug en `snipe` y `editsnipe` que ocurría cuando el texto era mayor a 1024 carácteres. - Arreglado un bug en `wikipedia` que ocurría cuando se intentaba usar la imagen del artículo. - Arreglado un bug en `changelog` que evitabar ver el changelog debido a la manera en que las versiones eran guardadas. - Arreglado un bug en `skip` y `seek` que ocurría cuando el estado del reproductor era inválido. - Arreglado un bug en `trivia` que causaba que el texto fuera codificado en vez de decodificado. - Ahora `badtranslator` no tendrá idiomas duplicados. - Reducido *mas* el uso de memoria.
tr: - Yeni komut: `dump`. - AI Dungeon API'sini WebSockets'i kullanacak şekilde güncellendi. Şimdi tepki süreleri çok daha hızlı. - Sayı veya ad göndermek yerine reaksiyonları kullanmak için `yeni` komutu güncellendi. - AI Dungeon modülü için uygun kimlik kuyruğu desteği eklendi. - "ocr2" kaldırıldı. - Komut önbelleğindeki bazı komutlarda 2 kez yanıt veren bir hata düzeltildi çünkü komut mesajı bir gömme veya bir görüntü / video önizlemesi içerecek şekilde "güncellendi". - Önbellek sonuçlarının kaydedilmesini engelleyen "img`," urban "ve" ytrandom` komutları için önbelleğin başlatılmasındaki bir hata düzeltildi. - Karakter seçeneğinin rastgele seçilmesine neden olmayan yeni bir hata düzeltildi. - Avatar bulunamadığı için komutların başarısız olmasına neden olan `` avatar`` ve `kullanıcı`daki bir hata düzeltildi (Discord önbelleğe alınan avatarı döndürdü). - Gömme "geçersiz" bir URL görüntüsü kullanmaya çalıştığında oluşan "img" deki bir hata düzeltildi (bu sefer "geçersiz" URL'ler basitçe silinecektir). - "hackban" ve "hackban" daki, yasaklanamayan bir guild kullanıcı kimliğini geçtiğinde komutların başarısız olmasına neden olan ve 403 hatası döndüren bir hata düzeltildi. - Hedef dil bulunamadığı için komutun başarısız olmasına neden olan "badtranslator" daki bir hata düzeltildi. - Komutun nadir durumlarda sonsuz bir döngüye girmesine neden olan "badtranslator" daki bir hata düzeltildi. - Video önbelleği oluşturulurken bir hata oluşursa, komutun kendisini kilitlemesine neden olan `ytrandom`daki bir hata düzeltildi. - Metin 1024 karakterden daha büyük olduğunda ortaya çıkan `snipe` ve` editsnipe`daki bir hata düzeltildi. - Makale resmini kullanmaya çalışırken oluşan "wikipedia" daki bir hata düzeltildi. - Değişiklik günlüğünde sürüm numaralarının kaydedilme biçimi nedeniyle görüntülenmesini engelleyen bir hata düzeltildi. - Oyuncu durumu geçersiz olduğunda oluşan "atlama" ve "arama" hatalarını düzeltti. - `` Trivia '' da kod çözme yerine metnin kodlanmasına neden olan bir hata düzeltildi. - Şimdi "badtranslator" ın yinelenen dilleri olmayacak. - Bellek kullanımını azaltır *.

source: Nothing to delete.
ar: ليس هناك شيء لحذفه.
es: Nada que eliminar.
tr: Silinecek bir şey yok.

source: Members
ar: أفراد
es: Miembros
tr: Üyeler

source: Online
ar: عبر الانترنت
es: En línea
tr: İnternet üzerinden

source: Idle
ar: خامل
es: Ausente
tr: Boşta

source: DnD
ar: السحب والإفلات
es: No molestar

source: Offline
ar: غير متصل على الانترنت
es: Desconectado
tr: Çevrim

# aidinfoSummary
source: Shows the AI Dungeon info.
ar: يظهر من المعلومات AI الأبراج.
es: Muestra la info de AI Dungeon.
tr: AI Zindan bilgi gösterir.

# aidnewSummary
source: Creates a new adventure.
ar: يخلق مغامرة جديدة.
es: Crea una nueva aventura.
tr: Yeni bir macera oluşturur.

# continueSummary
source: Continues the adventure with the provided text. If no text is passed, the AI will generate the story.
ar: يواصل المغامرة مع نص المقدمة. إذا كان يتم تمرير أي نص، فإن منظمة العفو الدولية توليد القصة.
es: Continúa la aventura con el texto ingresado. Si no se da un texto, la IA generará una historia.
tr: sağlanan metin ile macera devam ediyor. Hiçbir metin iletilirse, AI hikaye üretecektir.

# continueParam1
source: The adventure ID.
ar: معرف المغامرة.
es: La ID de aventura.
tr: macera kimliği.

# continueParam2
source: The text to use.
ar: النص للاستخدام.
es: El texto a usar.
tr: Metin kullanmak.

# undoSummary
source: Undoes the last action.
ar: التراجع عن الإجراء الأخير.
es: Deshace la última acción.
tr: Son işlemi geri alır.

# undoParam1
source: The adventure ID.
ar: معرف المغامرة.
es: La ID de aventura.
tr: macera kimliği.

# redoSummary
source: Redoes the last undone action.
ar: Redoes العمل التراجع الماضي.
es: Rehace la última acción deshecha.
tr: Son eylemi yineler.

# redoParam1
source: The adventure ID.
ar: معرف المغامرة.
es: La ID de aventura.
tr: macera kimliği.

# rememberSummary
source: Adds text to the memory context.
ar: ويضيف النص إلى إطار الذاكرة.
es: Agrega texto en el contexto de la memoria.
tr: Hafıza bağlamında metin ekler.

# rememberParam1
source: The adventure ID.
ar: معرف المغامرة.
es: La ID de aventura.
tr: macera kimliği.

# rememberParam2
source: The text to add.
ar: النص لإضافة.
es: El texto a agregar.
tr: Metin eklemek için.

# alterSummary
source: Edits the last response.
ar: التعديلات استجابة الماضية.
es: Edita la última respuesta.
tr: Geçen tepkisini düzenler.

# alterParam1
source: The adventure ID.
ar: معرف المغامرة.
es: La ID de aventura.
tr: macera kimliği.

# retrySummary
source: Retries the last action and generates a new response.
ar: عمليات إعادة الإجراء الأخير ويولد استجابة جديدة.
es: Reintenta la última acción y genera una nueva respuesta.
tr: Son eylemi yeniden dener ve yeni bir yanıt oluşturur.

# retryParam1
source: The adventure ID.
ar: معرف المغامرة.
es: La ID de aventura.
tr: macera kimliği.

# makepublicSummary
source: Makes an ID public.
ar: يجعل الجمهور ID.
es: Hace público una ID.
tr: bir kimlik halka yapar.

# makepublicParam1
source: The adventure ID. You have to own this ID.
ar: مغامرة IF. عليك أن تملك هذا الرقم.
es: La ID de aventura. Tienes que ser el dueño de esta ID.
tr: macera IF. Bu Kimliği sahibi olmak gerekir.

# makeprivateSummary
source: Makes an ID private.
ar: يجعل الخاص ID.
es: Hace privado una ID.
tr: bir kimlik olarak gizli yapar.

# makeprivateParam1
source: The adventure ID. You have to own this ID.
ar: مغامرة IF. عليك أن تملك هذا الرقم.
es: La ID de aventura. Tienes que ser el dueño de esta ID.
tr: macera IF. Bu Kimliği sahibi olmak gerekir.

# idlistSummary
source: Gets the ID list of a user.
ar: يحصل على قائمة معرف مستخدم.
es: Muestra la lista de IDs de un usuario.
tr: bir kullanıcının kimliği liste alır.

# idlistParam1
source: The user to get its IDs.
ar: للمستخدم الحصول على معرفات لها.
es: El usuario a obtener sus IDs.
tr: Kullanıcı, Kimliğini almak için.

# idinfoSummary
source: Shows info about a ID.
ar: يظهر من المعلومات حول هوية.
es: Muestra información acerca de una ID.
tr: Bir Kimliği hakkında Gösterileri bilgi.

# idinfoParam1
source: The adventure ID.
ar: معرف المغامرة.
es: La ID de aventura.
tr: macera kimliği.

# deleteSummary
source: Removes an ID.
ar: يزيل معرف.
es: Elimina una ID.
tr: Bir kimlik kaldırır.

# deleteParam1
source: The adventure ID.
ar: معرف المغامرة.
es: La ID de aventura.
tr: macera kimliği.

# dumpSummary
source: Dumps all the text from an ID.
ar: مقالب عن النص من معرف.
es: Extrae todo el texto de una ID.
tr: Bir kimliğinden tüm metin döker.

# dumpParam1
source: The adventure ID.
ar: معرف المغامرة.
es: La ID de aventura.
tr: macera kimliği.

# Changelog1.3.3
source: - Removed `someone`. - Now Fergun will show the command help when using a command incorrectly. - Added a example to every command with parameters in the command help. - Added operating system info in `stats`. - Fixed a bug in `ban`, `kick`, `nick` and `clear` that prevented working properly, saying that the specified user was not found. This happened because the user cache was disabled some time ago. - Fixed a bug in `clear` that would incorrectly say that there are messages older that 2 weeks when there are no messages to delete. - Fixed a bug in `resize` and `invert` that caused the commands to fail because Discord shows an invalid image preview to some urls.
ar: - إزالة `someone`. - والآن Fergun عرض مساعدة القيادة عند استخدام أمر غير صحيح. - يضاف مثال لكل أمر مع المعلمات في مساعدة الأوامر. - أضيفت تشغيل نظام المعلومات في `stats`. - إصلاح الخلل في `ban`،` kick`، `` nick` وclear` التي حالت دون العمل بشكل صحيح، قائلا ان لم يتم العثور على المستخدم المحدد. حدث هذا لأن ذاكرة التخزين المؤقت المستخدم تم تعطيل منذ بعض الوقت. - إصلاح الخلل في `clear` أن أقول بشكل غير صحيح أن هناك رسائل القديمة التي 2 أسابيع عندما لا يكون هناك رسائل إلى حذف. - إصلاح الخلل في `` resize` وinvert` التي تسببت الأوامر إلى فشل بسبب الخلاف يظهر معاينة الصور غير صالحة لبعض عناوين المواقع.
es: - Eliminado `someone`. - Ahora Fergun mostrará la ayuda de un comando cuando éste se use de manera incorrecta - Agregado un ejemplo para cada comando con parámetros en la ayuda de comando. - Agregado la info del sistema operativo en `stats`. - Arreglado un bug en `ban`, `kick`, `nick` y `clear` que evitaba que funcionase correctamente, diciendo el usuario especificado no ha sido encontrado. Esto pasaba porque la caché de usuarios fue deshabilitada hace un tiempo. - Arreglado un bug en `clear` que hacia de diciese que habia mensajes anteriores a 2 semanas cuando no había mensajes a eliminar. - Arreglado un bug en `resize` y `invert` que causaba el comando fallase porque Discord mostraba en la prevista de algunas urls una imágen inválida.
tr: - kaldırıldı `someone`. - Yanlış bir komut kullanırken Şimdi Fergun komut yardımı gösterecektir. - Komut yardım parametrelerle her komuta bir örnek eklendi. - stats` `in işletim sistemi bilgisi eklendi. - `ban`,` kick`, `nick` ve belirtilen kullanıcı bulunamadı söyleyerek düzgün çalıştığından engellediğini` clear` bir hata düzeltildi. kullanıcı önbellek bir süre önce devre dışı olduğu için oldu. - yanlış Silinecek mesaj varken 2 hafta o eski iletiler olduğunu söyleyebilirim clear` `de bir hata düzeltildi. - Bir resize` `hatasından ve ikilik var bazı URL'ler geçersiz bir görüntü önizlemesini gösterir çünkü neden komutlar başarısız olduğunu` invert` düzeltildi.

# RatelimitUses
source: {0} use(s) every {1}
ar: يستخدم {0} كل {1}
es: {0} uso(s) cada {1}
tr: Her {1} için {0} kullanım

source: Requirements
ar: المتطلبات
es: Requisitos
tr: Gereksinimler

# cmdstatsSummary
source: Shows the command stats.
ar: تبين الإحصاءات الأوامر.
es: Muestra las estadísticas de los comandos.
tr: Komut istatistikleri gösterir.

# Changelog1.3.6
source: - New command: `cmdstats`. - Now the `first` and `last` paginator buttons in `img` and `urban` will only appear when there are 3 or more pages, and the `jump` button when there are 4 or more pages. - Now Fergun will send a direct message to warn a user when the bot doesn't have the minimum required permissions in the current channel (`SendMessages` and `EmbedLinks`). - Now Fergun supports multiple user activities, this is useful in `userinfo` and `lyrics` (when the Spotify activity is hidden by the custom status). - Added ratelimit and required permissions info in the command help. - Fixed a bug in `wikipedia` that caused the command to fail because the query was not encoded in some cases. - Fixed a bug in `screenshot` that caused the command to fail because the url was encoded by error. - Fixed a bug in the AI Dungeon module that caused the commands to fail when different IDs were used at the same time.
ar: - الأمر الجديد: `cmdstats`. - الآن سيظهر الزران {0} و {0} paginator في {0} و {0} فقط عندما يكون هناك 3 صفحات أو أكثر ، والزر {0} عندما يكون هناك 4 صفحات أو أكثر. - الآن سترسل Fergun رسالة مباشرة لتحذير المستخدم عندما لا يكون لدى البوت الحد الأدنى من الأذونات المطلوبة في القناة الحالية (`SendMessages` و` EmbedLinks`). - يدعم الآن Fergun أنشطة المستخدم المتعددة ، وهذا مفيد في `userinfo` و` Lyrics` (عندما يكون نشاط Spotify مخفيًا بالحالة المخصصة). - تمت إضافة معلومات ratelimit والأذونات المطلوبة في تعليمات الأمر. - تم إصلاح الخلل في "ويكيبيديا" الذي تسبب في فشل الأمر لأنه لم يتم ترميز الاستعلام في بعض الحالات. - تم إصلاح الخلل في "لقطة الشاشة" التي تسببت في فشل الأمر بسبب تشفير عنوان URL عن طريق الخطأ. - تم إصلاح الخلل في وحدة AI Dungeon التي تسببت في فشل الأوامر عند استخدام معرفات مختلفة في نفس الوقت.
es: - Nuevo comando: `cmdstats`. - Ahora los botones del paginador `primero` y `último` en `img` y` urban` solo aparecerán cuando haya 3 o más páginas, y el botón `saltar` cuando haya 4 o más páginas. - Ahora Fergun enviará un mensaje directo para advertir a un usuario cuando el bot no tiene los permisos mínimos requeridos en el canal actual (`SendMessages` y `EmbedLinks`). - Ahora Fergun soporta múltiples actividades de usuario, esto es útil en `userinfo` y `lyrics` (cuando la actividad de Spotify está oculta por el estado personalizado). - Agregado información de los permisos requeridos y de ratelimit en la ayuda de los comandos. - Arreglado un error en `wikipedia` que causaba que el comando fallase porque el texto a buscar no estaba codificado en algunos casos. - Arreglad un error en `screenshot` que causaba que el comando fallase porque la url estaba codificada por error. - Arreglado un error en el módulo AI Dungeon que causaba que los comandos fallasen cuando se usaban diferentes IDs al mismo tiempo.
tr: - Yeni komut: `cmdstats`. - Şimdi {0} ve {0} içindeki {0} ve {0} sayfalayıcı düğmeleri yalnızca 3 veya daha fazla sayfa olduğunda ve {0} düğmesi 4 veya daha fazla sayfa olduğunda görünecektir. - Artık Fergun, bot geçerli kanalda (`SendMessages` ve` EmbedLinks`) gerekli minimum izinlere sahip olmadığında kullanıcıyı uyarmak için doğrudan bir mesaj gönderecek. - Artık Fergun birden fazla kullanıcı etkinliğini destekliyor, bu `userinfo` ve` şarkı sözleri`nde (Spotify etkinliği özel durum tarafından gizlendiğinde) kullanışlıdır. - Komut yardımına ratelimit ve gerekli izin bilgileri eklendi. - Bazı durumlarda sorgu kodlanmadığı için komutun başarısız olmasına neden olan wikipedia'daki bir hata düzeltildi. - Url yanlışlıkla kodlandığı için komutun başarısız olmasına neden olan ekran görüntüsünde bir hata düzeltildi. - AI Dungeon modülünde, aynı anda farklı kimlikler kullanıldığında komutların başarısız olmasına neden olan bir hata düzeltildi.

# CommandStatsInfo
source: Command stats (since {0})
ar: إحصائيات الأوامر (منذ {0})
es: Command stats (desde {0})
tr: Komut İstatistikler ({0} beri)

# lmgtfySummary
source: Let me Google that for you.
ar: اسمحوا لي أن جوجل ذلك لك.
es: Permíteme que use Google por ti.
tr: Bunu senin için Google'da arayalım.

# lmgtfyParam1
source: The keyword(s) to search.
ar: الكلمة (الكلمات) الرئيسية للبحث.
es: Las palabras clave a buscar.
tr: Aranacak anahtar kelimeler.

# pasteSummary
source: Uploads text to Hastebin.
ar: تحميل النص إلى Hastebin.
es: Sube texto a Hastebin.
tr: Hastebin yükledikleriniz metni.

# pasteParam1
source: The text to upload.
ar: النص للتحميل.
es: El texto a subir.
tr: Metin yüklemek için.

source: Uploading...
ar: تحميل...
es: Subiendo...
tr: Yükleme...

# bigsnipeSummary
source: Shows the last deleted messages in the current channel or the specified.
ar: يظهر آخر حذف الرسائل في القناة الحالية أو المحدد.
es: Muestra los últimos mensajes eliminados en el canal actual.
tr: Gösteriler son mevcut kanal veya belirtilen mesajlar silindi.

# bigsnipeParam1
source: A specific channel to snipe.
ar: قناة خاصة لقنص.
es: Un canal en específico a buscar.
tr: Belirli bir kanal snipe.

# MinutesAgo
source: {0} minutes ago
ar: {0} دقيقة
es: Hace {0} minutos
tr: {0} dakika önce

source: Attachment
ar: المرفق
es: Archivo adjunto
tr: Ek dosya

# bigeditsnipeSummary
source: Shows the last edited messages in the current channel or the specified.
ar: يظهر الرسائل التي تم تحريرها مشاركة في القناة الحالية أو المحدد.
es: Muestra los últimos mensajes editados en el canal actual.
tr: Gösterim mevcut kanal veya belirtilen son düzenlenmiş mesajlar.

# bigeditsnipeParam1
source: A specific channel to snipe.
ar: قناة خاصة لقنص.
es: Un canal en específico a buscar.
tr: Belirli bir kanal snipe.

source: Text Channel
ar: قناة النص
es: Canal de Texto
tr: Metin Kanal

source: Announcement Channel
ar: قناة إعلان
es: Canal de Anuncios
tr: duyuru Kanal

source: Voice Channel
ar: قناة صوت
es: Canal de Voz
tr: Ses Kanalı

source: DM Channel
ar: قناة DM
es: Canal de MD
tr: DM Kanal

source: Bitrate
ar: معدل البت
es: Tasa de bits
tr: Bit Hızı

source: User Limit
ar: حد المستخدم
es: Límite de usuarios
tr: Kullanıcı Sınırı

source: No Limit
ar: لا حدود
es: Sin límite
tr: Limit yok

# disableSummary
source: Disables a command locally (for this server).
ar: تعطيل أمر محليا (لهذا الملقم).
es: Deshabilita un comando localmente (para este servidor).
tr: (Bu sunucu için) yerel olarak bir komut devre dışı bırakır.

# disableParam1
source: The name of the command to disable.
ar: اسم الأمر إلى تعطيل.
es: El nombre del comando a deshabilitar.
tr: komutunun adı devre dışı bırakmak için.

# NonDisableable
source: {0} can't be disabled!
ar: {0} لا يمكن تعطيل!
es: {0} no puede ser deshabilitado!
tr: {0} devre dışı bırakılamaz!

# AlreadyDisabled
source: {0} is already disabled!
ar: {0} تم تعطيل بالفعل!
es: {0} ya está deshabilitado!
tr: {0} zaten devre dışı bırakılmış!

# CommandDisabled
source: The command {0} has been disabled in this server.
ar: تم تعطيل الأمر {0} في هذا الخادم.
es: El comando {0} ha sido deshabilitado en este servidor.
tr: Komut {0} bu sunucuda devre dışı bırakıldı.

# enableSummary
source: Enables a command locally (for this server).
ar: تمكن أمر محليا (لهذا الملقم).
es: Habilita un comando localmente (para este servidor).
tr: (Bu sunucu için) yerel olarak bir komut sağlar.

# enableParam1
source: The name of the command to enable.
ar: اسم الأمر إلى تمكين.
es: El nombre del comando a habilitar.
tr: komutunun adı etkinleştirmek için.

# AlreadyEnabled
source: {0} is already enabled!
ar: {0} تمكين بالفعل!
es: {0} ya está habilitado!
tr: {0} zaten etkindir!

# CommandEnabled
source: The command {0} has been enabled in this server.
ar: تم تمكين الأمر {0} في هذا الخادم.$$
es: El comando {0} ha sido habilitado en este servidor.
tr: Komut {0} bu sunucuda etkinleştirilmiştir.$$

# globaldisableSummary
source: Disables a command globally (in all servers).
ar: تعطيل على مستوى العالم الأمر (في كافة ملقمات).$$
es: Deshabilita un comando globalmente (en todos los servidores).
tr: Devre dışı bırakır (bütün sunucularda) bir komut global.$$

# globaldisableParam1
source: The name of the command to disable globally.
ar: اسم الأمر لتعطيل عالميا.
es: El nombre del comando a deshabilitar globalmente.
tr: komutunun adı global olarak devre dışı bırakmak için.
