Repository: d4n3436/Fergun
Catalog: src/strings.*.resx
Languages: ar, es, tr

source: Type
ar: اكتب
es: Tipo
tr: tip

source: Difficulty
ar: صعوبة
es: Dificultad
tr: zorluk

source: Question
ar: سؤال
es: Pregunta
tr: Soru

source: Options
ar: خيارات
es: Opciones
tr: Seçenekler

# TimeLeft
source: You have {0} seconds to answer.
ar: لديك {0} ثانية للإجابة.
es: Tienes {0} segundos para responder.
tr: Cevaplamak için {0} saniyeniz var.

source: Invalid option!
ar: خيار غير صالح!
es: Opcion invalida!
tr: Geçersiz seçenek!

# Lost1Point
source: You lost 1 point.
ar: لقد فقدت نقطة واحدة.
es: Perdiste 1 punto.
tr: 1 puan kaybettin.

source: Correct answer!
ar: اجابة صحيحة!
es: Respuesta correcta!
tr: Doğru cevap!

# Won1Point
source: You won 1 point.
ar: لقد ربحت نقطة واحدة.
es: Ganaste 1 punto.
tr: 1 puan kazandınız.

source: Incorrect!
ar: غير صحيح!
es: Incorrecto!
tr: Yanlış!

source: The answer is
ar: الجواب هو
es: La respuesta es
tr: Cevap

source: Time's up!
ar: انتهى الوقت!
es: Se acabó el tiempo!
tr: Süre doldu!

source: Points
ar: نقاط
es: Puntos
tr: makas

# joinSummary
source: Joins a voice channel.
ar: ينضم إلى قناة صوتية.
es: Ingresa a un canal de voz.
tr: Bir ses kanalına katılır.

# UserNotInVC
source: You need to connect to a voice channel.
ar: تحتاج إلى الاتصال بقناة صوتية.
es: Debes conectarte a un canal de voz.
tr: Bir ses kanalına bağlanmanız gerekir.

# NowConnected
source: Now connected to {0}.
ar: متصل الآن بـ {0}.
es: Conectado a {0}.
tr: Şimdi bağlı {0}.

# leaveSummary
source: Leaves a voice channel.
ar: يترك قناة صوتية.
es: Deja un canal de voz.
tr: Bir ses kanalı bırakır.

# LeaveNotInVC
source: Join the channel the bot is in to make it leave.
ar: انضم إلى القناة التي يتواجد فيها البوت لجعله يغادر.
es: Ingresa al canal donde está el bot para hacerlo salir.
tr: Botun ayrılmak için bulunduğu kanala katılın.

# LeftVC
source: Bot has now left {0}.
ar: وقد غادر بوت الآن {0}.
es: El bot ha salido de {0}.
tr: Bot şimdi {0} bıraktı.

# moveSummary
source: Moves the bot to the voice channel the current user is.
ar: ينقل البوت إلى القناة الصوتية للمستخدم الحالي.
es: Mueve el bot donde está el usuario actual.
tr: Botu geçerli kullanıcının bulunduğu ses kanalına taşır.

# MoveNotInVC
source: Join a voice channel where you want the bot to be.
ar: انضم إلى قناة صوتية حيث تريد أن يكون البوت.
es: Entra a un canal de voz donde quieras que el bot esté.
tr: Botun olmasını istediğiniz bir ses kanalına katılın.

# playSummary
source: Searches and plays a track from YouTube.
ar: يبحث ويلعب مسار من يوتيوب.
es: Busca y reproduce un video de YouTube.
tr: YouTube'dan bir parça arar ve oynatır.

# playParam1
source: The keyword(s) to search.
ar: الكلمة (الكلمات) الرئيسية للبحث.
es: Las palabras clave a buscar.
tr: Aranacak anahtar kelimeler.

# SelectTrack
source: Send a number from the list
ar: إرسال رقم من قائمة
es: Envía un número de la lista
tr: Listeden bir numara gönderme

source: Search canceled.
ar: تم إلغاء البحث.
es: Búsqueda cancelada.
tr: Arama iptal edildi.

# OutOfIndex
source: Option out of index.
ar: الخيار خارج الفهرس.
es: Opción fuera de índice.
tr: Seçenek dizin dışında.

# replaySummary
source: Replays the current track that is playing, if there's any.
ar: يعيد المسار الحالي الذي يتم تشغيله ، إن وجد.
es: Vuelve a reproducir el video que está en curso, si hay alguno.
tr: Varsa, çalmakta olan parçayı yeniden çalar.

# pauseSummary
source: Pauses the player.
ar: يوقف اللاعب مؤقتًا.
es: Pausa el reproductor.
tr: Oynatıcıyı duraklatır.

# resumeSummary
source: Resumes the playback.
ar: استئناف التشغيل.
es: Reanuda la reproducción.
tr: Oynatmaya devam eder.

# stopSummary
source: Stops the player.
ar: توقف اللاعب.
es: Detiene el reproductor.
tr: Oynatıcıyı durdurur.

# skipSummary
source: Skips the current track, if there's any.
ar: تخطي المسار الحالي ، إن وجد.
es: Salta la pista actual, si hay alguno
tr: Varsa, geçerli parçayı atlar.

# volumeSummary
source: Sets the player volume.
ar: يضبط مستوى صوت المشغل.
es: Establece el volumen del reproductor.
tr: Oynatıcı ses seviyesini ayarlar.

# volumeParam1
source: The volume to set (2 - 150)
ar: الحجم المطلوب ضبطه (2 - 150)
es: El volumen a establecer (2 - 150)
tr: Ayarlanacak hacim (2 - 150)

# queueSummary
source: Shows the queue.
ar: يظهر قائمة الانتظار.
es: Muestra la cola de reproducción.
tr: Kuyruğu gösterir.

# shuffleSummary
source: Shuffles the queue.
ar: خلط الترتيب.
es: Aleatoriza la cola de reproducción.
tr: Kuyruğu karıştırır.

# removeSummary
source: Removes a track in the queue at a specified index.
ar: إزالة مسار في قائمة الانتظار من فهرس محدد.
es: Elimina una pista en la cola en el índice especificado.
tr: Belirli bir dizindeki kuyruktaki bir parçayı kaldırır.

# removeParam1
source: The index of the track to remove.
ar: فهرس المسار المطلوب إزالته.
es: El índice de la pista a eliminar.
tr: Kaldırılacak parçanın dizini.

# lyricsSummary
source: Shows the lyrics of the specified song, or the current track in the player if none passed.
ar: يعرض كلمات الأغنية المحددة ، أو المسار الحالي في المشغل إذا لم يمر أي منها.
es: Muestra la letra de la canción especificada, o de la canción actual en el reproductor si no se pasa alguna canción.
tr: Belirtilen şarkının sözlerini veya müzikçalardan hiç geçmediyse geçerli parçayı gösterir.

# lyricsParam1
source: The song to search its lyrics.
ar: الأغنية للبحث في كلماتها.
es: La canción a buscar su letra.
tr: Şarkı sözlerini aramak için şarkı.

# artworkSummary
source: Shows the artwork of the current track in the player.
ar: يعرض العمل الفني للمسار الحالي في المشغل.
es: Muestra el artwork de la pista actual en el reproductor.
tr: Oynatıcıdaki geçerli parçanın resmini gösterir.

# NoTracks
source: No more tracks to play.
ar: لا مزيد من المسارات للعب.
es: Sin mas pistas para reproducir.
tr: Çalınacak başka parça yok.

source: Now playing
ar: الان العب
es: Reproduciendo ahora
tr: Şimdi oynuyor

# PlayerError
source: An error occurred
ar: حدث خطأ
es: Ocurrió un error
tr: Bir hata oluştu

# PlayerStuck
source: The player got stuck with the track **{0}** for {1} seconds.
ar: علق اللاعب بالمسار ** {0} ** لمدة {1} ثانية.
es: El reproductor se quedó atascado en la pista {0} por {1} segundos.
tr: Oyuncu {1} saniye ** {0} ** parçasına sıkıştı.

# PlayerMoved
source: Moved from **{0}** to **{1}**
ar: تم النقل من ** {0} ** إلى ** {1} **
es: Movido de **{0}** a **{1}**
tr: ** {0} ** 'den ** {1} **' ye taşındı

# PlayerNoMatches
source: No matches found. Try using a Youtube link or a mp3 file link.
ar: لم يتم العثور على تطابق. حاول استخدام وصلة يوتيوب أو ارتباط ملف MP3.
es: No se encontraron resultados. Prueba usando un link de YouTube o un link de un archivo mp3.
tr: Hiçbir sonuç bulunamadı. Bir Youtube bağlantı veya bir mp3 dosyası bağlantısını kullanmayı deneyin.

# PlayerPlaylistAdded
source: Playlist **{0}** ({1} tracks) ({2}) has been added to the queue.
ar: تمت إضافة قائمة التشغيل ** {0} ** ({1} المسارات) ({2}) إلى قائمة الانتظار.
es: Playlist **{0}** ({1} pistas) ({2}) ha sido agregado a la cola.
tr: Oynatma listesi ** {0} ** ({1} parça) ({2}) kuyruğa eklendi.

# PlayerEmptyPlaylistAdded
source: Queued {0} tracks ({1}) Now playing: {2}
ar: مسارات قائمة الانتظار {0} ({1}) يلعب الآن: {2}
es: Añadido a la cola {0} pistas ({1}) Reproduciendo ahora: {2}
tr: Sıraya alınmış {0} parça ({1}) Şimdi çalıyor: {2}

# PlayerTrackAdded
source: {0} has been added to the queue.
ar: تمت إضافة {0} إلى قائمة الانتظار.
es: {0} ha sido añadido a la cola.
tr: {0} kuyruğa eklendi.

# PlayerNowPlaying
source: Now playing: {0}
ar: قيد التشغيل الآن: {0}
es: Reproduciendo ahora: {0}
tr: Şimdi çalıyor: {0}

source: Invalid track.
ar: مسار غير صالح.
es: Pista inválida.
tr: Geçersiz parça.

# Replaying
source: Replaying {0}
ar: إعادة التشغيل {0}
es: Volviendo a reproducir {0}
tr: Tekrar oynatılıyor {0}

# EmptyQueue
source: The queue is empty.
ar: قائمة الانتظار فارغة.
es: La cola está vacia.
tr: Sıra boş.

# PlayerNotPlaying
source: Player isn't playing.
ar: اللاعب لا يلعب.
es: El reproductor no está reproduciendo nada.
tr: Oyuncu oynamıyor.

# PlayerStopped
source: Player now stopped.
ar: توقف اللاعب الآن.
es: El reproductor fue detenido.
tr: Oyuncu şimdi durdu.

# PlayerTrackSkipped
source: Skipped: {0} Now playing: {1}
ar: تم التخطي: {0} يلعب الآن: {1}
es: Saltado: {0} Reproduciendo ahora: {1}
tr: Atlandı: {0} Şimdi çalıyor: {1}

# VolumeOutOfIndex
source: Use a number between 2 and 150.
ar: استخدم رقمًا بين 2 و 150.
es: Usa un número entre 2 y 150.
tr: 2 ile 150 arasında bir sayı kullanın.

# VolumeSet
source: Volume set to: {0}.
ar: تم تعيين مستوى الصوت على: {0}.
es: Volumen establecido a: {0}.
tr: Ses şiddeti: {0}.

# PlayerPaused
source: Player is now paused.
ar: تم إيقاف المشغل مؤقتًا الآن.
es: El reproductor está pausado ahora.
tr: Oyuncu şimdi duraklatıldı.

source: Playback resumed.
ar: تم استئناف التشغيل.
es: Reproducción reanudada.
tr: Oynatma devam etti.

# PlayerNotPaused
source: Player isn't paused.
ar: المشغل غير متوقف مؤقتًا.
es: El reproductor no está pausado.
tr: Oyuncu duraklatılmadı.

# CurrentlyPlaying
source: Currently playing: {0} ({1} of {2})
ar: يلعب حاليًا: {0} ({1} من {2})
es: Reproduciendo actualmente: {0} ({1} de {2})
tr: Şu anda çalmaya: {0} ({1} ve {2})

# MusicInQueue
source: Tracks in queue:
ar: المسارات في قائمة الانتظار:
es: Pistas en la cola:
tr: Kuyruktaki parçalar:

# Queue1Item
source: There's only 1 item in the queue.
ar: يوجد عنصر واحد فقط في قائمة الانتظار.
es: Solo hay 1 item en la cola.
tr: Kuyrukta sadece 1 öğe var.

# QueueShuffled
source: The queue was shuffled.
ar: تم ترتيب قائمة الانتظار بشكل عشوائي.
es: La cola fue aleatorizada.
tr: Kuyruk karıştırıldı.

source: Index out of range.
ar: الفهرس خارج النطاق.
es: Índice fuera de rango.
tr: Dizin aralık dışında.

# TrackRemoved
source: The track {0} at position {1} was removed.
ar: تمت إزالة المسار {0} في الموضع {1}.
es: La pista {0} en la posición {1} fue eliminada.
tr: {1} konumundaki {0} parçası kaldırıldı.

# LyricsNotFound
source: No lyrics found for {0}.
ar: لا توجد كلمات ل{0}.
es: No se encontró la letra para {0}
tr: Hiçbir şarkı {0} bulundu.

# botgameSummary
source: Sets the game status of the bot.
ar: يحدد حالة لعبة البوت.
es: Establece el estado de juego del bot.
tr: Botun oyun durumunu ayarlar.

# botgameParam1
source: The text to set.
ar: النص المطلوب تعيينه.
es: El texto a establecer.
tr: Ayarlanacak metin.

source: Bot owner only.
ar: مالك بوت فقط.
es: Solo el dueño del bot puede usar esto.
tr: Sadece bot sahibi.

# botstatusSummary
source: Sets the status of the bot.
ar: يحدد حالة البوت.
es: Establece el estado del bot.
tr: Botun durumunu ayarlar.

# botstatusParam1
source: The status to set (0 - 5).
ar: الحالة المطلوب ضبطها (0 - 5).
es: El estado a establecer (0 - 5).
tr: Ayarlanacak durum (0 - 5).

# codeSummary
source: Shows the source code of a command.
ar: يعرض التعليمات البرمجية المصدر للر.
es: Muestra el código fuente de un comando.
tr: Bir komutun kaynak kodunu gösterir.

# codeParam1
source: The command to get its code.
ar: الأمر للحصول على رمزها.
es: El comando a obtener su código.
tr: Kodunu alma komutu.

# botcolorSummary
source: Sets the embed color.
ar: لتعيين لون التضمين.
es: Establece el color de los embeds.
tr: Gömme rengini ayarlar.

# botcolorParam1
source: The new color in hexadecimal or decimal.
ar: اللون الجديد بالنظام الست عشري أو العشري.
es: El nuevo color en hexadecimal o decimal.
tr: Onaltılık veya ondalık olarak yeni renk.

source: Invalid color.
ar: اللون غير صالح.
es: Color inválido.
tr: Geçersiz renk.

# cringeSummary
source: Bro you just posted cringe!
ar: إخوانه قمت بنشره للتو تذلل!
es: Acabas de postear cringe...
tr: Abi az önce yayınladın!

# globalprefixSummary
source: Sets the bot global prefix.
ar: لتعيين البادئة العامة للبوت.
es: Establece el prefijo global del bot.
tr: Bot genel önekini ayarlar.

# globalprefixParam1
source: The new global prefix.
ar: البادئة العالمية الجديدة.
es: El nuevo prefijo global.
tr: Yeni global önek.

# CurrentGlobalPrefix
source: The current global prefix is:
ar: البادئة العالمية الحالية هي:
es: El prefijo global actual es:
tr: Geçerli genel önek:

# PrefixSameCurrentTarget
source: The target prefix and the current prefix are the same.
ar: البادئة الهدف والبادئة الحالية هي نفسها.
es: El prefijo de destino y el prefijo actual son iguales.
tr: Hedef önek ve geçerli önek aynıdır.

# NewGlobalPrefix
source: The new global prefix is: "{0}"
ar: البادئة عالمية جديدة هي: "{0}"
es: El nuevo prefijo global es: "{0}"
tr: Yeni küresel öneki: "{0}"

# inviteSummary
source: Sends the bot invite link.
ar: يرسل رابط دعوة الروبوت.
es: Envía el link de invitación del bot.
tr: Bot davet bağlantısını gönderir.

# prefixSummary
source: Sets the bot prefix.
ar: يضبط بادئة البوت.
es: Establece el prefijo del bot.
tr: Bot önekini ayarlar.

# prefixParam1
source: The new prefix.
ar: البادئة الجديدة.
es: El nuevo prefijo.
tr: Yeni önek.

# CurrentPrefix
source: The current prefix is:
ar: البادئة الحالية هي:
es: El prefijo actual es:
tr: Geçerli önek:

# NewPrefix
source: The new guild prefix is: "{0}"
ar: البادئة النقابة الجديدة هي: "{0}"
es: El nuevo prefijo del servidor es: "{0}"
tr: Yeni lonca öneki: "{0}"

# restartSummary
source: Restarts the bot.
ar: إعادة تشغيل البوت.
es: Reinicia el bot.
tr: Botu yeniden başlatır.

# saySummary
source: Says something.
ar: يقول شيئا.
es: Dice algo.
tr: Bir şeyler söylüyor.

# sayParam1
source: The text to say.
ar: النص ليقول.
es: El texto a decir.
tr: Söylenecek metin.

# uptimeSummary
source: Shows the bot up-time.
ar: يظهر وقت تشغيل البوت.
es: Muestra el tiempo de actividad del bot.
tr: Botun çalışma süresini gösterir.

# languageSummary
source: Sets the bot language.
ar: يضبط لغة البوت.
es: Establece el idioma del bot.
tr: Bot dilini ayarlar.

# NewLanguage
source: The bot language is now: English
ar: اللغة بوت الآن: الإنجليزية ⚠ وجاء هذا ترجمة مع جوجل ترجمة ذلك قد يكون هناك بعض الأخطاء مع النص.
es: El idioma del bot ahora es: Español
tr: Bot dili artık şudur: Türk ⚠ Google, bu çevirmek için kullanıldı Çevir yüzden metin ile bazı hatalar olabilir.

# PaginatorFooter
source: Page {0} of {1}
ar: الصفحة {0} من {1}
es: Página {0} de {1}
tr: Sayfa {0} / {1}

# FailedExecution
source: Failed to execute
ar: فشل في التنفيذ
es: Error al ejecutar
tr: Çalıştırılamadı

# nowplayingSummary
source: Gets the current track in the player.
ar: يحصل على المسار الحالي في المشغل.
es: Obtiene la pista actual en el reproductor.
tr: Oynatıcıdaki geçerli parçayı alır.

# changelogSummary
source: Shows the bot changelog.
ar: يظهر سجل التغيير في برنامج التتبُّع.
es: Muestra el registro de cambios del bot.
tr: Bot değişiklik günlüğünü gösterir.

# TempDisabled
source: Disabled temporarily.
ar: معطل مؤقتا.
es: Deshabilitado temporalmente.
tr: Geçici olarak devre dışı bırakıldı.

# inspirobotSummary
source: Get some inspirational quotes.
ar: احصل على بعض الاقتباسات الملهمة.
es: Obtiene algunas frases inspiradoras.
tr: Bazı ilham verici alıntılar alın.

# PermissionRequired
source: I need the `{0}` permission to execute this command.
ar: أحتاج إلى إذن `{0}` لتنفيذ هذا الأمر.
es: Necesito el permiso `{0}` para ejecutar este comando.
tr: Ben bu komutu çalıştırmak için {0} izni gerekir.

source: Manage Messages
ar: إدارة الرسائل
es: Gestionar mensajes
tr: Mesajları Yönet

source: Connect
ar: الاتصال
es: Conectar
tr: Bağlan

source: Speak
ar: تحدث
es: Hablar
tr: Konuş

# evalSummary
source: Evaluates code.
ar: يقيم رمز .
es: Evalúa código.
tr: Kodu değerlendirir.

# evalParam1
source: The code to evaluate.
ar: رمز التقييم.
es: El código a evaluar.
tr: Değerlendirilecek kod.

# ScreenshotNSFW
source: The screenshot may have NSFW content and it won't be showed. Try using the command on a NSFW channel or use other url.
ar: قد تحتوي لقطة الشاشة على محتوى NSFW ولن يتم عرضها. حاول استخدام الأمر على قناة NSFW أو استخدم عنوان url آخر.
es: La captura de la página puede tener contenido NSFW y no será mostrado. Intenta usar el comando en un canal NSFW o usa otra url.
tr: Ekran görüntüsü NSFW içeriğine sahip olabilir ve gösterilmez. Bir NSFW kanalında komutu kullanmayı veya başka bir URL'yi kullanmayı deneyin.

# BotNotConnected
source: The bot isn't connected to a voice channel.
ar: البوت غير متصل بقناة صوتية.
es: El bot no está conectado a un canal de voz.
tr: Bot bir ses kanalına bağlı değil.

source: Creation canceled.
ar: تم إلغاء الإنشاء.
es: Creación cancelada.
tr: Oluşturma iptal edildi.

# AIDungeonWelcome
source: Welcome to AI Dungeon
ar: مرحبًا بك في AI Dungeon
es: Bienvenido a AI Dungeon
tr: AI Dungeon'a Hoşgeldiniz

# ModeSelect
source: Make sure to read the info and commands with `{0}aid info` before continuing. Select a mode:
ar: تأكد من قراءة المعلومات والأوامر باستخدام `aid info{0}` قبل المتابعة. حدد الوضع:
es: Asegúrate de leer la información y los comandos con `{0}aid info` antes de continuar. Selecciona un modo:
tr: Devam etmeden önce `{0}aid info` ile bilgi ve komutları okuduğunuzdan emin olun. Bir mod seçin:

# CharacterSelect
source: Select a character
ar: حدد شخصية
es: Selecciona un personaje
tr: Bir karakter seçin

source: Attach Files
ar: إرفاق ملفات
es: Adjuntar archivos
tr: Dosyaları ekle

source: Eval results
ar: نتائج التقييم
es: Resultados del Eval
tr: Sonuçları değerlendirin

source: Output
ar: انتاج |
es: Salida
tr: Çıktı

# EvalFooter
source: Executed in {0}ms
ar: تم التنفيذ في غضون {0} مللي ثانية
es: Ejecutado en {0}ms
tr: {0} ms içinde yürütüldü

# EvalNoReturnValue
source: Code executed without any return value.
ar: تم تنفيذ الرمز دون أي قيمة إرجاع.
es: Código ejecutado sin ningún valor de retorno.
tr: Kod herhangi bir dönüş değeri olmadan yürütülür.

# NSFWOnly
source: This command can only be used on a NSFW channel.
ar: لا يمكن استخدام هذا الأمر إلا على قناة NSFW.
es: Este comando solo puede usarse en un canal NSFW.
tr: Bu komut yalnızca bir NSFW kanalında kullanılabilir.

# UserOnWait
source: Wait some seconds before using this command!
ar: انتظر بضع ثوان قبل استخدام هذا الأمر!
es: Espera unos segundos antes de usar este comando!
tr: Bu komutu kullanmadan önce birkaç saniye bekleyin!

# snipeParam1
source: A specific channel to snipe.
ar: قناة محددة للقنص.
es: Un canal en específico a buscar.
tr: Su çulluğu yapmak için belirli bir kana.l

source: ID not found.
ar: المعرف غير موجود.
es: ID no encontrada.
tr: Kimlik bulunamadı.

# IDNotPublic
source: This story ID is not public and you can't use it. Ask the ID owner ({0}) to make it public with `makepublic <ID>`
ar: معرف القصة هذا ليس عامًا ولا يمكنك استخدامه. اطلب من مالك المعرّف ({0}) نشره باستخدام "makepublic <ID>`
es: Esta ID de historia no es pública y no podrás usarla. Pide al dueño de la ID ({0}) que lo haga público con `makepublic <ID>`
tr: Bu hikaye kimliği herkese açık değil ve onu kullanamazsınız. Kimlik sahibinden ({0}) `makepublic <ID>` ile herkese açık hale getirmesini isteyin

# IDOnWait
source: You must wait for the story to be generated before using this ID!
ar: يجب الانتظار حتى يتم إنشاء القصة قبل استخدام هذا المعرّف!
es: Debes esperar que la historia se genere antes de usar esta ID!
tr: Bu kimliği kullanmadan önce hikayenin oluşturulmasını beklemelisiniz!

# GeneratingNewAdventure
source: Generating a new adventure with the mode: **{0}** and the character: **{1}**...
ar: توليد مغامرة جديدة مع الوضع: ** {0} ** والشخصية: ** {1} ** ...
es: Generando una nueva aventura con el modo: **{0}** y el personaje: **{1}**...
tr: Yeni bir macera yaratmak modu ile: ** {0} ** ve karakteri: ** {1} ** ...

source: Custom character creation
ar: إنشاء شخصية مخصصة
es: Creación personalizada de personaje
tr: Özel karakter oluşturma

# CustomCharacterPrompt
source: Enter a text that describes who you are and the first couple sentences of where you start out. This prompt will timeout in 5 minutes.
ar: أدخل نصًا يصف هويتك وأول جملتين من حيث تبدأ. ستنتهي مهلة هذه المطالبة في غضون 5 دقائق.
es: Ingresa un texto que describa quién eres y las primeras dos oraciones de dónde empiezas. Este aviso expirará en 5 minutos.
tr: Kim olduğunuzu ve başladığınız yerin ilk birkaç cümlesini açıklayan bir metin girin. Bu komut istemi 5 dakika içinde zaman aşımına uğrayacaktır.

# GeneratingNewCustomAdventure
source: Generating a new adventure with the custom prompt...
ar: توليد مغامرة جديدة مع موجه مخصص ...
es: Generando una nueva aventura con el texto personalizado...
tr: Özel istemi ile yeni bir macera oluşturuluyor...

source: Generating story...
ar: جارٍ إنشاء قصة ...
es: Generando historia...
tr: Hikaye oluşturuluyor ...

# EditingStoryContext
source: Editing the story context...
ar: تحرير سياق القصة ...
es: Editando el contexto de la historia...
tr: Hikaye bağlamını düzenleme ...

source: The AI will now remember:
ar: سيتذكر الذكاء الاصطناعي الآن:
es: La IA ahora recordará:
tr: AI şimdi hatırlayacak:

# AlteringLastOutput
source: Altering the last output...
ar: تعديل الناتج الأخير ...
es: Alterando la última salida...
tr: Son çıktının değiştirilmesi ...

# ChangedLastOutput
source: Changed the last output to:
ar: تم تغيير الإخراج الأخير إلى:
es: Cambiada la última salida a:
tr: Son çıktı şu şekilde değiştirildi:

# NotIDOwner
source: You are not the owner of this ID.
ar: أنت لست مالك هذا المعرّف.
es: No eres el dueño de esta ID.
tr: Bu kimliğin sahibi değilsiniz.

# IDAlreadyPublic
source: The ID is already public.
ar: المعرّف عام بالفعل.
es: La ID ya es pública.
tr: Kimlik zaten herkese açık.

# IDNowPublic
source: The ID is now public and everyone can use it. You can set it back to private with `makeprivate <ID>`
ar: المعرّف الآن عام ويمكن للجميع استخدامه. يمكنك إعادة تعيينه إلى خاص باستخدام `makeprivate <ID>`
es: La ID ahora es pública y todos pueden usarla. Puedes volver a establecerlo como privado con `makeprivate <ID>`
tr: Kimlik artık herkese açık ve herkes kullanabilir. `Makeprivate <ID>` ile tekrar özel olarak ayarlayabilirsiniz.

# IDAlreadyPrivate
source: The ID is already private.
ar: المعرّف خاص بالفعل.
es: La ID ya es privada.
tr: Kimlik zaten özel.

# IDNowPrivate
source: The ID is now private and and only you can use it. You can set it back to public with `makepublic <ID>`
ar: المعرّف الآن خاص ويمكنك أنت فقط استخدامه. يمكنك إعادة تعيينه إلى "عام" باستخدام "makepublic <ID>`
es: La ID ahora es privada y solo tú puedes usarla. Puedes volver a establecerlo como público con `makepublic <ID>`
tr: Kimlik artık özeldir ve yalnızca siz kullanabilirsiniz. `Makepublic <ID>` ile herkese açık olarak ayarlayabilirsiniz.

# NoIDs
source: {0} doesn't have any adventure IDs.
ar: {0} ليس لديها أي معرفات المغامرة.
es: {0} no tiene ningun(a) ID de aventura.
tr: {0} hiçbir macera kimliğine sahip değil.

# IDList
source: ID list for {0}
ar: قائمة معرفات {0}
es: Lista de IDs para {0}
tr: {0} için kimlik listesi

source: Is public
ar: عامة
es: Es pública
tr: Herkese açık mı

# IDListFooter
source: Use 'idinfo <ID>' to get info about an adventure ID.
ar: استخدام "idinfo <ID> 'للحصول على معلومات حول هوية المغامرة.
es: Usa 'idinfo <ID>' para obtener información de una ID de aventura.
tr: Bir macera kimliği hakkında bilgi almak için 'idinfo <ID>' kullanın.

# IDInfo
source: Adventure ID info
ar: معلومات مغامرة ID
es: Información de la ID de aventura
tr: Macera Kimliği bilgisi
