Repository: d4n3436/Fergun
Catalog: src/strings.*.resx
Languages: ar, es, tr

# UserRequireManageMessages
source: You need the `Manage Messages` permission to use this command.
ar: تحتاج إلى إذن `إدارة الرسائل` لاستخدام هذا الأمر.
es: Necesitas el permiso `Manejar mensajes` para usar este comando.
tr: Bu komutu kullanmak için `` Mesajları Yönet '' iznine ihtiyacınız vardır.

# BotRequireManageMessages
source: I need the `Manage Messages` permission to execute this command.
ar: أحتاج إلى إذن "إدارة الرسائل" لتنفيذ هذا الأمر.
es: Necesito el permiso `Manejar mensajes` para ejecutar este comando.
tr: Bu komutu yürütmek için `` Mesajları Yönet '' iznine ihtiyacım var.

# UserRequireKickMembers
source: You need the `Kick Members` permission to use this command.
ar: تحتاج إلى إذن "Kick Members" لاستخدام هذا الأمر.
es: Necesitas el permiso `Expulsar miembros` para usar este comando.
tr: Bu komutu kullanabilmek için `Kick Members 'iznine ihtiyacınız var.

# BotRequireKickMembers
source: I need the `Kick Members` permission to execute this command.
ar: أحتاج إلى إذن "Kick Members" لتنفيذ هذا الأمر.
es: Necesito el permiso `Expulsar miembros` para ejecutar este comando.
tr: Bu komutu yürütmek için `` Kick Members '' iznine ihtiyacım var.

# UserRequireManageNicknames
source: You need the `Manage Nicknames` permission to use this command.
ar: تحتاج إلى إذن "إدارة الألقاب" لاستخدام هذا الأمر.
es: Necesitas el permiso `Gestionar apodos` para usar este comando.
tr: Bu komutu kullanabilmek için `Takma Adları Yönet 'iznine ihtiyacınız var.

# BotRequireManageNicknames
source: I need the `Manage Nicknames` permission to execute this command.
ar: معرف الرسالة غير صالح. تأكد من أن الرسالة من هذه القناة.
es: ID de mensaje inválido. El mensaje debe ser de este canal.
tr: Geçersiz mesaj kimliği. İletinin bu kanaldan geldiğinden emin olun.

# UserNotLowerHierarchy
source: Specified user must be lower in hierarchy.
ar: يجب أن يكون المستخدم المحدد أقل في التسلسل الهرمي.
es: El/La usuario(a) especificado(a) debe ser inferior en jerarquía.
tr: Belirtilen kullanıcı hiyerarşide daha düşük olmalıdır.

# BotRequireConnect
source: I need the `Connect` permission to join the voice channel.
ar: أحتاج إلى إذن `Connect` للانضمام إلى القناة الصوتية.
es: Necesito el permiso `Conectar` para entrar al canal de voz.
tr: Ses kanalına katılmak için `` Bağlan '' iznine ihtiyacım var.

# BotRequireSpeak
source: I need the `Speak` permission to continue.
ar: أحتاج إلى إذن `Speak` للمتابعة.
es: Necesito el permiso `Hablar` para continuar.
tr: Devam etmek için `` Konuş '' iznine ihtiyacım var.

# MoveSameChannel
source: Move to the voice channel you want me to go.
ar: انتقل إلى القناة الصوتية التي تريد مني نقلها.
es: Ve al canal de voz donde quieres que vaya.
tr: Gitmemi istediğin ses kanalına git.

# ProcessingTime
source: Processing time: {0}ms
ar: وقت المعالجة: {0} مللي ثانية
es: Tiempo de procesado: {0}ms
tr: İşlem süresi: {0} ms

source: OCR Results
ar: نتائج التعرف الضوئي على الحروف
es: Resultados de OCR
tr: OCR Sonuçları

# BotRequireAttachFiles
source: I need the `Attach Files` permission to execute this command.
ar: أحتاج إلى إذن "إرفاق ملفات" لتنفيذ هذا الأمر.
es: Necesito el permiso `Adjuntar archivos` para ejecutar este comando.
tr: Bu komutu yürütmek için `` Dosya Ekle '' iznine ihtiyacım var.

# OcrApiError
source: Error in the OCR API.
ar: خطأ في OCR API.
es: Error en el API de OCR.
tr: OCR API'sında hata.

# forceprefixSummary
source: Force sets the prefix in this guild.
ar: يفرض البادئة على هذه النقابة.
es: Fuerza el prefijo en este servidor.
tr: Force bu guild'deki öneki ayarlar.

# FirstTip
source: Use {0}aid continue <ID> [text] to continue your adventure.
ar: استخدم {0} help Continue <ID> [text] لمتابعة قصتك.
es: Usa {0}aid continue <ID> [texto] para continuar tu aventura.
tr: Maceranıza devam etmek için {0} yardım devam <ID> [metin] kullanın.

# PrefixTooLarge
source: The prefix is too large. The max. prefix length is: {0}.
ar: {البادئة كبيرة جدا. الحد الأقصى. طول البادئة هو: {0.
es: El prefijo es demasiado largo. El tamaño máximo del prefijo es: {0}.
tr: Önek çok büyük. Maks. önek uzunluğu: {0}.

source: Invalid URL.
ar: URL غير صالح.
es: URL inválida.
tr: Geçersiz URL.

# ocrtranslateSummary
source: OCR and translate.
ar: OCR وترجمة.
es: OCR y traducción.
tr: OCR ve tercüme.

# ocrtranslateParam1
source: The target language in ISO code (en, es, br, etc.)
ar: اللغة الهدف في كود ISO (en ، es ، br ، إلخ.)
es: El idioma de destino en el código ISO (en, es, br, etc.)
tr: ISO kodunda hedef dil (en, es, br, vb.)

# ocrtranslateParam2
source: The url of an image to use.
ar: عنوان URL للصورة المراد استخدامها.
es: La url de una imagen a usar.
tr: Kullanılacak bir resmin URL'si.

source: Input
ar: إدخال
es: Entrada
tr: Giriş

source: Role not found.
ar: الدور غير موجود.
es: Rol no encontrado.
tr: Rol bulunamadı.

source: Role info
ar: معلومات الدور
es: Información de rol
tr: Rol bilgileri

source: Color
ar: اللون
tr: Renk

source: Is mentionable
ar: هل يذكر
es: Es mencionable
tr: Kayda değer

source: Permissions
ar: أذونات
es: Permisos
tr: İzinler

source: Member count
ar: عدد الأعضاء
es: Cantidad de miembros
tr: Üye Sayısı

source: Mention
ar: أشير
es: Mención
tr: Anma

# roleinfoSummary
source: Gets information about a role.
ar: يحصل على معلومات حول دور.
es: Obtiene información sobre un rol.
tr: Bir rol hakkında bilgi alır.

# roleinfoParam1
source: The role to get info from (it isn't necessary to mention it).
ar: دور الحصول على معلومات من (ليس من الضروري ذكرها).
es: El rol a obtener información (no es necesario mencionarlo).
tr: Bilgi alma rolü (bundan bahsetmek gerekli değildir).

# logoutSummary
source: Disconnects the bot.
ar: يفصل البوت.
es: Desconecta el bot.
tr: Botu ayırır.

# nothingSummary
source: The best command.
ar: أفضل أمر.
es: El mejor comando.
tr: En iyi komut.

# someoneSummary
source: Returns a random user.
ar: إرجاع مستخدم عشوائي.
es: Retorna un usuario aleatorio.
tr: Rasgele bir kullanıcı döndürür.

source: Active clients
ar: عملاء نشيطون
es: Clientes activos
tr: Aktif müşteriler

source: Low
ar: منخفض
es: Bajo
tr: Düşük

source: Medium
ar: متوسط
es: Medio
tr: Orta

source: High
ar: عالي
es: Alto
tr: Yüksek

source: Extreme
ar: أقصى
es: Extremo
tr: Aşırı

source: Is hoisted
ar: يرفع
es: Es un rol separado
tr: Kaldırıldı

source: Position
ar: موضع
es: Posición
tr: Durum

# ServerFeatures
source: Features
ar: ميزات
es: Mejoras
tr: Özellikleri

# BoostTier
source: Nitro Boost Tier
ar: طبقة Nitro Boost
es: Nivel de mejora
tr: Nitro Boost Seviyesi

# BoostCount
source: Nitro Boost Count
ar: عد دفعة نيترو
es: Cantidad de mejoras
tr: Nitro Boost Sayısı

# SeekTimeHigherOrEqual
source: The time to go ({0}) cannot be higher or equal than the track's length ({1}).
ar: لا يمكن أن يكون الوقت المستغرق ({0}) أعلى أو مساويًا لطول المسار ({1})
es: El tiempo a ir ({0}) no puede ser mayor o igual que la longitud de la pista ({1}).
tr: Gitme süresi ({0}) parçanın uzunluğundan ({1}) daha yüksek veya eşit olamaz

# SeekTimeComplete
source: Skipped to {0} of {1}
ar: تم التخطي إلى {0} من {1}
es: Saltado a {0} de {1}
tr: {1} / {0} 'a atlandı

# SeekInvalidFormat
source: You must pass an integer or a string with the format `m:ss`, `mm:ss`, `h:mm:ss` or `hh:mm:ss`.
ar: يجب عليك تمرير عدد صحيح أو سلسلة بالتنسيق `m: ss` أو` mm: ss` أو `h: mm: ss` أو` hh: mm: ss`.
es: Debes pasar un número o un texto con el formato `m:ss`, `mm:ss`, `h:mm:ss` o `hh:mm:ss`.
tr: `M: ss`,` mm: ss`, `h: mm: ss` veya` ss: dd: ss` biçiminde bir tam sayı veya dize iletmeniz gerekir.

# Ratelimited
source: Wait {0} seconds before using this command again!
ar: انتظر {0} ثانية قبل استخدام هذا الأمر مرة أخرى!
es: Espera {0} segundos antes de volver a usar este comando!
tr: Bu komutu tekrar kullanmadan önce {0} saniye bekleyin!

source: Object not found.
ar: المفعول به غير موجود.
es: El objeto no fue encontrado.
tr: Nesne bulunamadı.

# MultipleMatches
source: Multiple matches found.
ar: تم العثور على تطابقات متعددة.
es: Se encontraron múltiples coincidencias.
tr: Birden fazla eşleşme bulundu.

source: Roles
ar: الأدوار
tr: Roller

source: Boosting since
ar: تعزيز منذ ذلك الحين
es: Mejorando desde
tr: O zamandan beri artıyor

# AlreadyConnected
source: The bot is already connected to a voice channel.
ar: البوت متصل بالفعل بقناة صوتية.
es: El bot ya está conectado a un canal de voz.
tr: Bot zaten bir ses kanalına bağlı.

source: Invalid file type.
ar: نوع الملف غير صالح.
es: Tipo de archivo invalido.
tr: Geçersiz dosya türü.

source: Owner commands
ar: أوامر المالك
es: Comandos del dueño
tr: Sahip komutları

# Vote
source: You can vote for me [here]({0}). Thank you.
ar: يمكنك التصويت بالنسبة لي [هنا] ({0}). شكرا لك.
es: Puedes votar por mi [aquí]({0}). Gracias.
tr: Bana oy verebilirsiniz [burada] ({0}). Teşekkür ederim.

# voteSummary
source: Shows an embed with the vote link.
ar: يظهر على تضمين مع رابط التصويت.
es: Muestra un embed con el link de votación.
tr: Oylama bağlantısı içeren bir yerleştirme gösterir.

source: Total servers
ar: مجموع خوادم
es: Servidores totales
tr: Toplam sunucu

source: Total users
ar: عدد الأعضاء
es: Usuarios totales
tr: Toplam kullanıcı

# ContactInfo
source: If you have any bug report, question or suggestion, you can join the [support server]({0}) or contact me via direct message ({1}).
ar: إذا كان لديك أي تقرير خطأ أو سؤال أو اقتراح ، يمكنك الانضمام إلى [خادم الدعم] ({0}) أو الاتصال بي عبر رسالة مباشرة ({1}).
es: Si tienes algún reporte de bug, pregunta o sugerencia, puedes entrar al [servidor de soporte]({0}) o contactarme vía mensaje directo ({1}).
tr: Herhangi bir hata raporunuz, sorunuz veya öneriniz varsa, [destek sunucusuna] ({0}) katılabilir veya doğrudan mesaj ({1}) aracılığıyla benimle iletişime geçebilirsiniz.

source: Redoing last action...
ar: الإعادة الإجراء الأخير ...
es: Rehaciendo la última acción...
tr: Son işlem yeniden yapılıyor ...

# SelfNoIDs
source: You don't have any adventure IDs. You can use the `new` command to create a new adventure.
ar: لم يكن لديك أي معرفات المغامرة. يمكنك استخدام قيادة new لخلق مغامرة جديدة.
es: No tienes ninguna ID de aventura. Puedes usar el comando `new` para crear una nueva aventura.
tr: Hiç macera kimliğiniz yok. Yeni bir macera oluşturmak için `new` komutunu kullanabilirsiniz.

# QueueExcess
source: ..and {0} more tracks!
ar: .. و {0} أكثر المسارات!
es: ..y {0} pistas mas!
tr: ..ve {0} parça daha!

# Changelog1.1
source: - Remade the AI Dungeon module and API wrapper 2 times because of constant changes in the API. - New commands (`vote`, `report`, `bash`, `channelinfo`) - The owner commands now has its own module. - Now the commands' cooldown time is displayed. - Now the bot is hosted on a VPS. - Limited the music queue to 10 tracks. - `seek` now allows a time with the format `mm:ss` or `hh:mm:ss` like 30:45 or 6:23:12. - Fixed a bug that caused the bot to disconnect from a voice channel when Discord requested a reconnection. - Fixed a bug in `wikipedia` that returned error 404 when an article was not found in the current language of the bot. ...and more bug fixes.
ar: - مجدد وحدة AI الأبراج وAPI المجمع 2 مرات بسبب التغييرات المستمرة في API. - أوامر جديدة ( vote، report، bash، channelinfo) - أوامر المالك لديه الآن وحدة خاصة بها. - والآن يتم عرض الوقت تباطوء الأوامر. - يتم استضافتها الآن بوت على VPS. - محدودية قائمة الانتظار الموسيقى إلى 10 المسارات. - seek الآن يسمح الوقت مع شكل مم: ss أو HH: MM: ss مثل 30:45 أو 06:23:12. - إصلاح الخلل الذي تسبب في بوت لقطع من قناة صوت عندما طلب الخلاف لإعادة الاتصال. - إصلاح الخلل في wikipedia أن عاد خطأ 404 عندما لم يتم العثور على مقال باللغة الحالية للبوت. ... والمزيد من الاصلاحات.
es: - Se rehizo el módulo AI Dungeon y el wrapper de la API 2 veces debido a los constantes cambios en la API. - Nuevos comandos (`vote`, `report`, `bash`, `channelinfo`) - Los comandos del dueño ahora tienen su propio módulo. - Ahora se muestra el tiempo de cooldown de los comandos. - Ahora el bot esta alojado en un VPS. - Actualizado Discord.Net a la rama de desarrollo. - Se limitó la cola de música a 10 pistas. - `seek` ahora permite un tiempo con el formato` mm: ss` o `hh: mm: ss` como 30:45 o 6:23:12. - Se corrigió un error que causaba que el bot se desconectara de un canal de voz cuando Discord solicita una reconexión. - Se corrigió un error en `wikipedia` que devolvía el error 404 cuando no se encontraba un artículo en el idioma actual del bot. ...y más correcciones de errores.
tr: - API'daki sürekli değişiklikler nedeniyle AI Dungeon modülünü ve API sarıcısını 2 kez yeniden yapın. - Yeni komutlar ("oy", "rapor", "bash", "kanal bilgisi") - Sahip komutlarının artık kendi modülü var. - Şimdi komutların bekleme süresi görüntülenir. - Şimdi bot bir VPS'de barındırılıyor. - Müzik sırasını 10 parça ile sınırlandırın. - "seek" artık "mm: ss" veya "ss: dd: ss" biçiminde 30:45 veya 6:23:12 biçiminde bir zaman tanır. - Discord yeniden bağlantı istediğinde botun bir ses kanalıyla bağlantısının kesilmesine neden olan bir hata düzeltildi. - Wikipedia'da botun geçerli dilinde bir makale bulunmadığında 404 hatasını döndüren bir hata düzeltildi. ... ve daha fazla hata düzeltmesi.

# ErrorHelp
source: If this keep happening please report this error in the [support server]({0}) or open an issue in the [GitHub repository]({1}) describing the error and the steps to reproduce it.
ar: في حالة استمرار حدوث ذلك ، يرجى الإبلاغ عن هذا الخطأ في [خادم الدعم]({0}) أو فتح مشكلة في [مستودع GitHub]({1}) تصف الخطأ وخطوات إعادة إنتاجه.
es: Si esto sigue sucediendo, reporte este error en el [servidor de soporte]({0}) o abra un issue (propuesta) en el [repositorio de GitHub]({1}) describiendo el error y los pasos para reproducirlo.
tr: Bu devam ederse lütfen bu hatayı [destek sunucusunda]({0}) bildirin veya [GitHub deposunda]({1}) hatayı ve hatayı yeniden oluşturma adımlarını açıklayan bir sorunu açın.

# bashSummary
source: Runs a bash command.
ar: يدير أمر باش.
es: Ejecuta un comando de bash.
tr: Bir bash komutu çalıştırır.

# supportSummary
source: Shows the support info.
ar: يظهر معلومات الدعم.
es: Muestra la información de soporte.
tr: destek bilgisi gösterir.

# ErrorInAPI
source: An error occurred while calling the API.
ar: حدث خطأ أثناء استدعاء API.
es: Ocurrió un error mientras se llamaba a la API.
tr: API çağrılırken bir hata oluştu.

source: Topic
ar: موضوع
es: Tema
tr: konu

source: Is NSFW
ar: غير NSFW
es: Es NSFW
tr: NSFW mı

source: Slow mode
ar: وضع بطيء
es: Modo pausado
tr: Yavaş mod

source: Channel Info
ar: معلومات القناة
es: Información del canal
tr: Kanal Bilgisi

# channelinfoSummary
source: Shows info about a channel.
ar: يظهر من المعلومات حول القناة.
es: Muestra información acerca de un canal.
tr: Bir kanal hakkında bilgi gösterir.

# OcrtrResults
source: OCR and translation results
ar: OCR ونتائج الترجمة
es: Resultados de OCR y traducción
tr: OCR ve çeviri sonuçları

# NoChoices
source: You need to pass at least 1 choice.
ar: تحتاج إلى تمرير لا يقل عن 1 الاختيار.
es: Debes pasar al menos una opción.
tr: En az 1 seçenek geçmeniz gerekiyor.

source: Channel not found.
ar: قناة غير موجود.
es: Canal no encontrado.
tr: Kanal bulunamadı.

# channelinfoParam1
source: The channel to get info from.
ar: القناة للحصول على معلومات من.
es: El canal a obtener la información.
tr: Bilgi alacağınız kanal.

# UserRequireManageServer
source: You need the `Manage Server` permission to use this command.
ar: كنت في حاجة إلى إدارة Server إذن لاستخدام هذا الأمر.
es: Necesitas el permiso `Gestionar servidor` para usar este comando.
tr: Bu komutu kullanmak için `` Sunucuyu Yönet '' iznine ihtiyacınız vardır.

# badtranslatorSummary
source: Passes a text through a bad translator.
ar: يمر النص من خلال مترجم سيئة.
es: Pasa un texto a través de un traductor malo.
tr: Metni kötü bir çevirmenden geçirir.

# badtranslatorParam1
source: The text to use.
ar: النص للاستخدام.
es: El texto a usar.
tr: Kullanılacak metin.

source: Language chain
ar: سلسلة لغة
es: Cadena de idiomas
tr: Dil zinciri

# VersionNotFound
source: Version not found. The versions are: {0}
ar: نسخة غير موجود. الإصدارات هي: {0}
es: Versión no encontrada. Las versiones son: {0}
tr: Sürüm bulunamadı. Sürümler: {0}

# OtherVersions
source: Other versions: {0}
ar: إصدارات أخرى: {0}
es: Otras versiones: {0}
tr: Diğer sürümler: {0}

# Changelog1.1.5
source: - New command: `badtranslator` - Added the option to select a track before playing in `play` (disabled by default, you can enable it in `config`). - `img` is back and it now uses DuckDuckGo image search. - `changelog` now lets you pass a specific version so it doesn't display all the version changes at once. - `serverinfo` now shows the server animated icon, if there's one. - Edited the permission requirements for `config`, `prefix` and `language`. - Cleanup in the config and server classes.
ar: - الأمر جديد: `badtranslator` - إضافة خيار لتحديد المسار قبل أن يلعب في `play ` (تعطيل افتراضيا، يمكنك تمكينه في config). - `img` عاد وانها الآن يستخدم البحث عن الصور دك دك غو. - `changelog` يتيح الآن يمكنك تمرير صيغة محددة لذلك لا يعرض كل التغييرات الإصدار في وقت واحد. - `serverinfo` الآن يظهر رمز الخادم الرسوم المتحركة، وإذا كان هناك واحد. - قام متطلبات إذن ل`config`، `prefix` و`language`. - تنظيف في الطبقات التكوين والخادم.
es: - Nuevo comando: `badtranslator` - Se ha añadido la opción de seleccionar una pista antes de reproducir en `play` (desactivado por defecto, puedes activarlo en `config`). - `img` está de vuelta y ahora utiliza DuckDuckGo para la búsqueda de imágenes. - `changelog` ahora te permite pasar una versión específica por lo que no muestra todos los cambios de versión a la vez. - `serverinfo` ahora muestra el icono del servidor animado, si hay uno. - Editado los requisitos de permisos para `config`, `prefix` y `language`. - Limpieza en las clases de configuración y servidor.
tr: - Yeni komut: `badtranslator` - `` play`` içinde çalmadan önce bir parça seçme seçeneği eklendi (varsayılan olarak devre dışı, `config 'içinde etkinleştirebilirsiniz). - `img` geri döndü ve şimdi DuckDuckGo resim aramasını kullanıyor. - `changelog` artık belirli bir sürümü geçirmenize izin veriyor, böylece tüm sürüm değişikliklerini aynı anda göstermiyor. - `serverinfo` artık sunucu animasyonlu simgesini gösteriyorsa. - "config", "önek" ve "dil" izin izinlerini düzenledi. - Yapılandırma ve sunucu sınıflarında temizleme.

# changelogParam1
source: A specific version to view.
ar: نسخة محددة للعرض.
es: Una versión específica a ver.
tr: Görüntülemek için belirli bir sürüm.

# DeletedMessages
source: Deleted {0} messages.
ar: حذف {0} رسائل.
es: Eliminado {0} mensajes.
tr: {0} mesaj silindi.

# DeletedMessagesByUser
source: Deleted {0} messages by {1}.
ar: حذف {0} رسائل كتبها {1}.
es: Eliminado {0} mensajes por {1}.
tr: {1} tarafından {0} mesaj silindi.

# calcSummary
source: Evaluates a math expression.
ar: يقيم التعبير الرياضيات.
es: Evalúa una expresion matemática.
tr: Matematik ifadesini değerlendirir.

# calcParam1
source: The expression to evaluate.
ar: التعبير لتقييم.
es: La expresión a evaluar.
tr: Değerlendirilecek ifade.

source: Invalid expression.
ar: التعبير صالح.
es: Expresión inválida.
tr: Geçersiz ifade.

source: Calc results
ar: النتائج احسب
es: Resultados de calc
tr: Kireç sonuçları

# LoopUpdated
source: The player was updated to repeat the track {0} times. Use this command without parameters to disable the track looping.
ar: تم تحديث لاعب لتكرار المسار {0} مرات. استخدام هذا الأمر بدون معلمات لتعطيل حلقات المسار.
es: El reproductor fue actualizado para repetir la pista {0} veces. Usa este comando sin parámetros para deshabilitar la repetición de pistas.
tr: Müzikçalar parçayı {0} kez tekrarlayacak şekilde güncellendi. İz döngüsünü devre dışı bırakmak için parametre olmadan bu komutu kullanın.

# LoopNoValuePassed
source: Pass the number of times you want to repeat the track, ex: `{0}loop 5`
ar: تمرير عدد من مرة تريد تكرار المسار، مثلا: `{0}loop 5`
es: Pasa el número de veces que quieres repetir la pista, ej: `{0}loop 5`
tr: Parçayı tekrarlamak istediğiniz sayıyı girin, örn: "{0}loop 5`

# NowLooping
source: The current track will now be repeated {0} times. To disable the loop, use this command without parameters.
ar: سيتم تكرار المسار الحالي الآن {0} مرة. لتعطيل الحلقة ، استخدم هذا الأمر بدون معلمات.
es: Ahora la pista actual se repetirá {0} veces. Para desactivar la repetición, usa este comando sin pasar ningún parámetro.
tr: Geçerli parça şimdi {0} kez tekrarlanacaktır. Döngüyü devre dışı bırakmak için bu komutu parametre kullanmadan kullanın.

# LoopEnded
source: The looping for the track: {0} has ended.
ar: انتهت {0}: في حلقات لمسار.
es: La repetición para la pista: {0} ha terminado.
tr: {0} parçasının döngüsü sona erdi.

# loopSummary
source: Repeats the current track a number of times.
ar: يكرر الحالية تتبع عددا من المرات.
es: Repite la pista en reproducción un número de veces.
tr: Geçerli parçayı birkaç kez tekrarlar.

# loopParam1
source: The number of times to repeat the track.
ar: عدد مرات تكرار المسار.
es: El número de veces a repetir la pista.
tr: Parçayı tekrarlama sayısı.

# LoopDisabled
source: The track looping has been disabled.
ar: تم تعطيل حلقات المسار.
es: La repetición de la pista fue deshabilitada.
tr: İz döngüsü devre dışı bırakıldı.

# LyricsQueryNotPassed
source: You need to play a track or pass a track name.
ar: تحتاج إلى تشغيل مسار أو تمرير نام المسار
es: Debes reproducir una pista con el bot o pasar el nombre de una pista.
tr: Bir parça çalmanız veya bir parça adı geçmeniz gerekiyor.

source: Lyrics by Genius
ar: كلمات عبقرية
es: Letra por Genius
tr: Şarkı sözleri Genius

# PaginatorHelp
source: This is a paginator. React with the respective icons to change page.
ar: هذا هو paginator. يتفاعل مع الرموز المعنية لصفحة تغيير
es: Esto es un paginador. Reacciona a los íconos respectivos para cambiar la página.
tr: Bu bir sayfa gösterici. Sayfayı değiştirmek için ilgili simgelerle reaksiyona geçin.

source: Artist Page
ar: صفحة الفنان
es: Página del artista
tr: Sanatçı Sayfası

# AdventureDeletionPrompt
source: Press the button/emoji below to delete the adventure.
ar: الرد على الرموز التعبيرية أدناه لحذف المغامرة.
es: Presiona el botón debajo para eliminar la aventura.
tr: Macerayı silmek için aşağıdaki düğmeye basın.

# ReactTimeout
source: You did not react before the timeout!
ar: أنت لم تتفاعل قبل المهلة!
es: No reaccionaste antes del límite de tiempo!
tr: Zaman aşımından önce tepki göstermediniz!

source: Language Selection
ar: اختيار اللغة
es: Selección de idioma
tr: Dil seçimi

# LanguagePrompt
source: Select the language you want to set.
ar: الرد على اللغة التي تريد تعيين.
es: Selecciona el idioma que quieres establecer.
tr: Ayarlamak istediğiniz dili seçin.

# lyricsRemarks
source: Use `-headers` at the end of the command to keep the tags (`[info]`).
ar: استخدام -headers في نهاية الأمر للحفاظ على العلامات ( [المعلومات] ).
es: Usa `-headers` al final del comando para mantener los tags (`[info]`).
tr: Etiketleri korumak için komutun sonunda `-headers` kullanın (` [info] `).
