Repository: d4n3436/Fergun
Catalog: src/Fergun/strings.*.resx
Languages: ru

# cmdstatsSummary
source: Shows the command stats.
ru: Показывает статистику команд.

# Changelog1.3.6
source: - New command: `cmdstats`. - Now the `first` and `last` paginator buttons in `img` and `urban` will only appear when there are 3 or more pages, and the `jump` button when there are 4 or more pages. - Now Fergun will send a direct message to warn an user when the bot doesn't have the minimun required permissions in the current channel (`SendMessages` and `EmbedLinks`). - Now Fergun supports multiple user activities, this is useful in `userinfo` and `lyrics` (when the Spotify activity is hidden by the custom status). - Added ratelimit and required permissions info in the command help. - Fixed a bug in `wikipedia` that caused the command to fail because the query was not encoded in some cases. - Fixed a bug in `screenshot` that caused the command to fail because the url was encoded by error. - Fixed a bug in the AI Dungeon module that caused the commands to fail when different IDs were used at the same time.
ru: - Новая команда: `cmdstats`. - Теперь кнопки нумерации `first` и `last` в `img` и `urban` будут появляться только при наличии 3 или более страниц, а кнопка `jump` - при наличии 4 или более страниц. - Теперь Fergun будет отправлять прямое сообщение, чтобы предупредить пользователя, когда у бота нет минимально необходимых разрешений в текущем канале (`SendMessages` и `EmbedLinks`). - Теперь Fergun поддерживает несколько пользовательских действий, это полезно в `userinfo` и` lyrics` (когда активность Spotify скрыта под пользовательским статусом). - Добавлена скорость и информация о необходимых разрешениях в справке команды. - Исправлена ошибка в `wikipedia`, из-за которой команда не выполнялась, поскольку в некоторых случаях запрос не был закодирован. - Исправлена ошибка в `screenshot`, которая приводила к сбою команды, поскольку URL был закодирован по ошибке. - Исправлена ошибка в модуле AI Dungeon, которая приводила к сбою команд при одновременном использовании разных идентификаторов.

# CommandStatsInfo
source: Command stats (since 02/21/2020)
ru: Команда Статистика (с 02/21/2020)

# lmgtfySummary
source: Let me Google that for you.
ru: Позвольте мне Google, что для Вас.

# lmgtfyParam1
source: The keyword(s) to search.
ru: Ключевое слово (а) для поиска.

# pasteSummary
source: Uploads text to Hastebin.
ru: Закачивает текст Hastebin.

# pasteParam1
source: The text to upload.
ru: Текст для загрузки.

source: Uploading...
ru: Загрузка...

# bigsnipeSummary
source: Shows the last deleted messages in the current channel or the specified.
ru: Показывает последние удаленные сообщения в текущем канале или указанный.

# bigsnipeParam1
source: A specific channel to snipe.
ru: Конкретный канал бекас.

# MinutesAgo
source: {0} minutes ago
ru: {0} минут назад

source: Attachment
ru: прикрепление

# bigeditsnipeSummary
source: Shows the last edited messages in the current channel or the specified.
ru: Показывает последние отредактированные сообщения в текущем канале или указанный.

# bigeditsnipeParam1
source: A specific channel to snipe.
ru: Конкретный канал бекас.

source: Text Channel
ru: Текст канал

source: Announcement Channel
ru: Объявление канала

source: Voice Channel
ru: речевой канал

source: User Limit
ru: Лимит пользователя

source: No Limit
ru: Нет ограничений

# disableSummary
source: Disables a command locally (for this server).
ru: Отключает команду локально (для этого сервера).

# disableParam1
source: The name of the command to disable.
ru: Имя команды, чтобы отключить.

# NonDisableable
source: {0} can't be disabled!
ru: {0} не может быть отключена!

# AlreadyDisabled
source: {0} is already disabled!
ru: {0} уже отключена!

# CommandDisabled
source: The command {0} has been disabled in this server.
ru: Команда {0} была отключена в этом сервере.

# enableSummary
source: Enables a command locally (for this server).
ru: Включает команду локально (для этого сервера).

# enableParam1
source: The name of the command to enable.
ru: Имя команды, чтобы включить.

# AlreadyEnabled
source: {0} is already enabled!
ru: {0} уже включен!

# CommandEnabled
source: The command {0} has been enabled in this server.
ru: Команда {0} была включена в этом сервере.$$

# globaldisableSummary
source: Disables a command globally (in all servers).
ru: Отключение команды глобально (на всех серверах).$$

# globaldisableParam1
source: The name of the command to disable globally.
ru: Имя команды, чтобы отключить глобально.

# globaldisableParam2
source: The reason to use.
ru: Причина использования.

# AlreadyDisabledGlobally
source: {0} is already disabled globally!
ru: {0} уже отключена во всем мире!

# CommandDisabledGlobally
source: The command {0} has been disabled in all servers.
ru: Команда {0} была отключена на всех серверах.

# globalenableSummary
source: Enables a command globally (in all servers).
ru: Включает команду глобально (на всех серверах).

# globalenableParam1
source: The name of the command to enable globally.
ru: Имя команды, чтобы включить в глобальном масштабе.

# AlreadyEnabledGlobally
source: {0} is already enabled globally!
ru: {0} уже включена в глобальном масштабе!

# CommandEnabledGlobally
source: The command {0} has been enabled in all servers.
ru: Команда {0} была включена во всех серверах.

source: Reason
ru: причина

# LeftVCInactivity
source: I have left the voice channel due to inactivity.
ru: Я оставил голосовой канал из-за неактивности.

# MusicPlayerShutdownWarning
source: Fergun will be restarted/turned off in some seconds and your music player will be shut down. Sorry for the inconvenience.
ru: Fergun будет перезапущена / выключена через несколько секунд, и ваш музыкальный проигрыватель будет закрыт. Приносим извинения за неудобства.

source: Warning
ru: Предупреждение

# PublicIdNull
source: The public ID of this adventure is null. Please create a new adventure.
ru: Общественность ID этой авантюры является недействительным. Пожалуйста, создайте новое приключение.

# Changelog1.4
source: - New commands: `bigsnipe`, `bigeditsnipe`, `lmgtfy`, `paste`, `enable`, `disable`, `globalenable` and `globaldisable`. - Now when Fergun joins a server and that server has a preferred locale, that locale will be saved to the Fergun configuration for that server. - Now when Fergun leaves a server, that server config will be deleted from the database. - Now Fergun will leave a voice channel when all the users leave that channel. - Now Fergun will send a warning to all servers that has a music player before restarting/shutting down. - Now the commands that uses Hastebin and the upload fails its content will be showed in the message, but cut down. - Added support to disable commands at guild level. - Added support to voice channels, category channels and DM channels in `channelinfo`. - Added support to deleted attachments in `snipe` (`bigsnipe` comes with this feature on release). - Updated the `lyrics` scraper and fixed the cut text bug. - Updated the AI Dungeon module and API wrapper. - Fixed a bug that caused some moderation commands to fail because the user hierarchy was calculated incorrectly.
ru: - Новые команды: `bigsnipe`, `bigeditsnipe`, `lmgtfy`, `paste`, `enable`, `disable`, `globalenable`} и `globaldisable`. - Теперь, когда Fergun присоединяется к серверу и у этого сервера есть предпочтительный языковой стандарт, этот языковой стандарт будет сохранен в конфигурации Fergun для этого сервера. - Теперь, когда Фергун покидает сервер, эта конфигурация сервера будет удалена из базы данных. - Теперь Фергун выйдет из голосового канала, когда все пользователи покинут этот канал. - Теперь Fergun будет отправлять предупреждение всем серверам, на которых есть музыкальный проигрыватель, перед перезапуском / выключением. - Теперь команды, использующие Hastebin и не загружающие его содержимое, будут отображаться в сообщении, но урезаны. - Добавлена ​​поддержка отключения команд на уровне гильдии. - Добавлена ​​поддержка голосовых каналов, каналов категорий и каналов DM в `channelinfo`. - Добавлена ​​поддержка удаленных вложений в `snipe` (bigsnipe` поставляется с этой функцией в выпуске). - Обновлен скребок `lyrics` и исправлена ​​ошибка вырезания текста. - Обновлены модуль AI Dungeon и оболочка API. - Исправлена ​​ошибка, из-за которой некоторые команды модерации не выполнялись из-за неправильного расчета иерархии пользователей.
