Repository: d4n3436/Fergun
Catalog: src/Fergun/strings.*.resx
Languages: ru

# UserOnWait
source: Wait some seconds before using this command!
ru: Подождите несколько секунд, прежде чем использовать эту команду!

# snipeParam1
source: A specific channel to snipe.
ru: Конкретный канал, чтобы стрелять.

source: ID not found.
ru: Идентификатор не найден.

# IDNotPublic
source: This story ID is not public and you can't use it. Ask the ID owner ({0}) to make it public with `makepublic <ID>`
ru: Этот идентификатор истории не является общедоступным, и вы не можете его использовать. Попросите владельца идентификатора ({0}) сделать его общедоступным с помощью `makepublic <ID>`

# IDOnWait
source: You must wait for the story to be generated before using this ID!
ru: Вы должны дождаться генерации истории, прежде чем использовать этот идентификатор!

# GeneratingNewAdventure
source: Generating a new adventure with the mode: **{0}** and the character: **{1}**...
ru: Генерация нового приключения в режиме: ** {0} ** и персонаж: ** {1} ** ...

# CustomChararacterCreation
source: Custom character creation
ru: Создание собственного персонажа

# CustomCharacterPrompt
source: Enter a text that describes who you are and the first couple sentences of where you start out. The prompt will timeout in 5 minutes and the max. number of characters is 140.
ru: Введите текст, который описывает, кто вы есть, и первые пару предложений, с которых вы начинаете. Подсказка будет отключена через 5 минут и макс. количество символов 140

# GeneratingNewCustomAdventure
source: Generating a new adventure with the custom prompt...
ru: Создание нового приключения с пользовательской строкой...

source: Generating story...
ru: Генерация истории ...

# EditingStoryContext
source: Editing the story context...
ru: Редактирование контекста истории ...

source: The AI will now remember:
ru: ИИ теперь запомнит:

# AlteringLastOutput
source: Altering the last output...
ru: Изменение последнего вывода ...

# ChangedLastOutput
source: Changed the last output to:
ru: Изменен последний вывод на:

# NotIDOwner
source: You are not the owner of this ID.
ru: Вы не являетесь владельцем этого идентификатора.

# IDAlreadyPublic
source: The ID is already public.
ru: Идентификатор уже открыт.

# IDNowPublic
source: The ID is now public and everyone can use it. You can set it back to private with `makeprivate <ID>`
ru: Идентификатор теперь общедоступен, и каждый может его использовать. Вы можете установить его обратно в приватное состояние с помощью `makeprivate <ID>`

# IDAlreadyPrivate
source: The ID is already private.
ru: Идентификатор уже закрыт.

# IDNowPrivate
source: The ID is now private and and only you can use it. You can set it back to public with `makepublic <ID>`
ru: Идентификатор теперь является частным, и только вы можете использовать его. Вы можете установить его обратно в public с помощью `makepublic <ID>`

# NoIDs
source: {0} doesn't have any adventure IDs.
ru: {0} не имеет идентификаторов приключений.

# IDList
source: ID list for {0}
ru: Список идентификаторов для {0}

source: Is public
ru: Является публичным

# IDListFooter
source: Use 'idinfo <ID>' to get info about an adventure ID.
ru: Используйте 'idinfo <ID>', чтобы получить информацию об идентификаторе приключения.

# IDInfo
source: Adventure ID info
ru: Информация об идентификаторе приключения

# AboutAIDText
source: AI Dungeon is a first of its kind AI generated text adventure. Using a 1.5B parameter machine learning model called GPT-2, AI Dungeon generates the story and results of your actions as you play in this virtual world. Unlike virtually every other game in existence, you are not limited by the imagination of the developer in what you can do. Any thing you can express in language can be your action and the AI dungeon master will decide how the world responds to your actions.
ru: AI Dungeon - первое в своем роде текстовое приключение, созданное AI. Используя модель машинного обучения с параметром 1,5B под названием GPT-2, AI Dungeon генерирует историю и результаты ваших действий во время игры в этом виртуальном мире. В отличие от практически всех существующих игр, вы не ограничены воображением разработчика в том, что вы можете сделать. Любая вещь, которую вы можете выразить на языке, может быть вашим действием, и мастер искусственного интеллекта будет решать, как мир реагирует на ваши действия.

# AIDHowToPlayText
source: The rules of AI Dungeon are simple: 1. The game puts "You " to the front of each action so every action should start with a verb. Ex. "attack the dragon", "summon a sandwich" etc... 2. As an exception to the above: If you put your action in quotes Ex. "Will you join me on my quest ? " then the game will add "You say " to the front of it.
ru: Правила AI Dungeon просты: 1. Игра ставит «Вы» впереди каждого действия, поэтому каждое действие должно начинаться с глагола. Ex. «напасть на дракона», «вызвать сэндвич» и т. д. 2. В качестве исключения из вышеперечисленного: если вы поместите свое действие в кавычки. «Вы присоединитесь ко мне в моем квесте?», Тогда игра добавит «Вы говорите» в начале.

# AboutAIDTitle
source: About AI Dungeon
ru: Об AI Dungeon

# AIDHowToPlayTitle
source: How to play
ru: Как играть

source: Commands
ru: команды

# AIDTips
source: Try using new words often, the AI gets more creative with variety. Remember to start a "do" input with a verb, ex: Attack the orc. Use the undo button to delete your last input along with the AI's response. Long sentences for actions are no problem! Get creative! Want more story to generate? Use the continue command without any text. Try using new words often, the AI gets more creative with variety. Use the remember command to edit the story context that the AI always remembers. You can use Say before the text to talk.
ru: Попробуйте использовать новые слова часто, ИИ становится более креативным с разнообразием. Не забудьте начать ввод "do" с глагола, например: Атака орка. Используйте кнопку отмены, чтобы удалить ваш последний ввод вместе с ответом ИИ. Длинные предложения для действий не проблема! Проявите творческий подход! Хотите больше истории для создания? Используйте команду continue без текста. Попробуйте использовать новые слова часто, ИИ становится более креативным с разнообразием. Используйте команду запомнить, чтобы редактировать контекст истории, который ИИ всегда запоминает. Вы можете использовать Say перед текстом, чтобы поговорить.

source: In
ru: В

# configSummary
source: Shows an embed with the bot configuration options at guild level.
ru: Показывает встраивание с параметрами конфигурации бота на уровне гильдии.

# AdminRequired
source: You need to be an administrator to use this command.
ru: Вы должны быть администратором, чтобы использовать эту команду.

source: Loading...
ru: загрузка...

source: Fergun configuration
ru: Конфигурация Fergun

source: Config canceled.
ru: Конфиг отменен.

# CantDoThat
source: I can't do that.
ru: Я не могу этого сделать.

# softbanSummary
source: Softbans an user (kick + delete user messages).
ru: Софтбаны пользователя (кик + удаление сообщений пользователя).

# softbanParam1
source: The user to softban.
ru: Пользователь на софтбан.

# softbanParam2
source: The number of days to delete it's last messages. 7 by default.
ru: Количество дней, чтобы удалить его последние сообщения. 7 по умолчанию.

# softbanParam3
source: The reason of the softban.
ru: Причина софтбана.

# SoftbanSameUser
source: What? You want to softban yourself?
ru: Какая? Хочешь софтбан сам?

# SoftbanMyself
source: I won't softban myself lol
ru: Я не буду софтбан сам LOL

# Softbanned
source: User {0} was softbanned.
ru: Пользователь {0} был заблокирован.

# AIDCommands
source: AI Dungeon (use {0}aid <command>)
ru: AI Dungeon (используйте {0}aid <command>)

source: Reverting last action...
ru: Возврат последнего действия ...

# 140CharsMax
source: 140 characters max.
ru: Макс. 140 символов

source: Invite link
ru: Пригласить ссылку

# NoManageMessages
source: Some commands work better with the `Manage Messages` permission (`img`, `urban`, `config`)
ru: Некоторые команды работают лучше с разрешением «Управление сообщениями» («img», «urban», «config»)

source: Invalid text.
ru: Неверный текст.

# clearRemarks
source: If an user is passed, the command will try to delete all the messages from the user in the last `count` messages. The limit of days that the bot can search messages is 14.
ru: Если пользователь пропущен, команда попытается удалить все сообщения пользователя в последних сообщениях `count`. Максимальное количество дней, в течение которых бот может искать сообщения, - 14.

source: Ban Members
ru: Забанить участников

source: Kick Members
ru: Участники Kick

# UserNotBanned
source: The user isn't banned.
ru: Пользователь не забанен.

# BotMention
source: My prefix here is `{0}`. Use `{0}help` to see my command list and `{0}prefix` to change the prefix.
ru: Мой префикс здесь `{0}`. Используйте `{0}help`, чтобы увидеть мой список команд, и` {0}prefix`, чтобы изменить префикс.

# NotSupportedInDM
source: I don't think you can use that here.
ru: Я не думаю, что вы можете использовать это здесь.

# tcdneSummary
source: This cat does not exist
ru: Этот кот не существует

# tpdneSummary
source: This person does not exist
ru: Этот человек не существует

# YTSearchCap
source: YouTube search cap reached :(
ru: Достигнут лимит поиска в YouTube :(

# CreatingVideoCache
source: Someone is already creating a video cache, please wait..
ru: Кто-то уже создает видео кеш, пожалуйста, подождите ..

source: User
ru: пользователь

# editsnipeSummary
source: Shows the last edited message in the current channel.
ru: Показывает последнее отредактированное сообщение в текущем канале.

# reactionSummary
source: Adds a reaction to a message.
ru: Добавляет реакцию на сообщение.

# reactionParam1
source: The reaction to add (only one)
ru: Реакция на добавление (только одна)

# reactionParam2
source: The message ID to add a reaction (must be from same channel the command is executed).
ru: Идентификатор сообщения для добавления реакции (должно быть с того же канала, на котором выполняется команда).

# InvalidMessageID
source: Invalid message ID. Make sure the message is from this channel.
ru: Неверный идентификатор сообщения. Убедитесь, что сообщение пришло с этого канала.

# InvalidReaction
source: Invalid emote/emoji.
ru: Недопустимая эмоция / эмодзи.

# BadArgumentCount
source: The command is missing required arguments. Use `{0}help {1}` to get more info about the command.
ru: В команде отсутствуют обязательные аргументы. Используйте `{0} help {1}`, чтобы получить больше информации о команде.

# CommandParseFailed
source: Error parsing the command arguments. An argument is invalid or the order of the arguments is incorrect. Use `{0}help {1}` to get more info about the command.
ru: Ошибка разбора аргументов команды. Аргумент неверен или порядок аргументов неверен. Используйте `{0} help {1}`, чтобы получить больше информации о команде.

source: Translation results
ru: Результаты перевода

# SourceLanguage
source: Source language (Detected)
ru: Исходный язык (обнаружено)

source: Target language
ru: Язык перевода

source: Result
ru: Результат

source: Error type
ru: Тип ошибки

source: Error message
ru: Сообщение об ошибке

# seekSummary
source: Seeks the current track to the specified position.
ru: Поиск текущей дорожки в указанной позиции.

# seekParam1
source: The nth second to seek or a valid time with the format `m:ss`, `mm:ss`, `h:mm:ss` or `hh:mm:ss`.
ru: Девятая секунда для поиска или правильное время в формате `m: ss`,` mm: ss`, `h: mm: ss` или` hh: mm: ss`.

# CannotSeek
source: Cannot seek this track.
ru: Не могу найти этот трек.

# SeekHigherOrEqual
source: The second to go ({0}) cannot be higher or equal than the track's length ({1})
ru: Второй ход ({0}) не может быть больше или равен длине трека ({1})

# SeekComplete
source: Skipped to second {0} ({1} of {2})
ru: Пропущен до второго {0} ({1} из {2})

# ErrorInTranslation
source: An error occurred in the translation API. Please try again later.
ru: Произошла ошибка в API перевода.

# statsSummary
source: Shows the bot stats.
ru: Показывает статистику ботов.

# AdventureDeleted
source: The adventure was deleted.
ru: Приключение было удалено.

source: CPU Usage
ru: Использование процессора

source: RAM Usage
ru: Использование ОЗУ

source: Library
ru: Библиотека

source: Bot version
ru: Бот версия

source: Operating System
ru: Операционная система

source: Bot owner
ru: Владелец бота

# CurrentNewNickEqual
source: The current nickname and the new nick are the same.
ru: Текущий ник и новый ник совпадают.

source: Yes
ru: да

source: No
ru: нет

source: True
ru: Правда

source: False
ru: Ложь

# ConfigList
source: Auto translate Captionbot (`identify`) results Auto translate AI Dungeon input & output Track selection for `play`
ru: Авто перевод Captionbot (`определить`) результаты Автоматический перевод ввода и вывода AI Dungeon Выбор трека для `play`

# ConfigPrompt
source: Use the reactions to enable or disable an option.
ru: Используйте реакции, чтобы включить или выключить опцию.

# FergunConfig
source: Fergun configuration
ru: Конфигурация Fergun

source: Option
ru: вариант

source: Value
ru: Ценность

# MissingPermissions
source: You don't have the permissions to run this command.
ru: У вас нет прав для запуска этой команды.

# UserBlacklisted
source: The user {0} was blacklisted.
ru: Пользователь {0} был в черном списке.

# UserBlacklistedWithReason
source: The user {0} was blacklisted with the reason: {1}
ru: Пользователь {0} занесен в черный список по причине: {1}

# UserBlacklistRemoved
source: The user {0} was removed from the blacklist.
ru: Пользователь {0} был удален из черного списка.

# blacklistSummary
source: Adds an user to the blacklist, or removes it.
ru: Добавляет пользователя в черный список или удаляет его.

# blacklistParam1
source: The ID of the user to blacklist.
ru: Идентификатор пользователя в черный список.

# blacklistParam2
source: The reason of the blacklist.
ru: Причина черного списка.

# Blacklisted
source: You are in the blacklist.
ru: Вы в черном списке.

# BlacklistedWithReason
source: You are in the blacklist with the reason: {0}
ru: Вы в черном списке с причиной: {0}

# Changelog0.9
source: - Added support to new languages. - New language (Spanish) - New commands (`language`, `xkcd`, `nowplaying`, `snipe`, `changelog`) - `ytrandom` now works much better. - The command list and the help comand are now dynamic. - Fixed some bugs.
ru: - Добавлена ​​поддержка новых языков. - Новый язык (испанский) - Новые команды (`language`,` xkcd`, `nowplaying`,` snipe`, `changelog`) - `ytrandom` теперь работает намного лучше. - Список команд и справочная команда теперь являются динамическими. - Исправлены некоторые ошибки.

# Changelog1.0
source: - AI Dungeon system and commands, including a story ID system and auto translation. - Configuration system for some commands at guild level. - New commands: AI Dungeon: `info`, `new`, `continue`, `revert`, `remember`, `alter`, `makepublic`, `makeprivate`, `idlist`, `idinfo`, `delete` Other: `eval`, `config`, `softban`, `tcdne`, `tpdne`, `editsnipe`, `reaction`, `seek`, `stats`, `blacklist`, `ocrtranslate`, `roleinfo` - Support to DM channels. - Now the bot uses a proper database. - More bug fixes.
ru: - Система и команды AI Dungeon, включая систему идентификации историй и автоматический перевод. - Конфигурация системы для некоторых команд на уровне гильдии. - Новые команды: AI Dungeon: `info`,` new`, `continue`,` revert`, `Remember`,` alter`, `makepublic`,` makeprivate`, `idlist`,` idinfo`, `delete` Другие: `eval`,` config`, `softban`,` tcdne`, `tpdne`,` editsnipe`, `response`,` seek`, `stats`,` blacklist`, `ocrtranslate`,` roleinfo` - Поддержка каналов DM. - Теперь бот использует правильную базу данных. - Больше исправлений ошибок.

# UserRequireBanMembers
source: You need the `Ban Members` permission to use this command.
ru: Вам нужно разрешение `Ban Members`, чтобы использовать эту команду.

# BotRequireBanMembers
source: I need the `Ban Members` permission to execute this command.
ru: Мне нужно разрешение `Ban Members` для выполнения этой команды.

# UserRequireManageMessages
source: You need the `Manage Messages` permission to use this command.
ru: Для использования этой команды вам необходимо разрешение «Управление сообщениями».

# BotRequireManageMessages
source: I need the `Manage Messages` permission to execute this command.
ru: Мне нужно разрешение «Управление сообщениями» для выполнения этой команды.

# UserRequireKickMembers
source: You need the `Kick Members` permission to use this command.
ru: Для использования этой команды вам необходимо разрешение `Kick Members`.

# BotRequireKickMembers
source: I need the `Kick Members` permission to execute this command.
ru: Мне нужно разрешение `Kick Members` для выполнения этой команды.

# UserRequireManageNicknames
source: You need the `Manage Nicknames` permission to use this command.
ru: Чтобы использовать эту команду, вам необходимо разрешение «Управление никами».

# BotRequireManageNicknames
source: I need the `Manage Nicknames` permission to execute this command.
ru: Мне нужно разрешение «Управление никами» для выполнения этой команды.

# UserNotLowerHierarchy
source: Specified user must be lower in hierarchy.
ru: Указанный пользователь должен быть ниже по иерархии.

# BotRequireConnect
source: I need the `Connect` permission to join the voice channel.
ru: Мне нужно разрешение `Connect ', чтобы присоединиться к голосовому каналу.

# BotRequireSpeak
source: I need the `Speak` permission to continue.
ru: Мне нужно разрешение «Говорить», чтобы продолжить.

# MoveSameChannel
source: Move to the voice channel you want me to go.
ru: Перейдите на голосовой канал, на который вы хотите, чтобы я пошел.

# ProcessingTime
source: Processing time: {0}ms
ru: Время обработки: {0} мс

source: OCR Results
ru: Результаты OCR

# BotRequireAttachFiles
source: I need the `Attach Files` permission to execute this command.
ru: Мне нужно разрешение `Attach Files` для выполнения этой команды.

# OcrApiError
source: Error in the OCR API.
ru: Ошибка в OCR API.

# forceprefixSummary
source: Force sets the prefix in this guild.
ru: Force устанавливает префикс в этой гильдии.

# FirstTip
source: Use {0}aid continue <ID> [text] to continue your adventure.
ru: Используйте {0} помощи, продолжайте <ID> [текст], чтобы продолжить ваше приключение.

# PrefixTooLong
source: The reason of the blacklist.
ru: Причина черного списка.

source: Invalid URL.
ru: Неправильный адрес.

# ocrtranslateSummary
source: OCR and translate.
ru: OCR и перевести.

# ocrtranslateParam1
source: The target language in ISO code (en, es, br, etc.)
ru: Целевой язык в коде ISO (en, es, br и т. Д.)

# ocrtranslateParam2
source: The url of an image to use.
ru: URL изображения для использования.

source: Input
ru: вход

source: Role not found.
ru: Роль не найдена.

source: Role info
ru: Информация о роли

source: Color
ru: цвет

source: Is mentionable
ru: Упоминается

source: Permissions
ru: права доступа

source: Member count
ru: Количество участников

source: Mention
ru: Упоминание

# roleinfoSummary
source: Gets information about a role.
ru: Получает информацию о роли.

# roleinfoParam1
source: The role to get info from (it isn't necessary to mention it).
ru: Роль для получения информации (упоминать ее не обязательно).

# logoutSummary
source: Disconnects the bot.
ru: Отключает бот.

# nothingSummary
source: The best command.
ru: Лучшая команда.

# someoneSummary
source: Returns a random user.
ru: Возвращает случайного пользователя.

source: Active clients
ru: Активные клиенты

source: Low
ru: Низкий

source: Medium
ru: средний

source: High
ru: Высокая

source: Extreme
ru: крайность

source: Is hoisted
ru: Лапы

source: Position
ru: Должность

# ServerFeatures
source: Features
ru: особенности

# SeekTimeHigherOrEqual
source: The time to go ({0}) cannot be higher or equal than the track's length ({1})
ru: Время перехода ({0}) не может быть больше или равно длине трека ({1})

# SeekTimeComplete
source: Skipped to {0} of {1}
ru: Пропущено до {0} из {1}

# SeekInvalidFormat
source: You must pass an integer or a string with the format `m:ss`, `mm:ss`, `h:mm:ss` or `hh:mm:ss`.
ru: Вы должны передать целое число или строку в формате `m: ss`,` mm: ss`, `h: mm: ss` или` hh: mm: ss`.

# Ratelimited
source: Wait {0} seconds before using this command again!
ru: Подождите {0} секунд, прежде чем снова использовать эту команду!

source: Object not found.
ru: Объект не найден.

# MultipleMatches
source: Multiple matches found.
ru: Найдено несколько совпадений.

source: Roles
ru: Роли

source: Boosting since
ru: Повышение с

# AlreadyConnected
source: The bot is already connected to a voice channel.
ru: Бот уже подключен к голосовому каналу.

source: Invalid file type.
ru: Неверный тип файла.

source: Owner commands
ru: Владелец команды

# Vote
source: You can vote for me [here]({0}). Thank you.
ru: Вы можете проголосовать за меня [здесь] ({0}). Спасибо.

# voteSummary
source: Shows an embed with the vote link.
ru: Показывает вставку со ссылкой для голосования.

source: Total servers
ru: Всего серверов

source: Total users
ru: Всего пользователей

# Links
source: [Invite]({0}) | [DBL Bot Page]({1}) | [Vote Link]({2}) | [Support Server]({3})
ru: [приглашение]({0}) | [DBL Страница бота]({1}) | [Ссылка для голосования]({2}) | [Сервер поддержки]({3})

# ContactInfo
source: If you have any bug report, question or suggestion, you can join the [support server]({0}) or contact me via direct message ({1}).
ru: Если у вас есть сообщение об ошибке, вопрос или предложение, вы можете присоединиться к [серверу поддержки]({0}) или связаться со мной через прямое сообщение ({1}).

source: Redoing last action...
ru: Повтор последнего действия ...

# SelfNoIDs
source: You don't have any adventure IDs. You can use the `new` command to create a new adventure.
ru: У вас нет идентификаторов приключений. Вы можете использовать команду `new`, чтобы создать новое приключение.

# QueueExcess
source: ..and {0} more tracks!
ru: ..и еще {0} треков!

# Changelog1.1
source: - Remade the AI Dungeon module and API wrapper 2 times because of constant changes in the API. - New commands (`vote`, `report`, `bash`, `channelinfo`) - The owner commands now has its own module. - Now the commands' cooldown time is displayed. - Now the bot is hosted on a VPS. - Limited the music queue to 10 tracks. - `seek` now allows a time with the format `mm:ss` or `hh:mm:ss` like 30:45 or 6:23:12. - Fixed a bug that caused the bot to disconnect from a voice channel when Discord requested a reconnection. - Fixed a bug in `wikipedia` that returned error 404 when an article was not found in the current language of the bot. ...and more bug fixes.
ru: - Переработан модуль AI Dungeon и обертка API 2 раза из-за постоянных изменений в API. - Новые команды (`voice`,` report`, `bash`,` channelinfo`) - Владелец команды теперь имеет свой собственный модуль. - Теперь отображается время восстановления команд. - Теперь бот размещен на VPS. - Ограничена музыкальная очередь до 10 треков. - `seek` теперь разрешает время в формате` mm: ss` или `hh: mm: ss`, например 30:45 или 6:23:12. - Исправлена ​​ошибка, из-за которой бот отключался от голосового канала, когда Discord запрашивал переподключение. - Исправлена ​​ошибка в `wikipedia`, которая возвращала ошибку 404, когда статья не была найдена на текущем языке бота. ... и другие исправления ошибок.

# ErrorSentToOwner
source: The owner has been notified about the error and the issue will be investigated.
ru: Владелец был уведомлен об ошибке, и проблема будет расследована.

# bashSummary
source: Runs a bash command.
ru: Запускает команду bash.

# supportSummary
source: Shows the support info.
ru: Показывает информацию поддержки.

source: Topic
ru: Тема
