Repository: d4n3436/Fergun
Catalog: src/Fergun/strings.*.resx
Languages: ru

source: Command List
ru: Список команд

source: Entertainment commands
ru: Развлекательные команды

# HelpFooter
source: Fergun {0} - Total command count: {1}
ru: Fergun {0} - Общее количество командование: {1}

source: Moderation commands
ru: Команды модерации

source: Music commands
ru: Музыкальные команды

source: Notes
ru: Ноты

# NotesInfo
source: Use `{0}help [command]` to get more info about a command.
ru: Используйте `{0}help [command]`, чтобы получить больше информации о команде.

source: Other commands
ru: Другие команды

source: Text commands
ru: Текстовые команды

source: Utility commands
ru: Служебные команды

source: Upcoming commands
ru: Предстоящие команды

# CommandNotFound
source: Command not found. Use `{0}help` to view the command list.
ru: Команда не найдена. Используйте `{0}help` для просмотра списка команд.

# NoDescription
source: (No description available)
ru: (Нет доступного описания)

source: (Optional)
ru: (Необязательный)

source: Usage
ru: Применение

# Alias
source: Alias(es)
ru: Псевдоним(ы)

source: Parameters
ru: Параметры

# mojibakeSummary
source: Shows random unicode characters.
ru: Показывает случайные символы Юникода.

# mojibakeParam1
source: The result length.
ru: Длина результата.

# 3orMoreChars
source: The text must have 3 or more characters.
ru: Текст должен содержать 3 или более символов.

# TooLongToDisplay
source: The resulting text is too long to display ({0})
ru: Полученный текст слишком длинный для отображения ({0})

# normalizeSummary
source: Normalizes a text.
ru: Нормализует текст.

# normalizeParam1
source: The text to normalize.
ru: Текст для нормализации.

# randomizeSummary
source: Randomizes a text.
ru: Рандомизирует текст.

# randomizeParam1
source: The text to randomize.
ru: Текст для рандомизации.

# repeatSummary
source: Repeats a text a number of times.
ru: Повторяет текст несколько раз.

# repeatParam1
source: The times to repeat.
ru: Время повторить.

# repeatParam2
source: The text to repeat.
ru: Текст повторить.

# reverseSummary
source: Reverses a text.
ru: Переворачивает текст.

# reverseParam1
source: The text to reverse.
ru: Текст для реверса.

# reverselinesSummary
source: Reverses the line order of a text.
ru: Меняет порядок строк текста.

# reverselinesParam1
source: The text to reverse its lines.
ru: Текст, чтобы перевернуть его строки.

# reversewordsSummary
source: Reverses the words order of a text.
ru: Меняет порядок слов в тексте.

# reversewordsParam1
source: The text to reverse its words.
ru: Текст, чтобы поменять его слова.

# sarcasmSummary
source: sARcAstIC teXt.
ru: саркастический текст

# sarcasmParam1
source: The text to convert.
ru: Текст для конвертации.

# vaporwaveSummary
source: Converts a text to vaporwave.
ru: Преобразует текст в steamwave.

# vaporwaveParam1
source: The text to convert.
ru: Текст для конвертации.

# avatarSummary
source: Returns the avatar of the current user, or a specific user, if passed.
ru: Возвращает аватар команды вызывающего абонента или определенного пользователя, если он пройден.

# avatarParam1
source: The user to get its avatar.
ru: Пользователь, чтобы получить свой аватар.

# base64encodeSummary
source: Encodes a text to Base64.
ru: Кодирует текст в Base64.

# base64encodeParam1
source: The text to encode.
ru: Текст для кодирования.

# base64decodeSummary
source: Decodes a text from Base64.
ru: Декодирует текст из Base64.

# base64decodeParam1
source: The text to decode.
ru: Текст для декодирования.

# base64decodeInvalid
source: Invalid encoded text.
ru: Неверный закодированный текст.

# choiceSummary
source: Chooses an option from a list.
ru: Выбирает вариант из списка.

# choiceParam1
source: A space separated list of choices.
ru: Разделенный пробелами список вариантов.

source: I choose...
ru: Я выбираю...

# OneChoice
source: ...because you only gave me one choice
ru: ... потому что ты дал мне только один выбор

# helpSummary
source: Shows the help menu or the info of a command, if passed.
ru: Показывает меню справки или информацию о команде, если она прошла.

# helpParam1
source: The command to get info from.
ru: Команда для получения информации.

# identifyParam1
source: The url of an image to use.
ru: URL изображения для использования.

# AttachmentNotImage
source: The attachment is not an image.
ru: Вложение не является изображением.

# ImageNotFound
source: Could not find any image url or attachment in the last {0} messages.
ru: Не удалось найти ни одного URL изображения или вложения в последних {0} сообщениях.

# imgParam1
source: The keyword(s) to search.
ru: Ключевое слово (а) для поиска.

# NoResultsFound
source: Could not find any results.
ru: Не удалось найти никаких результатов.

# IfNSFW
source: If the search is NSFW, use the command in a NSFW channel.
ru: Если поиск - NSFW, используйте команду в канале NSFW.

source: Image search
ru: Поиск изображения

# ImageSearchCap
source: Image search cap reached :(
ru: Достигнут предел поиска изображений :(

# ocrSummary
source: Performs OCR to an image with OCR.SPACE
ru: Выполняет OCR для изображения с OCR.SPACE

# OcrEmpty
source: The OCR did not give results.
ru: OCR не дал результатов.

# ocr2Summary
source: Performs OCR to an image with Tesseract.
ru: Выполняет OCR для изображения.

# pingSummary
source: Gets the latency in sending a message and the latency of the Database.
ru: Получает задержку в отправке сообщения и латентность базы данных.

# identifySummary
source: Identifies an image with Microsoft CaptionBot.
ru: Определяет изображение с помощью Microsoft CaptionBot.

# NoUrlPassed
source: Not specifying an url will make the command to search for the last x messages in cache for a link or an attachment.
ru: Не указав URL заставит команду для поиска последних х сообщений в кэше ссылки или вложения.

# UrlNotImage
source: The url is not a valid image.
ru: URL не является допустимым изображением.

# imgSummary
source: Searches for an image with DuckDuckGo.
ru: Ищет изображение с DuckDuckGo.

# UrbanFooter
source: Urban Dictionary - Page {0} of {1}
ru: Городской словарь - Страница {0} из {1}

# ocrParam1
source: The url of an image to use.
ru: URL изображения для использования.

# ImageTooLarge
source: The image is too large.
ru: Изображение слишком большое.

# ocr2Param1
source: The url of an image to use.
ru: URL изображения для использования.

source: Status code:
ru: Код состояния:

# resizeSummary
source: Resizes an image with waifu2x.
ru: Изменяет размер изображения с waifu2x.

# resizeParam1
source: The url of an image to use.
ru: URL изображения для использования.

source: An error occurred.
ru: Произошла ошибка.

source: Resize results
ru: Изменить размер результатов

# screenshotSummary
source: Takes a screenshot to a website.
ru: Делает скриншот на сайт.

# screenshotParam1
source: The website to take a screenshot.
ru: На сайте сделать скриншот.

# serverinfoSummary
source: Returns info about the current server.
ru: Возвращает информацию о текущем сервере.

source: Server info
ru: Информация о сервере

source: Name
ru: имя

source: Owner
ru: владелец

source: Role count
ru: Количество ролей

source: User count
ru: Количество пользователей

source: Verification level
ru: Уровень проверки

source: (None)
ru: (Никто)

source: Created at
ru: Создано на

# snipeSummary
source: Shows the last deleted message in the current channel or the specified.
ru: Показывает последнее удаленное сообщение в текущем канале.

# NothingToSnipe
source: Nothing to snipe in {0}
ru: Нечего стрелять из {0}

# translateSummary
source: Translates a text.
ru: Переводит текст.

# translateParam1
source: The target language in ISO code (`en`, `es`, `br`, etc.)
ru: Целевой язык в коде ISO (`en`, `es`, `br` и т. Д.), Отступает на английский, если цель неверна.

# translateParam2
source: The text to translate.
ru: Текст для перевода.

# InvalidLanguage
source: Invalid target language. The valid language codes are:
ru: Неверный целевой язык. Допустимые языковые коды:

# GoogleIPBanned
source: I got IP banned by Google :( lol
ru: Я получил IP, забаненный Google :( LOL

# ttsSummary
source: Text to speech.
ru: Текст в речь.

# ttsParam1
source: The target language in ISO code (`en`, `es`, `br`, etc.), fallbacks to English if the target is invalid.
ru: Целевой язык в коде ISO (`en`, `es`, `br` и т. Д.), Отступает на английский, если цель неверна.

# ttsParam2
source: The text to convert.
ru: Текст для конвертации.

# urbanSummary
source: Urban Dictionary search.
ru: Городской словарь поиска.

# urbanParam1
source: The keyword(s) to search.
ru: Ключевое слово (а) для поиска.

source: No results.
ru: Нет результатов.

source: By
ru: По

source: Example
ru: пример

# NoExample
source: (No example provided)
ru: (Пример не предоставлен)

# userinfoSummary
source: Returns info about the current user, or a specific user, if passed.
ru: Возвращает информацию о текущем или конкретном пользователе, если он был пройден.

# userinfoParam1
source: The user to get info from.
ru: Пользователь, чтобы получить информацию от.

# wikipediaSummary
source: Searches for an article on Wikipedia.
ru: Ищет статью в Википедии.

# wikipediaParam1
source: The keyword(s) to search.
ru: Ключевое слово (а) для поиска.

source: Wikipedia Search
ru: Поиск в Википедии

# xkcdSummary
source: Returns a random xkcd comic or a specific comic, if a number is passed.
ru: Возвращает случайный комикс xkcd или определенный комикс, если передано число.

# xkcdParam1
source: The comic number.
ru: Комический номер.

# InvalidxkcdNumber
source: Number must be between 1 and {0}.
ru: Число должно быть от 1 до {0}.

# youtubeSummary
source: Searches a video on YouTube.
ru: Ищет видео на YouTube.

# youtubeParam1
source: The keyword(s) to search.
ru: Ключевое слово (а) для поиска.

# YouTubeNoResults
source: Could not find any results.
ru: Не удалось найти никаких результатов.

# ytrandomSummary
source: Returns a "random" YouTube video.
ru: Возвращает «случайное» видео с YouTube.

# EmptyCache
source: Out of cached videos Creating cache...
ru: Из кэшированных видео Создание кеша ...

# banSummary
source: Bans an user.
ru: Запрет пользователя.

# banParam1
source: The user to ban.
ru: Пользователь забанить.

# banParam2
source: The reason of the ban.
ru: Причина запрета.

# BanMyself
source: I won't ban myself lol
ru: Я не буду банить себя лол

# AlreadyBanned
source: The user is already banned.
ru: Пользователь уже забанен.

# Banned
source: User {0} was banned.
ru: Пользователь {0} был запрещен.

# clearSummary
source: Clears the last x messages in the current channel.
ru: Удаляет последние x сообщений в текущем канале.

# clearParam1
source: The number of messages to clear.
ru: Количество сообщений для очистки.

# clearParam2
source: An user to delete its messages.
ru: Информация о пользователе

# NumberOutOfIndex
source: The number must be between {0} and {1}.
ru: Число должно быть между {0} и {1}.

# ClearNotFound
source: Could not find any messages by {0} in the last {1} messages.
ru: Не удалось найти ни одного сообщения {0} в последних {1} сообщениях.

# kickSummary
source: Kicks an user.
ru: Пинает пользователя.

# kickParam1
source: The user to kick.
ru: Пользователь пнуть.

# nickSummary
source: Changes the nickname of an user.
ru: Изменяет ник пользователя.

# nickParam2
source: The new nickname. Leave this empty to remove the nickname.
ru: Новый ник. Оставьте это поле пустым, чтобы удалить псевдоним.

# unbanParam1
source: The user ID to unban.
ru: Идентификатор пользователя для разблокировки.

# triviaSummary
source: Trivia time!
ru: Мелочи время!

# ErrorOnAPI
source: An error occurred while calling the API.
ru: Произошла ошибка при вызове API.

source: User info
ru: Информация о пользователе

source: Activity
ru: Деятельность

source: Is bot
ru: Бот

source: Guild join date
ru: Дата вступления в гильдию

# UserNotFound
source: User not found. Try using a mention or an ID.
ru: Пользователь не найден. Попробуйте использовать упоминание или идентификатор.

# BanSameUser
source: What? You want to ban yourself?
ru: Какая? Вы хотите забанить себя?

# By2
source: by
ru: по

# hackbanSummary
source: Hackbans an user.
ru: Взломать пользователя.

# hackbanParam1
source: The ID of the user to hackban.
ru: Идентификатор пользователя для хакбана.

# hackbanParam2
source: The reason of the hackban.
ru: Причина взлома.

# Hackbanned
source: User {0} was hackbanned.
ru: Пользователь {0} был взломан.

# kickParam2
source: The reason of the kick.
ru: Причина удара.

# Kicked
source: User {0} was kicked.
ru: Пользователь {0} был выгнан.

# nickParam1
source: The user to change its nickname.
ru: Пользователь меняет свой ник.

# unbanSummary
source: Unbans an user.
ru: Unbans пользователя.

# Unbanned
source: User {0} was unbanned.
ru: Пользователь {0} был заблокирован.

# triviaParam1
source: The category to select. Specify "categories" to see the list of categories or "leaderboard"/"ranks" to see the leaderboard.
ru: Категория для выбора. Укажите «категории», чтобы увидеть список категорий, или «список лидеров» / «ранги», чтобы увидеть список лидеров.

source: Category list
ru: Список категорий

source: Trivia leaderboard
ru: Таблица лидеров викторины

# AllQuestionsAnswered
source: Seems that you answered all the questions in the specified category, select another category..
ru: Похоже, что вы ответили на все вопросы в указанной категории, выберите другую категорию.

# TriviaError
source: An error occurred. Error code
ru: Произошла ошибка. Код ошибки

source: Category
ru: категория

source: Type
ru: Тип

source: Difficulty
ru: трудность

source: Question
ru: Вопрос

source: Options
ru: Опции

# TimeLeft
source: You have {0} seconds to answer.
ru: У вас есть {0} секунд, чтобы ответить.

source: Invalid option!
ru: Неверный вариант!

# Lost1Point
source: You lost 1 point.
ru: Вы потеряли 1 очко.

source: Correct answer!
ru: Правильный ответ!

# Won1Point
source: You won 1 point.
ru: Вы выиграли 1 очко.

source: Incorrect!
ru: Некорректное!

source: The answer is
ru: Ответ

source: Time's up!
ru: Время вышло!

source: Points
ru: Точки

# joinSummary
source: Joins a voice channel.
ru: Присоединяется к голосовому каналу.

# UserNotInVC
source: You need to connect to a voice channel.
ru: Вам необходимо подключиться к голосовому каналу.

# NowConnected
source: Now connected to {0}.
ru: Теперь подключен к {0}.

# leaveSummary
source: Leaves a voice channel.
ru: Оставляет голосовой канал.

# LeaveNotInVC
source: Join the channel the bot is in to make it leave.
ru: Присоединяйтесь к каналу, в котором находится бот, чтобы он ушел.

# LeftVC
source: Bot has now left {0}.
ru: Bot теперь осталось {0}.

# moveSummary
source: Moves the bot to the voice channel the current user is.
ru: Перемещает бота на голосовой канал, которым является текущий пользователь.

# MoveNotInVC
source: Join a voice channel where you want the bot to be.
ru: Присоединяйтесь к голосовому каналу, где вы хотите, чтобы бот был.

# playSummary
source: Searches and plays a track from YouTube.
ru: Поиск и воспроизведение трека с YouTube.

# playParam1
source: The keyword(s) to search.
ru: Ключевое слово (а) для поиска.

# SelectTrack
source: Send a number from the list
ru: Отправить номер из списка

source: Search canceled.
ru: Поиск отменен.

# OutOfIndex
source: Option out of index.
ru: Вариант вне индекса.

# SearchTimeout
source: You did not reply before the timeout!
ru: Вы не ответили до истечения времени ожидания!

# replaySummary
source: Replays the current track that is playing, if there's any.
ru: Воспроизводит текущий воспроизводимый трек, если таковой имеется.

# pauseSummary
source: Pauses the player.
ru: Пауза игрока.

# resumeSummary
source: Resumes the playback.
ru: Возобновляет воспроизведение.

# stopSummary
source: Stops the player.
ru: Останавливает плеер.

# skipSummary
source: Skips the current track, if there's any.
ru: Пропускает текущий трек, если есть.

# volumeSummary
source: Sets the player volume.
ru: Устанавливает громкость проигрывателя.

# volumeParam1
source: The volume to set (2 - 150)
ru: Объем для установки (2 - 150)

# queueSummary
source: Shows the queue.
ru: Показывает очередь.

# shuffleSummary
source: Shuffles the queue.
ru: Перетасовывает очередь.

# removeSummary
source: Removes a track in the queue at a specified index.
ru: Удаляет трек в очереди по указанному индексу.

# removeParam1
source: The index of the track to remove.
ru: Индекс дорожки для удаления.

# lyricsSummary
source: Shows the lyrics of the specified song, or the current track in the player if none passed.
ru: Показывает текст указанной песни или текущий трек в плеере, если ничего не пропущено.

# lyricsParam1
source: The song to search its lyrics.
ru: Песня для поиска ее текст.

# artworkSummary
source: Shows the artwork of the current track in the player.
ru: Показывает обложку текущего трека в плеере.

# NoTracks
source: No more tracks to play.
ru: Больше нет треков для воспроизведения.

source: Now playing
ru: Сейчас играет

# PlayerError
source: An error occurred
ru: Произошла ошибка

# PlayerStuck
source: The player got stuck with the track **{0}** for {1} seconds.
ru: Игрок застрял с дорожкой ** {0} ** на {1} секунд.

# PlayerMoved
source: Moved from **{0}** to **{1}**
ru: Перемещено с ** {0} ** на ** {1} **

# PlayerNoMatches
source: No matches found. Try using a Youtube link or a mp3 file link.
ru: Совпадений не найдено. Попробуйте использовать ссылку Youtube или ссылку mp3 файл.

# PlayerPlaylistAdded
source: Playlist **{0}** ({1} tracks) ({2}) has been added to the queue.
ru: Плейлист ** {0} ** ({1} дорожек) ({2}) добавлен в очередь.

# PlayerEmptyPlaylistAdded
source: Queued {0} tracks ({1}) Now playing: {2}
ru: В очереди {0} треков ({1}) Сейчас играет: {2}

# PlayerTrackAdded
source: {0} has been added to the queue.
ru: {0} был добавлен в очередь.

# PlayerNowPlaying
source: Now playing: {0}
ru: Сейчас играет: {0}

source: Invalid track.
ru: Неверный трек.

# Replaying
source: Replaying {0}
ru: Воспроизведение {0}

# EmptyQueue
source: The queue is empty.
ru: Очередь пуста.

# PlayerNotPlaying
source: Player isn't playing.
ru: Игрок не играет.

# PlayerStopped
source: Player now stopped.
ru: Игрок теперь остановлен.

# PlayerTrackSkipped
source: Skipped: {0} Now playing: {1}
ru: Пропущено: {0} Сейчас играет: {1}

# VolumeOutOfIndex
source: Use a number between 2 and 150.
ru: Используйте число от 2 до 150.

# VolumeSet
source: Volume set to: {0}.
ru: Громкость установлена ​​на: {0}.

# PlayerPaused
source: Player is now paused.
ru: Игрок теперь приостановлен.

source: Playback resumed.
ru: Воспроизведение возобновлено.

# PlayerNotPaused
source: Player isn't paused.
ru: Игрок не остановлен.

# CurrentlyPlaying
source: Currently playing: {0} ({1} of {2})
ru: На данный момент играют: {0} ({1} {2})

# MusicInQueue
source: Tracks in queue:
ru: Треки в очереди:

# Queue1Item
source: There's only 1 item in the queue.
ru: В очереди только 1 предмет.

# QueueShuffled
source: The queue was shuffled.
ru: Очередь была перетасована.

source: Index out of range.
ru: Индекс вне диапазона.

# TrackRemoved
source: The track {0} at position {1} was removed.
ru: Трек {0} в позиции {1} был удален.

# LyricsNotFound
source: No lyrics found for {0}.
ru: Нет текст не найдено для {0}.

# botgameSummary
source: Sets the game status of the bot.
ru: Устанавливает игровой статус бота.

# botgameParam1
source: The text to set.
ru: Текст для установки.

source: Bot owner only.
ru: Только владелец бота.

# botstatusSummary
source: Sets the status of the bot.
ru: Устанавливает статус бота.

# botstatusParam1
source: The status to set (0 - 5).
ru: Статус для установки (0 - 5).

# codeSummary
source: Shows the source code of a command.
ru: Показывает исходный код команды.

# codeParam1
source: The command to get its code.
ru: Команда для получения своего кода.

# botcolorSummary
source: Sets the embed color.
ru: Устанавливает цвет встраивания.

# botcolorParam1
source: The new color in hexadecimal or decimal.
ru: Новый цвет в шестнадцатеричном или десятичном виде.

source: Invalid color.
ru: Неправильный цвет.

# cringeSummary
source: Bro you just posted cringe!
ru: Братан ты только что выложил передергиваться!

# globalprefixSummary
source: Sets the bot global prefix.
ru: Устанавливает глобальный префикс бота.

# globalprefixParam1
source: The new global prefix.
ru: Новый глобальный префикс.

# CurrentGlobalPrefix
source: The current global prefix is:
ru: Текущий глобальный префикс:

# PrefixSameCurrentTarget
source: The target prefix and the current prefix are the same.
ru: Префикс цели и текущий префикс совпадают.

# NewGlobalPrefix
source: The new global prefix is: "{0}"
ru: Новый глобальный префикс: "{0}"

# inviteSummary
source: Sends the bot invite link.
ru: Отправляет ссылку приглашения бота.

# prefixSummary
source: Sets the bot prefix.
ru: Устанавливает префикс бота.

# prefixParam1
source: The new prefix.
ru: Новый префикс.

# CurrentPrefix
source: The current prefix is:
ru: Текущий префикс:

# NewPrefix
source: The new guild prefix is: "{0}"
ru: Новый префикс гильдии: "{0}"

# restartSummary
source: Restarts the bot.
ru: Перезапускает бот.

# saySummary
source: Says something.
ru: Что-то говорит

# sayParam1
source: The text to say.
ru: Текст сказать.

# uptimeSummary
source: Shows the bot up-time.
ru: Показывает время работы бота.

# waveSummary
source: hmm
ru: хмм

# languageSummary
source: Sets the bot language.
ru: Устанавливает язык бота.

# NewLanguage
source: The bot language is now: English
ru: Язык бот теперь: Русский ⚠ Google Translate был использован для перевода бота России, так что может быть какая-то ошибка с текстом.

# PaginatorFooter
source: Page {0} of {1}
ru: Страница {0} из {1}

# FailedExecution
source: Failed to execute
ru: Не удалось выполнить

# nowplayingSummary
source: Gets the current track in the player.
ru: Получает текущий трек в плеере.

# changelogSummary
source: Shows the bot changelog.
ru: Показывает журнал изменений бота.

# TempDisabled
source: Disabled temporarily.
ru: Временно отключен

# inspirobotSummary
source: Get some inspirational quotes.
ru: Получить вдохновляющие цитаты.

# PermissionRequired
source: I need the `{0}` permission to execute this command.
ru: Мне нужно`{0}` разрешение на выполнение этой команды.

source: Manage Messages
ru: Управление сообщениями

source: Speak
ru: Разговаривать

# evalSummary
source: Evaluates code.
ru: Оценивает код .

# evalParam1
source: The code to evaluate.
ru: Код для оценки.

# ScreenshotNSFW
source: The screenshot may have NSFW content and it won't be showed. Try using the command on a NSFW channel or use other url.
ru: На скриншоте может быть содержимое NSFW, и оно не будет отображаться. Попробуйте использовать команду на канале NSFW или использовать другой URL.

# BotNotConnected
source: The bot isn't connected to a voice channel.
ru: Бот не подключен к голосовому каналу.

source: Creation canceled.
ru: Создание отменено.

# AIDungeonWelcome
source: Welcome to AI Dungeon
ru: Добро пожаловать в AI Dungeon

# ModeSelect
source: Make sure to read the info and commands with `{0}aid info` before continuing. Select a mode:
ru: Обязательно прочитайте информацию и команды с `{0}aid info`, прежде чем продолжить. Выберите режим:

# CharacterSelect
source: Select a character
ru: Выберите символ

source: Attach Files
ru: Прикреплять файлы

source: Eval results
ru: Результаты Eval

source: Output
ru: Вывод

# EvalFooter
source: Executed in {0}ms
ru: Выполнено за {0} мс

# EvalNoReturnValue
source: Code executed without any return value.
ru: Код выполняется без какого-либо возвращаемого значения.

# NSFWOnly
source: This command can only be used on a NSFW channel.
ru: Эта команда может использоваться только на канале NSFW.
