Repository: d4n3436/Fergun
Catalog: src/Fergun/strings.*.resx
Languages: ru

source: Is NSFW
ru: Является NSFW

source: Slow mode
ru: Медленный режим

source: Channel Info
ru: Информация о канале

# channelinfoSummary
source: Shows info about a channel.
ru: Показывает информацию о канале.

# OcrtrResults
source: OCR and translation results
ru: OCR и результаты перевода

# NoChoices
source: You need to pass at least 1 choice.
ru: Вам необходимо пройти хотя бы 1 выбор.

source: Channel not found.
ru: Канал не найден.

# channelinfoParam1
source: The channel to get info from.
ru: Канал для получения информации.

# UserRequireManageServer
source: You need the `Manage Server` permission to use this command.
ru: Вам нужно разрешение `Manage Server`, чтобы использовать эту команду.

# badtranslatorSummary
source: Passes a text through a bad translator.
ru: Пропускает текст через плохого переводчика.

# badtranslatorParam1
source: The text to use.
ru: Текст для использования.

source: Language chain
ru: Языковая цепочка

# VersionNotFound
source: Version not found. The versions are: {0}
ru: Версия не найдена. Версии: {0}

# OtherVersions
source: Other versions: {0}
ru: Другие версии: {0}

# Changelog1.1.5
source: - New command: `badtranslator` - Added the option to select a track before playing in `play` (disabled by default, you can enable it in `config`). - `img` is back and it now uses DuckDuckGo image search. - `changelog` now lets you pass a specific version so it doesn't display all the version changes at once. - `serverinfo` now shows the server animated icon, if there's one. - Edited the permission requirements for `config`, `prefix` and `language`. - Cleanup in the config and server classes.
ru: - Новая команда: `badtranslator` - Добавлена ​​опция выбора трека перед воспроизведением в `play` (по умолчанию отключено, вы можете включить его в` config`). - `img` вернулся и теперь использует поиск изображений DuckDuckGo. - `changelog` теперь позволяет передавать определенную версию, поэтому он не отображает все изменения версии сразу. - `serverinfo` теперь показывает анимированный значок сервера, если он есть. - Отредактированы требования к разрешениям для `config`,` prefix` и `language`. - Очистка в конфиге и классах сервера.

# changelogParam1
source: A specific version to view.
ru: Конкретная версия для просмотра.

# DeletedMessages
source: Deleted {0} messages.
ru: Удалено {0} сообщений.

# DeletedMessagesByUser
source: Deleted {0} messages by {1}.
ru: Удалено {0} сообщений от {1}.

# calcSummary
source: Evaluates a math expression.
ru: Оценивает математическое выражение.

# calcParam1
source: The expression to evaluate.
ru: Выражение для оценки.

source: Invalid expression.
ru: Неверное выражение.

source: Calc results
ru: Результаты вычислений

# LoopUpdated
source: The player was updated to repeat the track {0} times. Use this command without parameters to disable the track looping.
ru: Проигрыватель обновился, чтобы повторить трек {0} раз. Используйте эту команду без параметров, чтобы отключить зацикливание дорожки.

# LoopNoValuePassed
source: Pass the number of times you want to repeat the track, ex: `{0}loop 5`
ru: Передайте количество раз, которое вы хотите повторить трек, например: `{0}loop 5`

# NowLooping
source: The current track will now be repeated {0} times. To disable the loop, use this command without parameters.
ru: Текущий трек теперь будет повторяться {0} раз. Чтобы отключить цикл, используйте эту команду без параметров.

# LoopEnded
source: The looping for the track: {0} has ended.
ru: Цикл для дорожки: {0} завершен.

# loopSummary
source: Repeats the current track a number of times.
ru: Повторяет текущую дорожку несколько раз.

# loopParam1
source: The number of times to repeat the track.
ru: Количество раз, чтобы повторить трек.

# LoopDisabled
source: The track looping has been disabled.
ru: Зацикливание трека отключено.

# LyricsQueryNotPassed
source: You need to play a track or pass a track name.
ru: Вам необходимо воспроизвести трек или передать название трека.

source: Lyrics by Genius
ru: Текст песни Genius

# PaginatorHelp
source: This is a paginator. React with the respective icons to change page.
ru: Это пагинатор. Реагируйте с соответствующими значками, чтобы изменить страницу.

source: Artist Page
ru: Страница исполнителя

# AdventureDeletionPrompt
source: React to the emoji below to delete the adventure.
ru: Реагируйте на смайлики ниже, чтобы удалить приключение.

# ReactTimeout
source: You did not react before the timeout!
ru: Вы не реагировали до истечения времени ожидания!

source: Language Selection
ru: Выбор языка

# LanguagePrompt
source: React to the language you want to set.
ru: Реагируйте на язык, который вы хотите установить.

# lyricsRemarks
source: Use `-headers` at the end of the command to keep the tags (`[info]`).
ru: Используйте `-headers` в конце команды, чтобы сохранить теги (` [info] `).

# Changelog1.2
source: - New commands: `calc` and `loop` (the 100th command!). - Remade `lyrics` from scratch, I've made my own parser that works a lot better than the integrated one from Victoria. The new parser also allows you to pass a specific song name instead of having to play a song before. - `help` now shows the current command parameters types. - `stats` now shows the bot memory usage next to all the process memory usage. - `urban` now shows the links to the words. - Added more interactivity to `language`, `config`, `trivia` and `aid delete`, now handling the responses with reactions. - Better pagination system for `img`, `urban` and `lyrics`. - Now Lavalink is updated automatically to the dev builds. - Cleanup on the localization functionality, now all the modules uses a custom command base that includes the methods needed for localization. This prevents duplicating the localization methods for each module, and the response times *should* be faster. - Small bug fixes and optimizations.
ru: - Новые команды: `calc` и` loop` (сотая команда!). - Переделал «текст» с нуля, я сделал свой собственный парсер, который работает намного лучше, чем интегрированный из Виктории. Новый синтаксический анализатор также позволяет передавать определенное название песни вместо необходимости проигрывать песню раньше. - `help` теперь показывает текущие типы параметров команды. - `stats` теперь показывает использование памяти бота рядом со всем использованием памяти процесса. - `urban` теперь показывает ссылки на слова. - Добавлено больше интерактивности в `language`,` config`, `trivia` и` aid delete`, теперь обрабатывает ответы с реакциями. - Лучшая система нумерации страниц для «img», «urban» и «lyrics». - Теперь Lavalink обновляется автоматически до сборки dev. - Очистка от функциональности локализации, теперь все модули используют пользовательскую базу команд, которая включает методы, необходимые для локализации. - Небольшие исправления ошибок и оптимизации.

# HelpFooter2
source: <> = Required | [] = Optional | Do not type these symbols when writing the command.
ru: <> = необходимые | [] = По желанию | Не вводите эти символы при написании команды.

# invertSummary
source: Inverts (negates) an image.
ru: Инвертирует (отрицает) изображение.

# invertParam1
source: The url of an image to use.
ru: URL изображения для использования.

# Changelog1.2.3
source: This update contains fixes for bugs that left 1.2 and some changes / new things that were delayed from 1.2 to improve them. - New command: `invert` - Added Russian and Turkish languages (I've used Google Translate so the translations may have lots of errors). - Added some info about the obligatory and optional arguments in `help`. - Added a simple cache system to `img`, `tts` and `urban`. - Now `urban` and `badtranslator` can search / translate random words for you (use the commands without passing anything). - Now the bot will only enter the typing state for long-running commands. - Fixed a bug in `img` that occurred when the embed tried to use an "invalid" url image. - Fixed a bug in `ocr` that occurred when the image was too large. - Fixed a bug in `badtranslator` that made the command fail randomly for no reason. - Fixed a bug with the paginator that flickered in certain circumstances. - Fixed some bugs with the `lyrics` parser.
ru: - Новая команда: `инвертировать` - Добавлены русский и турецкий языки (я использовал Google Translate, поэтому в переводах может быть много ошибок). - Добавлена информация об обязательных и необязательных аргументах в `help`. - Добавлена простая система кеширования для img, tts и urban. - Теперь `urban` и` badtranslator` могут искать / переводить случайные слова для вас (используйте команду, не пропуская ничего). - Теперь бот будет входить в состояние набора только для длительных команд. - Исправлена ошибка в `img`, которая возникала, когда код для вставки пытался использовать недействительное изображение URL. - Исправлена ошибка в `ocr`, которая возникала, когда изображение было слишком большим. - Исправлена ошибка в `badtranslator`, которая приводила к случайному сбою команды без причины. - Исправлена ошибка с paginator для вставки, которая мерцала при определенных обстоятельствах. - Исправлены некоторые ошибки с парсером `lyrics`.

# MessagesOlderThan2Weeks
source: Messages must be younger than two weeks.
ru: Сообщения должны быть моложе двух недель.

# SomeMessagesNotDeleted
source: {0} messages could not be deleted because they are older than two weeks.
ru: {0} Сообщения не могут быть удалены, потому что они старше, чем через две недели.

# Changelog1.2.4
source: - Added a reliability service to prevent deadlocks and an auto-restart script that executes if the bot crashes. - Limited the max. text length in `lyrics`. - Fixed a bug in `invert` that failed in some images. - Fixed a bug in `clear` that showed a warning about messages could not be deleted even if the all the deleted messages are younger than two weeks. - Fixed a bug in `trivia` that would timeout regardless of the input.
ru: - Добавлена служба надежности для предотвращения взаимоблокировок и скрипт автозапуска, который запускается в случае сбоя бота. - ограниченный макс. длина текста в «лирике». - Исправлена ошибка в `инвертировать`, которая не работала на некоторых изображениях. - Исправлена ошибка в `clear`, из-за которой предупреждение о сообщениях не могло быть удалено, даже если все удаленные сообщения были моложе двух недель. - Исправлена ошибка в `пустяках`, которая приводила к таймауту независимо от ввода.

# GuildNotFound
source: Server not found.
ru: Сервер не найден.

# ErrorParsingLyrics
source: An error occurred while parsing the lyrics for {0}. Maybe its's an instrumental?
ru: при разборе текст для {0} произошла ошибка. Может быть, это инструментальное?

# MustBeLowerThan
source: Parameter `{0}` must be lower than {1}.
ru: Параметр {0} должен быть ниже, чем {1}.

source: Invalid ID.
ru: Неверный ID.

source: Hastebin link
ru: Hastebin ссылка

source: Not available.
ru: Недоступно.

# WaitingQueue
source: Waiting for the queue to empty...
ru: Ожидание, пока очередь опустеет ...

# NewOutputPrompt
source: The old output is: {0} Please enter the new output (**not** the command).
ru: Старый выход: {0} Пожалуйста, введите новый выход (**не** командной).

# GeneratingNewResponse
source: Generating a new response...
ru: Генерация нового ответа ...

# InputTypes
source: Input options
ru: Варианты ввода

# InputTypesList
source: Do: An action you want to take in the story. Always start with an action, ex. "Search for the hidden treasure". This is the default option if no one is detected. Say: You can use this to speak, ex. "Leave them alone!" Story: This input stops the AI from putting "You" in front of your input.
ru: Do: действие, которое вы хотите предпринять в истории. Всегда начинай с действия, напр. «Поиск спрятанных сокровищ». Это опция по умолчанию, если никто не обнаружен. Скажите: Вы можете использовать это, чтобы говорить, напр. "Оставь их в покое!" История: Этот вход не дает ИИ поставить «Вы» перед вашим входом.

# Changelog1.2.7
source: - New commands: `color` and `retry`. - Added a command cache service, now you can edit a message to a new command and Fergun will update it's response or send a new one. - Updated the AI Dungeon module and API wrapper, fixed some bugs with the responses and updated the `idinfo` and `alter` commands. Now all the commands are supported. - Now `userinfo` and `avatar` will show the info/avatar of an user that isn't in the server by passing its ID. - Now `userinfo` and `avatar` will show the default avatar if the user doesn't have an avatar. - Now `lyrics` will show the lyrics of the current track playing in your Spotify activity, if there's one. - Now `lyrics` shows correctly the track name when an error happens. - Now it's possible to use `softban` with an user ID. - Now some commands will upload its results to Hastebin when the content is too long. - Fixed some bugs in `tpdne`, `tcdne`, `repeat`, the command service and the paginator system.
ru: - Новые команды: `color` и` retry`. - Добавлен сервис кэширования команд, теперь вы можете отредактировать сообщение для новой команды, и Fergun обновит ее ответ или отправит новую. - Обновлены модуль AI Dungeon и обертка API, исправлены некоторые ошибки с ответами и обновлены команды `idinfo` и` alter`. Теперь все команды поддерживаются. - Теперь `userinfo` и` avatar` будут показывать информацию / аватар пользователя, которого нет на сервере, передавая его ID. - Теперь `userinfo` и` avatar` будут отображать аватар по умолчанию, если у пользователя нет аватара. - Теперь `lyrics` покажет текст текущего трека, который воспроизводится в вашей активности Spotify, если он есть. - Теперь в тексте песни правильно отображается название дорожки при возникновении ошибки. - Теперь можно использовать `softban` с идентификатором пользователя. - Теперь некоторые команды будут загружать свои результаты в Hastebin, когда содержимое слишком длинное. - Исправлены некоторые ошибки в `tpdne`,` tcdne`, `repeat`, службе команд и системе разбивки на страницы.

source: Channel count
ru: Количество каналов

source: Region
ru: Область

source: Default channel
ru: Канал по умолчанию

source: Language not found.
ru: Язык не найден.

source: Category count
ru: Количество категорий

# Changelog1.2.9
source: - Added a backup translator that will be automatically used when the first one fails. - Increased the command cache cleaning interval. - Fixed a bug in `new` that prevented showing the initial prompt. - Fixed a bug in the paginator embed that prevented showing the author avatar if the user didn't have one set. - Fixed other small bugs. - Now Fergun will respond to the command messages if before the message didn't contain any command. - Now `ping` shows the database latency. - Reduced the memory usage.
ru: - Добавлен резервный переводчик, который будет автоматически использоваться при сбое первого. - Увеличен интервал очистки кеша команд. - Исправлена ошибка в `new`, из-за которой не отображалось начальное приглашение. - Исправлена ошибка в кодировке paginator, из-за которой не отображался аватар автора, если у пользователя не было одного набора. - Исправлены другие мелкие ошибки. - Теперь Фергун будет отвечать на сообщения команды, если раньше в сообщении не было ни одной команды. - Теперь `ping` показывает задержку базы данных. - Уменьшено использование памяти.

# DumpingAdventure
source: Dumping the adventure...
ru: Демпинг приключения...

source: Edit canceled.
ru: Редактировать отменен.

# Changelog1.3
source: - New command: `dump`. - Updated the AI Dungeon API to use WebSockets. Now the response times are a lot faster. - Updated the `new` command to use reactions instead of having to send numbers or names. - Added proper ID queue support for the AI Dungeon module. - Removed `ocr2`. - Fixed a bug in the command cache that made the bot reply 2 times in some commands because the command message was "updated" to include an embed or a image/video preview. - Fixed a bug in the initialization of the cache for the commands `img`, `urban` and `ytrandom` that prevented the cached results being saved. - Fixed a bug in `new` that caused the selected option to not be correct. - Fixed a bug in `avatar` and `user` that caused the commands to fail because the avatar was not found (Discord returned the cached avatar). - Fixed a bug in `img` that occurred when the embed tried to use an "invalid" url image (this time the "invalid" images will simply be discarded). - Fixed a bug in `ban` and `hackban` that caused the commands to fail when passed a guild user Id that can't be banned, returning error 403. - Fixed a bug in `badtranslator` that caused the command to fail because the target language was not found. - Fixed a bug in `badtranslator` that caused the command to enter in a infinite loop in rare cases. - Fixed a bug in `ytrandom` that caused the command to lock itself if an error occurs when creating the video cache. - Fixed a bug in `snipe` and `editsnipe` that occurred when the text was larger that 1024 characters. - Fixed a bug in `wikipedia` that occured when trying to use the article image. - Fixed a bug in `changelog` that prevented viewing the changelog because of the way the version numbers were saved. - Fixed a bug in `skip` and `seek` that occured when the player state was invalid. - Fixed a bug in `trivia` that caused the text to be encoded instead of decoded. - Now `badtranslator` won't have duplicated languages. - Reduced *more* the memory usage.
ru: - Новая команда: `dump`. - Обновлен API AI Dungeon для использования WebSockets. Теперь время отклика намного быстрее. - Обновлена ​​команда `new` для использования реакций вместо отправки чисел или имен. - Добавлена ​​правильная поддержка очереди ID для модуля AI Dungeon. - Удален `ocr2`. - Исправлена ​​ошибка в кеше команд, из-за которой бот отвечал 2 раза в некоторых командах, потому что командное сообщение было «обновлено» для включения встраивания или предварительного просмотра изображения / видео. - Исправлена ​​ошибка в инициализации кэша для команд `img`,` urban` и `ytrandom`, из-за которой не сохранялись результаты в кэше. - Исправлена ​​ошибка в `new`, из-за которой опция персонажа выбиралась случайным образом без всякой причины. - Исправлена ​​ошибка в `avatar` и` user`, которая приводила к сбою команд из-за того, что аватар не был найден (Discord вернул кэшированный аватар). - Исправлена ​​ошибка в `img`, которая возникала, когда embed пытался использовать« недопустимое »изображение URL (на этот раз« недействительные »URL будут просто отброшены). - Исправлена ​​ошибка в `hackban` и` hackban`, которая приводила к сбою команд при передаче идентификатора пользователя гильдии, который не может быть забанен, возвращая ошибку 403. - Исправлена ​​ошибка в `badtranslator`, которая приводила к сбою команды, поскольку целевой язык не был найден. - Исправлена ​​ошибка в `badtranslator`, из-за которой команда входила в бесконечный цикл в редких случаях. - Исправлена ​​ошибка в `ytrandom`, из-за которой команда блокировалась при возникновении ошибки при создании видео-кэша. - Исправлена ​​ошибка в `snipe` и` editsnipe`, которая возникала, когда текст был больше 1024 символов. - Исправлена ​​ошибка в `wikipedia`, возникающая при попытке использовать изображение статьи. - Исправлена ​​ошибка в `changelog`, которая препятствовала просмотру журнала изменений из-за способа сохранения номеров версий. - Исправлена ​​ошибка в `skip` и` seek`, которая возникала, когда состояние игрока было недействительным. - Исправлена ​​ошибка в `пустяках`, из-за которой текст кодировался, а не декодировался. - Теперь у `badtranslator` не будет дублированных языков. - Уменьшено * больше * использование памяти.

source: Nothing to delete.
ru: Нечего удалять.

source: Members
ru: члены

source: Online
ru: В сети

source: Idle
ru: вхолостую

source: Offline
ru: Не в сети

# aidinfoSummary
source: Shows the AI Dungeon info.
ru: Показывает информацию AI Dungeon.

# aidnewSummary
source: Creates a new adventure.
ru: Создает новое приключение.

# continueSummary
source: Continues the adventure with the provided text. If no text is passed, the AI will generate the story.
ru: Продолжает приключение с предоставленному текста. Если текст не будет принят, ИИ будет генерировать историю.

# continueParam1
source: The adventure ID.
ru: Приключение ID.

# continueParam2
source: The text to use.
ru: Текст для использования.

# undoSummary
source: Undoes the last action.
ru: Отменяет последнее действие.

# undoParam1
source: The adventure ID.
ru: Приключение ID.

# redoSummary
source: Redoes the last undone action.
ru: Повторяет последнее действие отмененного.

# redoParam1
source: The adventure ID.
ru: Приключение ID.

# rememberSummary
source: Adds text to the memory context.
ru: Добавляет текст в контекст памяти.

# rememberParam1
source: The adventure ID.
ru: Приключение ID.

# rememberParam2
source: The text to add.
ru: Текст для добавления.

# alterSummary
source: Edits the last response.
ru: Редактирует последний ответ.

# retrySummary
source: Retries the last action and generates a new response.
ru: Повторит последнее действие и порождает новый ответ.

# retryParam1
source: The adventure ID.
ru: Приключение ID.

# makepublicSummary
source: Makes an ID public.
ru: Делает ID общественности.

# makepublicParam1
source: The adventure ID. You have to own this ID.
ru: Приключение IF. Вы должны иметь этот идентификатор.

# makeprivateSummary
source: Makes an ID private.
ru: Делает ID приватным.

# makeprivateParam1
source: The adventure ID. You have to own this ID.
ru: Приключение IF. Вы должны иметь этот идентификатор.

# idlistSummary
source: Gets the ID list of an user.
ru: Получает список идентификаторов, принадлежащий пользователя.

# idlistParam1
source: The user to get its IDs.
ru: Пользователю получить свои идентификаторы.

# idinfoSummary
source: Shows info about a ID.
ru: Показывает информацию о идентификатора.

# idinfoParam1
source: The adventure ID.
ru: Приключение ID.

# deleteSummary
source: Removes an ID.
ru: Удаляет идентификатор.

# deleteParam1
source: The adventure ID.
ru: Приключение ID.

# dumpSummary
source: Dumps all the text from an ID.
ru: Сплин весь текст из идентификатора.

# dumpParam1
source: The adventure ID.
ru: Приключение ID.

# Changelog1.3.3
source: - Removed `someone`. - Now Fergun will show the command help when using a command incorrectly. - Added a example to every command with parameters in the command help. - Added operating system info in `stats`. - Fixed a bug in `ban`, `kick`, `nick` and `clear` that prevented working properly, saying that the specified user was not found. This happened because the user cache was disabled some time ago. - Fixed a bug in `clear` that would incorrectly say that there are messages older that 2 weeks when there are no messages to delete. - Fixed a bug in `resize` and `invert` that caused the commands to fail because Discord shows an invalid image preview to some urls.
ru: - Удалены `someone`. - Теперь Fergun покажет команду помощи при использовании команды неправильно. - Добавлен пример для каждой команды с параметрами в командной помощи. - Добавлена ​​операционная система информации в `stats`. - Исправлена ​​ошибка в `ban`,` kick`, `` nick` и clear`, что мешало работать должным образом, говоря о том, что указанный пользователь не был найден. Это произошло потому, что кэш-пользователь был отключен некоторое время назад. - Исправлена ​​ошибка в `clear`, что бы неправильно сказать, что есть сообщения старше, что через 2 недели, когда нет сообщений для удаления. - Исправлена ​​ошибка в `` resize` и invert`, вызвавшие команды, чтобы потерпеть неудачу, потому что Раздор показывает неверный предварительный просмотр изображения в некоторых URLs.

# RatelimitUses
source: {0} use(s) every {1}
ru: {0} использует каждый {1}

source: Requirements
ru: Требования
